
 make.py started: 2021-05-30 19:47:02 C:\Users\diegog\Desktop\Diego\min_wage_rent\derived\county_month\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/mental_coupons/ado"

. 
. program main
  1.     local in_derived_large  "../../../drive/derived_large"
  2.     local in_geo            "../../../base/geo_master/output"
  3.     local in_base_large     "../../../drive/base_large"
  4.     local in_qcew           "../../../base/qcew/output"
  5.     local outstub           "../../../drive/derived_large/county_month"
  6.     local logfile           "../output/data_file_manifest.log"
  7. 
.     use countyfips statefips cbsa10 using "`in_geo'/zip_county_place_usps_all
> .dta", clear
  8.     duplicates drop
  9.     isid countyfips
 10.    
.     merge 1:m countyfips using "`in_derived_large'/min_wage/county_statutory_
> mw.dta", ///
>        nogen assert(3) keepusing(year month actual_mw* binding_mw*)
 11.     
.     merge_exp_mw, instub("`in_derived_large'/min_wage")
 12.     
.     merge_zillow, instub("`in_base_large'/zillow")
 13. 
.     /* Should we build ACS population by county-year? Probably we should! */
. 
.     make_date_variables
 14. 
.     merge m:1 statefips countyfips month year ///
>         using "`in_qcew'/ind_emp_wage_countymonth.dta", ///
>         nogen keep(3) assert(1 2 3)
 15. 
.     strcompress
 16.     save_data "`outstub'/county_panel.dta", replace ///
>         key(countyfips year month) log(`logfile')
 17. end

. 
. program merge_exp_mw
  1.     syntax, instub(str)
  2. 
.     merge 1:1 countyfips year month ///
>         using "`instub'/countyfips_experienced_mw.dta", ///
>         assert(1 2 3) keep(1 3) nogen keepusing(exp*)
  3. end

. 
. 
. program merge_zillow
  1.     syntax, instub(str)
  2.     
.     merge 1:1 countyfips year month using "`instub'/zillow_county_clean.dta"
  3.     
.     qui sum medrentpricepsqft_SFCC if _merge == 2 & inrange(year, 2010, 2019)
>     
  4.     assert r(N) == 0
  5.     keep if inlist(_merge, 1, 3)
  6.     drop _merge
  7. end

. 
. program make_date_variables
  1.     gen day = 1
  2.     gen date = mdy(month, day, year)
  3. 
.     gen    year_month = mofd(date)
  4.     format year_month %tm
  5. 
.     gen    quarter      = quarter(dofm(year_month))
  6.     gen    year_quarter = qofd(date)
  7.     format year_quarter %tq
  8. 
.     drop day date
  9. end

. 
. main

Duplicates in terms of all variables

(84,656 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           377,160  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           240
        from master                       240  
        from using                          0  

    matched                           376,920  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                       292,320
        from master                   292,320  (_merge==1)
        from using                          0  (_merge==2)

    matched                            84,840  (_merge==3)
    -----------------------------------------
(0 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           376,902  
    -----------------------------------------
  Converting str to strL: countyfips cbsa10 statefips
    strcompress grew data 23% so far, but I'm not done yet!
  variable year_month was float now int
  variable quarter was float now byte
  variable year_quarter was float now int
  variable year was double now int
  variable month was double now byte
  variable binding_mw was double now byte
  variable binding_mw_ignore_local was double now byte
  variable countyfips was strL now str5
  variable cbsa10 was strL now str5
  variable statefips was strL now str2
  (60,889,279 bytes saved)
       compress shrank data 26%
    strcompress shrank data  9% overall
(data now sorted by countyfips year month)
  (0 bytes saved)
===============================================================================
File: ../../../drive/derived_large/county_month/county_panel.dta
Key: countyfips year month
===============================================================================
  376902:74(74530):2731387515:887921257

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  countyfips |          0
        year |    376,902      2014.5    2.872352       2010       2019
       month |    376,902    6.500048    3.452057          1         12
      cbsa10 |          0
   statefips |          0
-------------+---------------------------------------------------------
actual~w_max |    376,902    7.684479    .8547675       7.25       16.3
actual~l_max |    376,902    7.675508    .8174862       7.25         14
ac~w_wg_mean |    376,902    7.680766    .8362882       7.25      15.59
ac~l_wg_mean |    376,902    7.675508    .8174862       7.25         14
   actual_mw |    376,902    7.679403    .8321953       7.25      15.59
-------------+---------------------------------------------------------
  binding_mw |    376,902    1.340168    .4813553          1          4
actual_mw_~l |    376,902    7.675508    .8174862       7.25         14
binding_mw~l |    376,902    1.337353    .4728071          1          2
  exp_mw_tot |    376,728    7.690364    .8088312       7.25   14.55729
exp_mw_young |    376,728    7.689406    .8041618       7.25   14.51891
-------------+---------------------------------------------------------
exp_mw_low~c |    376,728    7.687799    .8054766       7.25   14.61911
exp_ln_mw_~t |    376,728    2.034635    .0938271   1.981001   2.672786
exp_ln_mw_~g |    376,728    2.034516    .0932809   1.981001   2.669687
exp_ln_mw_~c |    376,728    2.034371    .0935764   1.981001    2.67673
exp_mw_tot~n |    376,728    7.690364    .8088312       7.25   14.55729
-------------+---------------------------------------------------------
exp_mw_you~n |    376,728    7.689406    .8041618       7.25   14.51891
exp_mw_low~n |    376,728    7.687799    .8054766       7.25   14.61911
exp_ln_mw_.. |    376,728    2.034635    .0938271   1.981001   2.672786
exp_ln_mw_.. |    376,728    2.034516    .0932809   1.981001   2.669687
exp_ln_mw_.. |    376,728    2.034371    .0935764   1.981001    2.67673
-------------+---------------------------------------------------------
exp_mw_tot~x |    376,728    7.705551    .8521743       7.25   15.46227
exp_mw_you~x |    376,728    7.704961    .8479923       7.25   15.40051
exp_mw_low~x |    376,728    7.701696      .84436       7.25   15.38413
exp_ln~t_max |    376,728    2.035988    .0971208   1.981001   2.733378
exp_ln~g_max |    376,728    2.035901    .0966154   1.981001   2.728239
-------------+---------------------------------------------------------
exp_ln~c_max |    376,728    2.035617    .0965394   1.981001   2.727209
medrentpri~C |     56,716    1.022075    .6342662   .4472472   17.05931
medrentpri~F |     53,757    .9864211    .5964078   .1214772   17.14286
  year_month |    376,902    659.5001    34.64066        600        719
     quarter |    376,902    2.500016    1.118035          1          4
-------------+---------------------------------------------------------
year_quarter |    376,902       219.5    11.54368        200        239
estcount_b~v |    375,882    480.6721    1875.444          1      57730
avgwwage_b~v |    375,882    766.8751    398.2571          0      26956
 emp_bizserv |    375,882    5755.442    26375.03          0     652629
estcount_c~t |    375,564    237.2003    649.0757          1      17241
-------------+---------------------------------------------------------
avgwwage_c~t |    375,564    752.9864    355.5956          0       8024
   emp_const |    375,564    1940.258    6652.922          0     174156
estcount_e~e |    375,009    436.5662    3639.791          1     247503
avgwwage_e~e |    375,009     649.328    223.1871          0       2749
   emp_eduhe |    375,009    6613.828    24410.77          0     848521
-------------+---------------------------------------------------------
estcount_f~v |    376,746    19.38491    24.97209          1        456
avgwwage_f~v |    376,746     1054.61    267.5534          0       3704
  emp_fedgov |    376,746    889.3268    4715.111          0     215436
estcount_fin |    375,714    259.5253    960.6234          1      30868
avgwwage_fin |    375,714    829.0962    372.6513          0      12775
-------------+---------------------------------------------------------
     emp_fin |    375,714    2414.557    11753.66          0     398481
estcount_i~o |    364,026    44.15359    239.5778          1      13783
avgwwage_i~o |    364,026    686.6109    502.5512          0      16227
    emp_info |    364,026    862.9977    5812.347          0     240358
estcount_l~s |    375,822    253.5942    904.4786          1      40355
-------------+---------------------------------------------------------
avgwwage_l~s |    375,822    276.0832    101.9535          0       2473
    emp_leis |    375,822    4702.415    17553.26          0     555057
estcount_l~v |    376,902    53.10984    107.2365          1       4167
avgwwage_l~v |    376,902    626.2052    259.8212          0       2104
  emp_locgov |    376,902    4228.365    14631.66          0     463785
-------------+---------------------------------------------------------
estcount_m~u |    369,702    106.6581    366.5222          1      13469
avgwwage_m~u |    369,702    824.3446    407.7451          0       7592
    emp_manu |    369,702    3903.066     12101.3          0     376653
estcount_n~s |    373,695     42.2677    86.42643          1       1859
avgwwage_n~s |    373,695     747.716    440.5033          0      23770
-------------+---------------------------------------------------------
  emp_natres |    373,695    603.0012    2802.072          0      97846
estcount_s~v |    369,258    21.98378    107.2457          1       5969
avgwwage_s~v |    369,258    753.7537    327.0118          0       4279
   emp_stgov |    369,258    1371.569    5082.826          0     114555
estcount_t~p |    376,827    557.2072    1826.232          1      59640
-------------+---------------------------------------------------------
avgwwage_t~p |    376,827    653.4479    184.4492          0      11257
  emp_transp |    376,827     8122.32    28243.72          0     875412
        qmon |    376,902    6.500048    3.452057          1         12
   end_month |    376,902    7.500048    3.354106          3         12




(note: file ../../../drive/derived_large/county_month/county_panel.dta not foun
> d)
file ../../../drive/derived_large/county_month/county_panel.dta saved

. 
end of do-file

 make.py ended: 2021-05-30 19:47:14
