
 make.py started: 2020-06-07 15:26:34 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\first_differences\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000 


. 
. program main
  1.         use "../../../drive/derived_large/output/baseline_rent_panel.dta",
>  clear
  2.         keep zipcode place_code msa countyfips statefips year_month calend
> ar_month ///
>                 actual_mw medrentpricepsqft_sfcc
  3.         
.         foreach var in actual_mw medrentpricepsqft_sfcc {
  4.                 gen ln_`var' = ln(`var')
  5.         }
  6.         
.         qui sum year_month
  7.         gen trend = year_month - r(min) + 1
  8.         gen trend_sq = trend^2
  9.         gen trend_cu = trend^3
 10.         
.         xtset zipcode year_month
 11.         
.         save_data "../temp/fd_rent_panel.dta", key(zipcode year_month) replac
> e
 12. end

. 
. main
(40,499 missing values generated)
       panel variable:  zipcode (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(data already sorted by zipcode year_month)
  variable trend was float now int
  variable trend_sq was float now int
  (601,440 bytes saved)
============================================================================
File: ../temp/fd_rent_panel.dta
Key: zipcode year_month
============================================================================
  150360:14(85852):1631673894:1882761810

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |    150,360    51319.01    29004.04       2113      99577
  year_month |    150,360       659.5    34.63993        600        719
  place_code |    124,200       40791    22611.89        410      87240
  countyfips |    150,000    24129.28    16433.47       1003      56021
   statefips |    150,360    24.02953    16.37417          1         56
-------------+---------------------------------------------------------
   actual_mw |    150,360    8.063602    1.192165       7.25         16
calendar_m~h |    150,360         6.5    3.452064          1         12
         msa |    150,360    436.0295    241.1196         12        860
medrentpri~c |    109,861    1.182011    .7855536   .4180214   6.731387
ln_actual_mw |    150,360    2.078049    .1313575   1.981001   2.772589
-------------+---------------------------------------------------------
ln_medrent~c |    109,861    .0411796    .4492291  -.8722228   1.906781
       trend |    150,360        60.5    34.63993          1        120
    trend_sq |    150,360    4860.167    4326.627          1      14400
    trend_cu |    150,360      439230    496178.5          1    1728000




(note: file ../temp/fd_rent_panel.dta not found)
file ../temp/fd_rent_panel.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./first_differences.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./first_differences.do 

. clear all

. set more off

. adopath + ../../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/mental_coupons/ado"

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/mental_coupons/ado"
  [8]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/mental_coupons/ado"
  [8]              "../../../lib/stata/gslab_misc/ado"
  [9]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         use "../temp/fd_rent_panel.dta", clear
  2.         
.         eststo clear
  3.         eststo: reghdfe D.ln_medrentpricepsqft_sfcc D.ln_actual_mw, ///
>             absorb(year_month) vce(cluster statefips) nocons
  4.         estadd local zs_trend "No"      
  5.         estadd local zs_trend_sq "No"
  6.         estadd local zs_trend_cu "No"
  7. 
.         eststo: reghdfe D.ln_medrentpricepsqft_sfcc D.ln_actual_mw, ///
>             absorb(year_month c.trend#i.zipcode) vce(cluster statefips) nocon
> s
  8.         estadd local zs_trend "Yes"     
  9.         estadd local zs_trend_sq "No"
 10.         estadd local zs_trend_cu "No"
 11. 
.         
.         eststo: reghdfe D.ln_medrentpricepsqft_sfcc D.ln_actual_mw, ///
>             absorb(year_month c.trend#i.zipcode c.trend_sq#i.zipcode) ///
>                 vce(cluster statefips) nocons
 12.         estadd local zs_trend "Yes"     
 13.         estadd local zs_trend_sq "Yes"
 14.         estadd local zs_trend_cu "No"
 15. 
.         eststo: reghdfe D.ln_medrentpricepsqft_sfcc D.ln_actual_mw, ///
>             absorb(year_month c.trend#i.zipcode c.trend_sq#i.zipcode c.trend_
> cu#i.zipcode) ///
>                 vce(cluster statefips) nocons
 16.         estadd local zs_trend "Yes"     
 17.         estadd local zs_trend_sq "Yes"
 18.         estadd local zs_trend_cu "Yes"
 19.         
.         esttab * using "../output/fd_table.tex", keep(D.ln_actual_mw) compres
> s se replace ///
>         stats(zs_trend zs_trend_sq zs_trend_cu r2 N, fmt(%9.3f %9.0g) ///
>                 labels("Zipcode-specifc linear trend" ///
>             "Zipcode-specific linear and square trend" ///
>                 "Zipcode-specific linear, square and cubic trend" ///
>             "R-squared" "Observations")) star(* 0.10 ** 0.05 *** 0.01) ///
>                 nonote
 20. end

. 
. main
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 1 HDFE group                            F(   1,     39) =       3.85
Statistics robust to heteroskedasticity           Prob > F        =     0.0569
                                                  R-squared       =     0.0220
                                                  Adj R-squared   =     0.0209
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0277

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_medrent~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_actual_mw |
         D1. |   .0270025   .0137584     1.96   0.057    -.0008266    .0548315
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(est1 stored)

added macro:
           e(zs_trend) : "No"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 2 HDFE groups                           F(   1,     39) =       4.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0352
                                                  R-squared       =     0.0238
                                                  Adj R-squared   =     0.0128
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0278

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_medrent~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_actual_mw |
         D1. |   .0273933   .0125578     2.18   0.035     .0019928    .0527939
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
      year_month |       118           0         118     |
 zipcode#c.trend |      1098           0        1098    ?|
---------------------------------------------------------+
? = number of redundant parameters may be higher
(est2 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 16 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 3 HDFE groups                           F(   1,     39) =       4.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0459
                                                  R-squared       =     0.0257
                                                  Adj R-squared   =     0.0045
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0279

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_medrent~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_actual_mw |
         D1. |   .0265755   .0128899     2.06   0.046     .0005031    .0526478
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       118           0         118     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher
(est3 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 74 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 4 HDFE groups                           F(   1,     39) =       3.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0562
                                                  R-squared       =     0.0280
                                                  Adj R-squared   =    -0.0034
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0280

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_medrent~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_actual_mw |
         D1. |   .0254736    .012946     1.97   0.056    -.0007121    .0516593
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       118           0         118     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
 zipcode#c.trend_cu |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher
(est4 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "Yes"
(note: file ../output/fd_table.tex not found)
(output written to ../output/fd_table.tex)

. 
end of do-file

 make.py ended: 2020-06-07 15:28:26
