
 make.py started: 2020-06-13 15:28:11 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\first_differences\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000 


. 
. program main
  1.         use "../../../drive/derived_large/output/baseline_rent_panel.dta",
>  clear
  2.         keep zipcode place_code msa countyfips statefips year_month calend
> ar_month ///
>                 actual_mw medrentpricepsqft_sfcc medrentprice_sfcc trend tren
> d_sq trend_cu
  3.         
.         foreach var in actual_mw medrentpricepsqft_sfcc medrentprice_sfcc{
  4.                 gen ln_`var' = ln(`var')
  5.         }
  6. 
.         xtset zipcode year_month
  7.         
.     rename (ln_actual_mw ln_medrentpricepsqft_sfcc) (ln_mw ln_med_rent_psqft)
  8.         
.         
.         save_data "../temp/fd_rent_panel.dta", key(zipcode year_month) replac
> e
  9. end

. 
. main
(40,499 missing values generated)
(27,658 missing values generated)
       panel variable:  zipcode (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(data already sorted by zipcode year_month)
  (0 bytes saved)
============================================================================
File: ../temp/fd_rent_panel.dta
Key: zipcode year_month
============================================================================
  150360:16(19328):1689201119:2658988827

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |    150,360    51319.01    29004.04       2113      99577
  year_month |    150,360       659.5    34.63993        600        719
  place_code |    124,200       40791    22611.89        410      87240
  countyfips |    150,000    24129.28    16433.47       1003      56021
   statefips |    150,360    24.02953    16.37417          1         56
-------------+---------------------------------------------------------
medre~e_sfcc |    122,702    1641.121    693.2088        595       6595
   actual_mw |    150,360    8.063602    1.192165       7.25         16
calendar_m~h |    150,360         6.5    3.452064          1         12
         msa |    150,360    436.0295    241.1196         12        860
       trend |    150,360       225.5    34.63993        166        285
-------------+---------------------------------------------------------
    trend_sq |    150,360    52050.17    15659.42      27556      81225
    trend_cu |    150,360    1.23e+07     5408204    4574296   2.31e+07
medre~t_sfcc |    109,861    1.182011    .7855536   .4180214   6.731387
       ln_mw |    150,360    2.078049    .1313575   1.981001   2.772589
ln_med_ren~t |    109,861    .0411796    .4492291  -.8722228   1.906781
-------------+---------------------------------------------------------
ln_medrent~c |    122,702     7.32918    .3733732   6.388561   8.794067




(note: file ../temp/fd_rent_panel.dta not found)
file ../temp/fd_rent_panel.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./first_differences.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./first_differences.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         use "../temp/fd_rent_panel.dta", clear
  2.         
.         run_static_model, depvar(ln_med_rent_psqft) ///
>             absorb(year_month) cluster(statefips)
  3.         
.         esttab * using "../output/fd_table.tex", keep(D.ln_mw) compress se re
> place      ///
>         stats(zs_trend zs_trend_sq zs_trend_cu r2 N, fmt(%9.3f %9.0g)        
>                            ///
>                 labels("Zipcode-specifc linear trend"                        
>                                                            ///
>             "Zipcode-specific linear and square trend"                       
>                                                    ///
>                 "Zipcode-specific linear, square and cubic trend"            
>                                                    ///
>             "R-squared" "Observations")) star(* 0.10 ** 0.05 *** 0.01)       
>                                    ///
>                 nonote
  4.         
.         run_dynamic_model, depvar(ln_med_rent_psqft) ///
>             absorb(year_month) cluster(statefips)
  5.         
.         esttab reg1 reg2 reg3 reg4 using "../output/fd_dynamic_table.tex",   
>                                    ///
>                 keep(*.ln_mw) compress se replace                            
>                                                    ///
>         stats(zs_trend zs_trend_sq zs_trend_cu r2 N, fmt(%9.3f %9.0g)        
>                            ///
>                 labels("Zipcode-specifc linear trend"                        
>                                                            ///
>             "Zipcode-specific linear and square trend"                       
>                                                    ///
>                 "Zipcode-specific linear, square and cubic trend"            
>                                                    ///
>             "R-squared" "Observations")) star(* 0.10 ** 0.05 *** 0.01)       
>                                    ///
>                 nonote
  6. 
.         esttab lincom1 lincom2 lincom3 lincom4 using "../output/fd_dynamic_li
> ncom_table.tex", ///
>                 compress se replace                                          
>                                                                            //
> /
>         stats(zs_trend zs_trend_sq zs_trend_cu N, fmt(%9.0g)                 
>                                    ///
>                 labels("Zipcode-specifc linear trend"                        
>                                                            ///
>             "Zipcode-specific linear and square trend"                       
>                                                    ///
>                 "Zipcode-specific linear, square and cubic trend" "Observatio
> ns"))                              ///
>                 star(* 0.10 ** 0.05 *** 0.01)                                
>                                                                    ///
>                 nonote coeflabel((1) "Sum of MW effects")
  7. end

. 
. program run_static_model
  1.     syntax, depvar(str) absorb(str) cluster(str)
  2.         
.         eststo clear
  3.         eststo: reghdfe D.`depvar' D.ln_mw,                               
>                       ///
>                 absorb(`absorb') ///
>                 vce(cluster `cluster') nocons
  4.         comment_table, trend_lin("No") trend_sq("No") trend_cu("No")
  5. 
.         eststo: reghdfe D.`depvar' D.ln_mw,                                  
>                    ///
>                 absorb(`absorb' c.trend#i.zipcode) ///
>                 vce(cluster `cluster') nocons
  6.         comment_table, trend_lin("Yes") trend_sq("No") trend_cu("No")
  7. 
.         eststo: reghdfe D.`depvar' D.ln_mw,                                  
>                    ///
>                 absorb(`absorb' c.trend#i.zipcode  c.trend_sq#i.zipcode) ///
>                 vce(cluster `cluster') nocons
  8.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("No")
  9. 
.         eststo: reghdfe D.`depvar' D.ln_mw,                                  
>                    ///
>                 absorb(`absorb' c.trend#i.zipcode  c.trend_sq#i.zipcode c.tre
> nd_cu#i.zipcode) ///
>                 vce(cluster `cluster') nocons
 10.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("Yes")
 11. end

. 
. program run_dynamic_model
  1.     syntax, depvar(str) absorb(str) cluster(str)
  2.         
.         eststo clear
  3.         eststo reg1: reghdfe D.`depvar' L(-6/6).D.ln_mw,                  
>       ///
>             absorb(`absorb') ///
>                 vce(cluster `cluster') nocons
  4.         comment_table, trend_lin("No") trend_sq("No") trend_cu("No")
  5. 
.         eststo lincom1: lincomest D1.ln_mw + LD.ln_mw + L2D.ln_mw +     ///
>             L3D.ln_mw + L4D.ln_mw + L5D.ln_mw + L6D.ln_mw
  6.         comment_table, trend_lin("No") trend_sq("No") trend_cu("No")
  7.         
.         eststo reg2: reghdfe D.`depvar' L(-6/6).D.ln_mw,                     
>    ///
>             absorb(`absorb' c.trend#i.zipcode) ///
>                 vce(cluster `cluster') nocons
  8.         comment_table, trend_lin("Yes") trend_sq("No") trend_cu("No")
  9. 
.         eststo lincom2: lincomest D1.ln_mw + LD.ln_mw + L2D.ln_mw +     ///
>             L3D.ln_mw + L4D.ln_mw + L5D.ln_mw + L6D.ln_mw
 10.         comment_table, trend_lin("Yes") trend_sq("No") trend_cu("No")
 11.         
.         eststo reg3: reghdfe D.`depvar' L(-6/6).D.ln_mw,                     
>    ///
>             absorb(`absorb' c.trend#i.zipcode c.trend_sq#i.zipcode) ///
>                 vce(cluster `cluster') nocons
 12.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("No")
 13. 
.         eststo lincom3: lincomest D1.ln_mw + LD.ln_mw + L2D.ln_mw +     ///
>             L3D.ln_mw + L4D.ln_mw + L5D.ln_mw + L6D.ln_mw
 14.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("No")
 15. 
.         eststo reg4: reghdfe D.`depvar' L(-6/6).D.ln_mw,                     
>    ///
>             absorb(`absorb' c.trend#i.zipcode c.trend_sq#i.zipcode c.trend_cu
> #i.zipcode) ///
>                 vce(cluster `cluster') nocons
 16.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("Yes")
 17.         
.         eststo lincom4: lincomest D1.ln_mw + LD.ln_mw + L2D.ln_mw +     ///
>             L3D.ln_mw + L4D.ln_mw + L5D.ln_mw + L6D.ln_mw
 18.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("Yes")
 19. end 

. program comment_table
  1.         syntax, trend_lin(str) trend_sq(str) trend_cu(str)
  2. 
.         estadd local zs_trend           "`trend_lin'"   
  3.         estadd local zs_trend_sq        "`trend_sq'"
  4.         estadd local zs_trend_cu        "`trend_cu'"
  5. end

. 
. main
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 1 HDFE group                            F(   1,     39) =       3.85
Statistics robust to heteroskedasticity           Prob > F        =     0.0569
                                                  R-squared       =     0.0220
                                                  Adj R-squared   =     0.0209
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0277

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0270025   .0137584     1.96   0.057    -.0008266    .0548315
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(est1 stored)

added macro:
           e(zs_trend) : "No"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 2 HDFE groups                           F(   1,     39) =       4.32
Statistics robust to heteroskedasticity           Prob > F        =     0.0442
                                                  R-squared       =     0.0238
                                                  Adj R-squared   =     0.0127
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0278

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0269371   .0129531     2.08   0.044     .0007369    .0531373
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
      year_month |       118           0         118     |
 zipcode#c.trend |      1098           0        1098    ?|
---------------------------------------------------------+
? = number of redundant parameters may be higher
(est2 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 25 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 3 HDFE groups                           F(   1,     39) =       4.19
Statistics robust to heteroskedasticity           Prob > F        =     0.0474
                                                  R-squared       =     0.0263
                                                  Adj R-squared   =     0.0052
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0279

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0264333   .0129119     2.05   0.047     .0003166      .05255
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       118           0         118     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher
(est3 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 159 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 4 HDFE groups                           F(   1,     39) =       3.83
Statistics robust to heteroskedasticity           Prob > F        =     0.0576
                                                  R-squared       =     0.0290
                                                  Adj R-squared   =    -0.0025
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0280

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0259148   .0132445     1.96   0.058    -.0008747    .0527043
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       118           0         118     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
 zipcode#c.trend_cu |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher
(est4 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "Yes"
(note: file ../output/fd_table.tex not found)
(output written to ../output/fd_table.tex)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    102,078
Absorbing 1 HDFE group                            F(  13,     39) =       6.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0225
                                                  Adj R-squared   =     0.0213
                                                  Within R-sq.    =     0.0003
Number of clusters (statefips) =         40       Root MSE        =     0.0277

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F6D. |  -.0070014   .0078817    -0.89   0.380    -.0229437    .0089409
        F5D. |  -.0113018    .009729    -1.16   0.252    -.0309807     .008377
        F4D. |  -.0045064   .0121901    -0.37   0.714    -.0291632    .0201503
        F3D. |   .0026149   .0114117     0.23   0.820    -.0204674    .0256972
        F2D. |   .0040367   .0131126     0.31   0.760    -.0224861    .0305594
         FD. |  -.0035342   .0109407    -0.32   0.748    -.0256639    .0185954
         D1. |   .0307313   .0137971     2.23   0.032     .0028241    .0586385
         LD. |   .0126898   .0056484     2.25   0.030     .0012649    .0241147
        L2D. |  -.0078227   .0136139    -0.57   0.569    -.0353594     .019714
        L3D. |   .0068028   .0085087     0.80   0.429    -.0104077    .0240133
        L4D. |   .0104051   .0074054     1.41   0.168    -.0045736    .0253839
        L5D. |   .0091296   .0067172     1.36   0.182    -.0044572    .0227165
        L6D. |   .0037813   .0121063     0.31   0.756    -.0207059    .0282686
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       107           0         107     |
-----------------------------------------------------+

added macro:
           e(zs_trend) : "No"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw+L6D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0657172   .0351649     1.87   0.069    -.0054105    .1368449
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "No"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    102,078
Absorbing 2 HDFE groups                           F(  13,     39) =       6.70
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0245
                                                  Adj R-squared   =     0.0127
                                                  Within R-sq.    =     0.0003
Number of clusters (statefips) =         40       Root MSE        =     0.0279

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F6D. |  -.0075347   .0072136    -1.04   0.303    -.0221257    .0070562
        F5D. |  -.0122809   .0100929    -1.22   0.231    -.0326957    .0081339
        F4D. |  -.0054931   .0119889    -0.46   0.649    -.0297428    .0187567
        F3D. |   .0015748   .0109531     0.14   0.886    -.0205799    .0237295
        F2D. |   .0030262   .0133577     0.23   0.822    -.0239922    .0300446
         FD. |  -.0044268    .011693    -0.38   0.707    -.0280782    .0192245
         D1. |   .0296249   .0126727     2.34   0.025     .0039919    .0552579
         LD. |   .0115388   .0057748     2.00   0.053    -.0001418    .0232195
        L2D. |  -.0090099   .0132781    -0.68   0.501    -.0358673    .0178476
        L3D. |   .0055835    .007469     0.75   0.459     -.009524     .020691
        L4D. |   .0091632   .0070781     1.29   0.203    -.0051537    .0234801
        L5D. |   .0078749   .0071294     1.10   0.276    -.0065456    .0222955
        L6D. |   .0034165   .0118194     0.29   0.774    -.0204905    .0273235
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
      year_month |       107           0         107     |
 zipcode#c.trend |      1098           0        1098    ?|
---------------------------------------------------------+
? = number of redundant parameters may be higher

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw+L6D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .058192     .02768     2.10   0.042      .002204    .1141801
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 26 iterations)

HDFE Linear regression                            Number of obs   =    102,078
Absorbing 3 HDFE groups                           F(  13,     39) =       6.79
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0274
                                                  Adj R-squared   =     0.0048
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         40       Root MSE        =     0.0280

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F6D. |  -.0086419   .0068138    -1.27   0.212    -.0224242    .0051404
        F5D. |  -.0140175   .0104007    -1.35   0.186    -.0350549    .0070199
        F4D. |  -.0072827    .011258    -0.65   0.521    -.0300542    .0154887
        F3D. |  -.0001413   .0110914    -0.01   0.990    -.0225758    .0222933
        F2D. |   .0013024   .0130766     0.10   0.921    -.0251475    .0277523
         FD. |  -.0062706    .012503    -0.50   0.619    -.0315603    .0190191
         D1. |   .0272293   .0122301     2.23   0.032     .0024917     .051967
         LD. |   .0092662   .0056899     1.63   0.111    -.0022427    .0207752
        L2D. |  -.0112422    .012306    -0.91   0.367    -.0361334     .013649
        L3D. |   .0034377   .0081427     0.42   0.675    -.0130325    .0199079
        L4D. |   .0073882    .007005     1.05   0.298    -.0067808    .0215572
        L5D. |   .0061739   .0069044     0.89   0.377    -.0077915    .0201394
        L6D. |   .0026276   .0117954     0.22   0.825    -.0212308    .0264859
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       107           0         107     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "No"
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw+L6D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0448807   .0209084     2.15   0.038     .0025895    .0871719
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 186 iterations)

HDFE Linear regression                            Number of obs   =    102,078
Absorbing 4 HDFE groups                           F(  13,     39) =       7.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0301
                                                  Adj R-squared   =    -0.0034
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         40       Root MSE        =     0.0281

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F6D. |  -.0072776   .0068632    -1.06   0.295    -.0211597    .0066045
        F5D. |  -.0120702   .0105112    -1.15   0.258    -.0333311    .0091907
        F4D. |  -.0053699    .010565    -0.51   0.614    -.0267397    .0159998
        F3D. |   .0017166   .0111378     0.15   0.878    -.0208117    .0242448
        F2D. |   .0032381   .0131205     0.25   0.806    -.0233005    .0297768
         FD. |  -.0048032   .0129028    -0.37   0.712    -.0309017    .0212952
         D1. |   .0286436   .0123899     2.31   0.026     .0035826    .0537046
         LD. |   .0106727   .0067009     1.59   0.119    -.0028812    .0242265
        L2D. |  -.0098852   .0128296    -0.77   0.446    -.0358356    .0160652
        L3D. |   .0047924   .0085829     0.56   0.580     -.012568    .0221529
        L4D. |   .0087617   .0080876     1.08   0.285     -.007597    .0251203
        L5D. |   .0074972   .0069386     1.08   0.287    -.0065374    .0215318
        L6D. |   .0030257   .0113737     0.27   0.792    -.0199799    .0260312
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       107           0         107     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
 zipcode#c.trend_cu |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "Yes"
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw+L6D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .053508   .0257629     2.08   0.044     .0013978    .1056183
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "Yes"
(note: file ../output/fd_dynamic_table.tex not found)
(output written to ../output/fd_dynamic_table.tex)
(note: file ../output/fd_dynamic_lincom_table.tex not found)
(output written to ../output/fd_dynamic_lincom_table.tex)

. 
end of do-file

 make.py ended: 2020-06-13 15:39:23
