
 make.py started: 2020-06-17 21:17:28 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\first_differences\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/output"
  2.         local outstub "../temp"
  3.         local logfile "../output/data_file_manifest.log"
  4. 
.         use "`instub'/baseline_rent_panel.dta", clear
  5.         keep zipcode place_code msa countyfips statefips                  
>                                               ///
>                 year_month calendar_month trend trend_sq trend_cu            
>                                            ///
>                 actual_mw medrentpricepsqft_sfcc medrentprice_sfcc           
>                                            ///
>                 med_hhinc20105 renthouse_share2010
  6.         
.         create_vars,    log_vars(actual_mw medrentpricepsqft_sfcc medrentpric
> e_sfcc)    ///
>                                         heterogeneity_vars(med_hhinc20105 ren
> thouse_share2010)
  7.         
.         simplify_varnames
  8. 
.         xtset zipcode year_month
  9.         
.         save_data "`outstub'/fd_rent_panel.dta", key(zipcode year_month) repl
> ace log(`logfile')
 10. end

. 
. program create_vars
  1.         syntax, log_vars(str) heterogeneity_vars(str)
  2. 
.         foreach var in `log_vars' {
  3.                 gen ln_`var' = ln(`var')
  4.         }
  5. 
.         foreach var in `heterogeneity_vars' {
  6.                 xtile `var'_nat_dec = `var', nq(10)
  7.                 xtile `var'_nat_qtl = `var', nq(5)
  8.                 levelsof statefips, local(states)
  9. 
.                 foreach state in `states'{
 10.                         xtile deciles_`state'_`var' = `var' if statefips =
> = `state', nq(10)
 11.                         xtile qtiles_`state'_`var' = `var' if statefips ==
>  `state', nq(5)
 12.                 }
 13.                 egen `var'_st_dec = rowtotal(deciles_*)
 14.                 egen `var'_st_qtl = rowtotal(qtiles_*)
 15.                 drop deciles_* qtiles_*
 16.         }
 17. end

. 
. program simplify_varnames
  1.         
.     rename      (ln_actual_mw   ln_medrentpricepsqft_sfcc)              ///
>                 (ln_mw                  ln_med_rent_psqft)
  2. 
. end

. 
. main
(40,499 missing values generated)
(27,658 missing values generated)
1 2 4 5 6 8 9 10 11 12 13 15 16 17 18 20 21 22 24 25 26 27 28 29 32 34 35 36 37
>  39 40 41 42 44 45 47 48 51 53 56
1 2 4 5 6 8 9 10 11 12 13 15 16 17 18 20 21 22 24 25 26 27 28 29 32 34 35 36 37
>  39 40 41 42 44 45 47 48 51 53 56
       panel variable:  zipcode (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(data already sorted by zipcode year_month)
  variable trend was float now int
  variable trend_sq was float now int
  variable med_hhinc20105_st_dec was float now byte
  variable med_hhinc20105_st_qtl was float now byte
  variable renthouse_share2010_st_dec was float now byte
  variable renthouse_share2010_st_qtl was float now byte
  (2,405,760 bytes saved)
============================================================================
File: ../temp/fd_rent_panel.dta
Key: zipcode year_month
============================================================================
  150360:26(64909):354557548:1157080972

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |    150,360    51319.01    29004.04       2113      99577
  year_month |    150,360       659.5    34.63993        600        719
  place_code |    124,200       40791    22611.89        410      87240
  countyfips |    150,000    24129.28    16433.47       1003      56021
   statefips |    150,360    24.02953    16.37417          1         56
-------------+---------------------------------------------------------
medre~e_sfcc |    122,702    1641.121    693.2088        595       6595
   actual_mw |    150,360    8.063602    1.192165       7.25         16
calendar_m~h |    150,360         6.5    3.452064          1         12
         msa |    150,360    436.0295    241.1196         12        860
medre~t_sfcc |    109,861    1.182011    .7855536   .4180214   6.731387
-------------+---------------------------------------------------------
renthou~2010 |    150,360    .3777207    .1762493    .062864   .9660729
med_hh~20105 |    150,360    66845.06    24426.27   20527.66   191553.2
       trend |    150,360        60.5    34.63993          1        120
    trend_sq |    150,360    4860.167    4326.627          1      14400
    trend_cu |    150,360      439230    496178.5          1    1728000
-------------+---------------------------------------------------------
       ln_mw |    150,360    2.078049    .1313575   1.981001   2.772589
ln_med_ren~t |    109,861    .0411796    .4492291  -.8722228   1.906781
ln_medrent~c |    122,702     7.32918    .3733732   6.388561   8.794067
med_h~at_dec |    150,360    5.496409    2.872289          1         10
med_h~at_qtl |    150,360    2.998404    1.414217          1          5
-------------+---------------------------------------------------------
med_h~st_dec |    150,360    5.373504    2.878945          1         10
med_h~st_qtl |    150,360    2.944134    1.416499          1          5
renth~at_dec |    150,360    5.496409    2.872289          1         10
renth~at_qtl |    150,360    2.998404    1.414217          1          5
renth~st_dec |    150,360    5.373504    2.878945          1         10
-------------+---------------------------------------------------------
renth~st_qtl |    150,360    2.944134    1.416499          1          5




(note: file ../temp/fd_rent_panel.dta not found)
file ../temp/fd_rent_panel.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./first_differences.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./first_differences.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../temp"
  2.         local outstub "../output"
  3. 
.         use "`instub'/fd_rent_panel.dta", clear
  4. 
.         * Static Model
.         run_static_model, depvar(ln_med_rent_psqft) absorb(year_month)       
>                                    ///
>                 cluster(statefips)
  5. 
.         esttab * using "`outstub'/fd_table.tex", keep(D.ln_mw) compress se re
> place                      ///
>                 stats(zs_trend zs_trend_sq zs_trend_cu r2 N, fmt(%s3 %s3 %s3 
> %9.3f %9.0g)               ///
>                 labels("Zipcode-specifc linear trend"                        
>                                                            ///
>                 "Zipcode-specific linear and square trend"                   
>                                                            ///
>                 "Zipcode-specific linear, square and cubic trend"            
>                                                    ///
>                 "R-squared" "Observations")) star(* 0.10 ** 0.05 *** 0.01)   
>                                            ///
>                 nonote
  6.         
.         * Dynamic Model
.         run_dynamic_model, depvar(ln_med_rent_psqft) absorb(year_month)      
>                                    ///
>                 cluster(statefips)
  7.         
.         esttab reg1 reg2 reg3 reg4 using "`outstub'/fd_dynamic_table.tex",   
>                                    ///
>                 keep(*.ln_mw) compress se replace                            
>                                                                    ///
>                 stats(zs_trend zs_trend_sq zs_trend_cu r2 N, fmt(%s3 %s3 %s3 
> %9.3f %9.0g)               ///
>                 labels("Zipcode-specifc linear trend"                        
>                                                            ///
>                 "Zipcode-specific linear and square trend"                   
>                                                            ///
>                 "Zipcode-specific linear, square and cubic trend"            
>                                                    ///
>                 "R-squared" "Observations")) star(* 0.10 ** 0.05 *** 0.01)   
>                                            ///
>                 nonote
  8. 
.         esttab lincom1 lincom2 lincom3 lincom4 using "`outstub'/fd_dynamic_li
> ncom_table.tex", ///
>                 compress se replace                                          
>                                                                            //
> /
>         stats(zs_trend zs_trend_sq zs_trend_cu N, fmt(%s3 %s3 %s3 %9.0g)     
>                            ///
>                 labels("Zipcode-specifc linear trend"                        
>                                                            ///
>             "Zipcode-specific linear and square trend"                       
>                                                    ///
>                 "Zipcode-specific linear, square and cubic trend" "Observatio
> ns"))                              ///
>                 star(* 0.10 ** 0.05 *** 0.01)                                
>                                                                    ///
>                 nonote coeflabel((1) "Sum of MW effects")
  9. 
.         * Heterogeneity
.         run_static_heterogeneity, depvar(ln_med_rent_psqft) absorb(year_month
> )                          ///
>                 het_var(med_hhinc20105_st_qtl) cluster(statefips)
 10.         graph export "`outstub'/fd_static_heterogeneity.png", replace   
 11. end

. 
. program run_static_model
  1.     syntax, depvar(str) absorb(str) cluster(str)
  2. 
.         eststo clear
  3.         eststo reg1: reghdfe D.`depvar' D.ln_mw,                          
>                               ///
>                 absorb(`absorb')                                             
>                                                    ///
>                 vce(cluster `cluster') nocons
  4.         comment_table, trend_lin("No") trend_sq("No") trend_cu("No")
  5.         
.         scalar static_effect = _b[D.ln_mw]
  6.         scalar static_effect_se = _se[D.ln_mw]
  7. 
.         eststo: reghdfe D.`depvar' D.ln_mw,                                  
>                                    ///
>                 absorb(`absorb' c.trend#i.zipcode)                           
>                                    ///
>                 vce(cluster `cluster') nocons
  8.         comment_table, trend_lin("Yes") trend_sq("No") trend_cu("No")
  9. 
.         eststo: reghdfe D.`depvar' D.ln_mw,                                  
>                                    ///
>                 absorb(`absorb' c.trend#i.zipcode  c.trend_sq#i.zipcode)     
>            ///
>                 vce(cluster `cluster') nocons
 10.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("No")
 11. 
.         eststo: reghdfe D.`depvar' D.ln_mw,                                  
>                                    ///
>                 absorb(`absorb' c.trend#i.zipcode  c.trend_sq#i.zipcode c.tre
> nd_cu#i.zipcode) ///
>                 vce(cluster `cluster') nocons
 12.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("Yes")
 13. end

. 
. program run_dynamic_model
  1.         syntax, depvar(str) absorb(str) cluster(str) [w(int 5)]
  2.         
.         local lincomest_coeffs "D1.ln_mw + LD.ln_mw"
  3.         forvalues i = 2(1)`w'{
  4.                 local lincomest_coeffs "`lincomest_coeffs' + L`i'D.ln_mw"
  5.         }
  6. 
.         eststo clear
  7.         eststo reg1: reghdfe D.`depvar' L(-`w'/`w').D.ln_mw,              
>       ///
>                 absorb(`absorb')                                             
>                                            ///
>                 vce(cluster `cluster') nocons
  8.         comment_table, trend_lin("No") trend_sq("No") trend_cu("No")
  9.         
.         coefplot, vertical base gen
 10.         
.         preserve
 11.                 keep __at __b __se
 12.                 rename (__at __b __se) (at b se)
 13.                 tset at
 14.                 
.                 gen static_path = 0 if at <= 5 
 15.                 replace static_path = scalar(static_effect) if at > 5
 16.                 gen static_path_lb = 0 if at <= 5
 17.                 replace static_path_lb = scalar(static_effect) - 1.96*scal
> ar(static_effect_se) if at > 5
 18.                 gen static_path_ub = 0 if at <= 5
 19.                 replace static_path_ub = scalar(static_effect) + 1.96*scal
> ar(static_effect_se) if at > 5
 20.                 
.                 gen cumsum_b = b[1]
 21.                 replace cumsum_b = cumsum_b[_n-1] + b[_n] if _n>1
 22.                 keep if !missing(at)
 23. 
.                 gen b_lb = b - 1.96*se
 24.                 gen b_ub = b + 1.96*se
 25. 
.                 twoway (scatter b at, mcol(navy)) ///
>                         (rcap b_lb b_ub at, col(navy)) ///
>                         (line cumsum at, lcol(green)) ///
>                         (line static_path at, lcol(maroon)), ///
>                         yline(0, lcol(grey) lpat(dot)) ///
>                         graphregion(color(white)) bgcolor(white) ///
>                         xlabel(1 "F5D.ln_mw" 2 "F4D.ln_mw" 3 "F3D.ln_mw" 4 "F
> 2D.ln_mw" ///
>                         5 "FD.ln_mw" 6 "D.ln_mw" 7 "LD.ln_mw" 8 "L2D.ln_mw" 9
>  "L3D.ln_mw" ///
>                         10 "L4D.ln_mw" 11 "L5D.ln_mw", labsize(vsmall)) xtitl
> e("Leads and lags of ln MW") ///
>                         ytitle("Effect on ln rent per sqft") ///
>                         legend(order(1 "Dynamic model coefficients" 3 "Cumula
> tive sum: dynamic model" ///
>                         4 "Implied cumulative sum: static model") size(small)
> )
 26.                 graph export "../output/fd_models.png", replace
 27.         restore
 28.         
.         eststo lincom1: lincomest `lincomest_coeffs'
 29.         comment_table, trend_lin("No") trend_sq("No") trend_cu("No")
 30.         
.         eststo reg2: reghdfe D.`depvar' L(-`w'/`w').D.ln_mw  `if',           
>    ///
>                 absorb(`absorb' c.trend#i.zipcode)                           
>                            ///
>                 vce(cluster `cluster') nocons
 31.         comment_table, trend_lin("Yes") trend_sq("No") trend_cu("No")
 32. 
.         eststo lincom2: lincomest `lincomest_coeffs'
 33.         comment_table, trend_lin("Yes") trend_sq("No") trend_cu("No")
 34.         
.         eststo reg3: reghdfe D.`depvar' L(-`w'/`w').D.ln_mw `if',            
>    ///
>                 absorb(`absorb' c.trend#i.zipcode c.trend_sq#i.zipcode)      
>    ///
>                 vce(cluster `cluster') nocons
 35.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("No")
 36. 
.         eststo lincom3: lincomest `lincomest_coeffs'
 37.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("No")
 38. 
.         eststo reg4: reghdfe D.`depvar' L(-`w'/`w').D.ln_mw `if',            
>    ///
>                 absorb(`absorb' c.trend#i.zipcode c.trend_sq#i.zipcode c.tren
> d_cu#i.zipcode) ///
>                 vce(cluster `cluster') nocons
 39.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("Yes")
 40.         
.         eststo lincom4: lincomest `lincomest_coeffs'
 41.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("Yes")
 42. end

. 
. program run_static_heterogeneity
  1.         syntax, depvar(str) absorb(str) cluster(str) het_var(str) [w(int 5
> )]
  2. 
.         eststo clear
  3. 
.         mat A = J(5, 3, .)
  4.         mat colnames A = coeff ci_low ci_high
  5. 
.         forvalues i = 1(1)5 {
  6.                 quietly reghdfe D.`depvar' D.ln_mw if `het_var' == `i',   
>                                               ///
>                         absorb(`absorb' c.trend#i.zipcode c.trend_sq#i.zipcod
> e c.trend_cu#i.zipcode) ///
>                         vce(cluster `cluster') nocons
  7. 
.                 mat B = e(b)
  8.                 mat V = e(V)
  9. 
.                 mat A[`i', 1] = B[1, 1]
 10.                 mat A[`i', 2] = B[1, 1] - 1.96*(V[1, 1]^.5)
 11.                 mat A[`i', 3] = B[1, 1] + 1.96*(V[1, 1]^.5)
 12.         }
 13. 
.         mat tA = A'
 14. 
.         coefplot matrix(tA[1]), ci((tA[2] tA[3]))                            
>                            ///
>                 graphregion(color(white)) bgcolor(white)                     
>                            ///
>                 ylabel(1 "1" 2 "2" 3 "3" 4 "4" 5 "5")                        
>                            ///
>                 ytitle("Quintiles of state mean income distribution")        
>            ///
>                 xtitle("Estimated effect of ln MW on ln rents")              
>                    ///
>                 xline(0, lcol(grey) lpat(dot))
 15. end

. 
. program comment_table
  1.         syntax, trend_lin(str) trend_sq(str) trend_cu(str)
  2. 
.         estadd local zs_trend           "`trend_lin'"   
  3.         estadd local zs_trend_sq        "`trend_sq'"
  4.         estadd local zs_trend_cu        "`trend_cu'"
  5. end

. 
. main
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 1 HDFE group                            F(   1,     39) =       3.85
Statistics robust to heteroskedasticity           Prob > F        =     0.0569
                                                  R-squared       =     0.0220
                                                  Adj R-squared   =     0.0209
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0277

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0270025   .0137584     1.96   0.057    -.0008266    .0548315
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+

added macro:
           e(zs_trend) : "No"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 2 HDFE groups                           F(   1,     39) =       4.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0352
                                                  R-squared       =     0.0238
                                                  Adj R-squared   =     0.0128
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0278

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0273933   .0125578     2.18   0.035     .0019928    .0527939
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
      year_month |       118           0         118     |
 zipcode#c.trend |      1098           0        1098    ?|
---------------------------------------------------------+
? = number of redundant parameters may be higher
(est2 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 16 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 3 HDFE groups                           F(   1,     39) =       4.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0459
                                                  R-squared       =     0.0257
                                                  Adj R-squared   =     0.0045
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0279

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0265755   .0128899     2.06   0.046     .0005031    .0526478
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       118           0         118     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher
(est3 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 74 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 4 HDFE groups                           F(   1,     39) =       3.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0562
                                                  R-squared       =     0.0280
                                                  Adj R-squared   =    -0.0034
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0280

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0254736    .012946     1.97   0.056    -.0007121    .0516593
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       118           0         118     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
 zipcode#c.trend_cu |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher
(est4 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "Yes"
(note: file ../output/fd_table.tex not found)
(output written to ../output/fd_table.tex)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    103,202
Absorbing 1 HDFE group                            F(  11,     39) =       5.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0223
                                                  Adj R-squared   =     0.0212
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         40       Root MSE        =     0.0277

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F5D. |  -.0112712   .0095938    -1.17   0.247    -.0306765    .0081341
        F4D. |  -.0044511   .0121409    -0.37   0.716    -.0290085    .0201062
        F3D. |   .0029455    .011315     0.26   0.796    -.0199412    .0258323
        F2D. |   .0040384   .0131304     0.31   0.760    -.0225203    .0305971
         FD. |  -.0035317   .0109534    -0.32   0.749    -.0256871    .0186237
         D1. |   .0280288   .0136156     2.06   0.046     .0004887    .0555689
         LD. |   .0126523   .0056748     2.23   0.032     .0011739    .0241307
        L2D. |  -.0078337   .0136237    -0.58   0.569    -.0353902    .0197229
        L3D. |   .0067939   .0085019     0.80   0.429    -.0104028    .0239906
        L4D. |   .0106391   .0073019     1.46   0.153    -.0041304    .0254085
        L5D. |   .0091586   .0066995     1.37   0.179    -.0043923    .0227096
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       109           0         109     |
-----------------------------------------------------+

added macro:
           e(zs_trend) : "No"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"

Generated variables:
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
__by            byte    %9.0g      __by       subgraph ID
__plot          byte    %9.0g      __plot     plot ID
__at            byte    %9.0g                 plot position (category axis)
__mlbl          str1    %9s                   marker label
__mlpos         byte    %9.0g                 marker label position
__b             float   %9.0g                 coefficient
__V             float   %9.0g                 variance
__se            float   %9.0g                 standard error
__t             float   %9.0g                 t or z statistic
__df            byte    %9.0g                 degrees of freedom
__pval          float   %9.0g                 p-value
__ll1           float   %9.0g                 CI1: lower limit
__ul1           float   %9.0g                 CI1: upper limit
        time variable:  at, 1 to 11
                delta:  1 unit
(150,355 missing values generated)
(150,355 real changes made)
(150,355 missing values generated)
(150,355 real changes made)
(150,355 missing values generated)
(150,355 real changes made)
(150,359 real changes made, 150,349 to missing)
(150,349 observations deleted)
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/fd_models.png not found)
(file ../output/fd_models.png written in PNG format)
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0594391   .0357927     1.66   0.105    -.0129585    .1318367
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "No"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    103,202
Absorbing 2 HDFE groups                           F(  11,     39) =       6.46
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0244
                                                  Adj R-squared   =     0.0127
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         40       Root MSE        =     0.0279

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F5D. |    -.01078    .010318    -1.04   0.303    -.0316501    .0100901
        F4D. |  -.0043173   .0106005    -0.41   0.686     -.025759    .0171243
        F3D. |   .0030663   .0109354     0.28   0.781    -.0190527    .0251853
        F2D. |   .0041679   .0131481     0.32   0.753    -.0224268    .0307625
         FD. |  -.0033026   .0132281    -0.25   0.804    -.0300589    .0234537
         D1. |   .0282768   .0118675     2.38   0.022     .0042725    .0522812
         LD. |   .0124416   .0065833     1.89   0.066    -.0008743    .0257575
        L2D. |  -.0080862   .0124326    -0.65   0.519    -.0332335    .0170612
        L3D. |   .0065208   .0078559     0.83   0.412    -.0093693     .022411
        L4D. |   .0103543   .0077275     1.34   0.188     -.005276    .0259846
        L5D. |   .0089776   .0071966     1.25   0.220    -.0055789    .0235342
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
      year_month |       109           0         109     |
 zipcode#c.trend |      1098           0        1098    ?|
---------------------------------------------------------+
? = number of redundant parameters may be higher

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .058485   .0294464     1.99   0.054    -.0010759    .1180459
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 16 iterations)

HDFE Linear regression                            Number of obs   =    103,202
Absorbing 3 HDFE groups                           F(  11,     39) =       5.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0265
                                                  Adj R-squared   =     0.0042
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         40       Root MSE        =     0.0280

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F5D. |  -.0118355   .0101922    -1.16   0.253    -.0324512    .0087802
        F4D. |  -.0055881    .010647    -0.52   0.603    -.0271237    .0159475
        F3D. |   .0018585   .0105693     0.18   0.861    -.0195199    .0232368
        F2D. |   .0029627   .0134629     0.22   0.827    -.0242686    .0301939
         FD. |  -.0045196   .0129947    -0.35   0.730    -.0308039    .0217648
         D1. |   .0271658   .0122561     2.22   0.033     .0023756    .0519561
         LD. |   .0107135   .0065368     1.64   0.109    -.0025084    .0239354
        L2D. |  -.0098097   .0125828    -0.78   0.440    -.0352609    .0156415
        L3D. |   .0048504    .008267     0.59   0.561    -.0118712     .021572
        L4D. |   .0087308   .0076294     1.14   0.259    -.0067011    .0241627
        L5D. |   .0076847   .0070746     1.09   0.284    -.0066249    .0219943
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       109           0         109     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "No"
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0493356   .0302829     1.63   0.111    -.0119174    .1105885
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 81 iterations)

HDFE Linear regression                            Number of obs   =    103,202
Absorbing 4 HDFE groups                           F(  11,     39) =       6.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0288
                                                  Adj R-squared   =    -0.0044
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         40       Root MSE        =     0.0281

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F5D. |  -.0116912   .0104132    -1.12   0.268    -.0327539    .0093715
        F4D. |  -.0049687   .0099818    -0.50   0.621    -.0251589    .0152215
        F3D. |   .0024728   .0107141     0.23   0.819    -.0191985     .024144
        F2D. |   .0036528   .0136328     0.27   0.790    -.0239221    .0312278
         FD. |  -.0042289   .0134983    -0.31   0.756    -.0315319     .023074
         D1. |   .0274809   .0123818     2.22   0.032     .0024363    .0525255
         LD. |   .0111228   .0073925     1.50   0.140    -.0038299    .0260756
        L2D. |  -.0093425   .0130058    -0.72   0.477    -.0356493    .0169643
        L3D. |   .0053672   .0089038     0.60   0.550    -.0126423    .0233768
        L4D. |   .0093055     .00854     1.09   0.283    -.0079682    .0265791
        L5D. |   .0080938   .0073021     1.11   0.274    -.0066761    .0228638
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       109           0         109     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
 zipcode#c.trend_cu |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "Yes"
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0520278   .0349394     1.49   0.145    -.0186439    .1226994
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "Yes"
(note: file ../output/fd_dynamic_table.tex not found)
(output written to ../output/fd_dynamic_table.tex)
(note: file ../output/fd_dynamic_lincom_table.tex not found)
(output written to ../output/fd_dynamic_lincom_table.tex)
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/fd_static_heterogeneity.png not found)
(file ../output/fd_static_heterogeneity.png written in PNG format)

. 
end of do-file

 make.py ended: 2020-06-17 21:24:54
