
 make.py started: 2020-06-15 08:11:53 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\first_differences\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000 


. 
. program main
  1.         use "../../../drive/derived_large/output/baseline_rent_panel.dta",
>  clear
  2.         keep zipcode place_code msa countyfips statefips year_month calend
> ar_month ///
>                 actual_mw medrentpricepsqft_sfcc medrentprice_sfcc trend tren
> d_sq trend_cu
  3.         
.         foreach var in actual_mw medrentpricepsqft_sfcc medrentprice_sfcc{
  4.                 gen ln_`var' = ln(`var')
  5.         }
  6. 
.         xtset zipcode year_month
  7.         
.     rename (ln_actual_mw ln_medrentpricepsqft_sfcc) (ln_mw ln_med_rent_psqft)
  8.         
.         
.         save_data "../temp/fd_rent_panel.dta", key(zipcode year_month) replac
> e
  9. end

. 
. main
(40,499 missing values generated)
(27,658 missing values generated)
       panel variable:  zipcode (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(data already sorted by zipcode year_month)
  (0 bytes saved)
============================================================================
File: ../temp/fd_rent_panel.dta
Key: zipcode year_month
============================================================================
  150360:16(19328):1689201119:2658988827

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |    150,360    51319.01    29004.04       2113      99577
  year_month |    150,360       659.5    34.63993        600        719
  place_code |    124,200       40791    22611.89        410      87240
  countyfips |    150,000    24129.28    16433.47       1003      56021
   statefips |    150,360    24.02953    16.37417          1         56
-------------+---------------------------------------------------------
medre~e_sfcc |    122,702    1641.121    693.2088        595       6595
   actual_mw |    150,360    8.063602    1.192165       7.25         16
calendar_m~h |    150,360         6.5    3.452064          1         12
         msa |    150,360    436.0295    241.1196         12        860
       trend |    150,360       225.5    34.63993        166        285
-------------+---------------------------------------------------------
    trend_sq |    150,360    52050.17    15659.42      27556      81225
    trend_cu |    150,360    1.23e+07     5408204    4574296   2.31e+07
medre~t_sfcc |    109,861    1.182011    .7855536   .4180214   6.731387
       ln_mw |    150,360    2.078049    .1313575   1.981001   2.772589
ln_med_ren~t |    109,861    .0411796    .4492291  -.8722228   1.906781
-------------+---------------------------------------------------------
ln_medrent~c |    122,702     7.32918    .3733732   6.388561   8.794067




(note: file ../temp/fd_rent_panel.dta not found)
file ../temp/fd_rent_panel.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./first_differences.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./first_differences.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         use "../temp/fd_rent_panel.dta", clear
  2.         
.         run_static_model, depvar(ln_med_rent_psqft) ///
>             absorb(year_month) cluster(statefips)
  3.         
.         esttab * using "../output/fd_table.tex", keep(D.ln_mw) compress se re
> place      ///
>         stats(zs_trend zs_trend_sq zs_trend_cu r2 N, fmt(%9.3f %9.0g)        
>                            ///
>                 labels("Zipcode-specifc linear trend"                        
>                                                            ///
>             "Zipcode-specific linear and square trend"                       
>                                                    ///
>                 "Zipcode-specific linear, square and cubic trend"            
>                                                    ///
>             "R-squared" "Observations")) star(* 0.10 ** 0.05 *** 0.01)       
>                                    ///
>                 nonote
  4.         
.         run_dynamic_model, depvar(ln_med_rent_psqft) ///
>             absorb(year_month) cluster(statefips)
  5.         
.         esttab reg1 reg2 reg3 reg4 using "../output/fd_dynamic_table.tex",   
>                                    ///
>                 keep(*.ln_mw) compress se replace                            
>                                                    ///
>         stats(zs_trend zs_trend_sq zs_trend_cu r2 N, fmt(%9.3f %9.0g)        
>                            ///
>                 labels("Zipcode-specifc linear trend"                        
>                                                            ///
>             "Zipcode-specific linear and square trend"                       
>                                                    ///
>                 "Zipcode-specific linear, square and cubic trend"            
>                                                    ///
>             "R-squared" "Observations")) star(* 0.10 ** 0.05 *** 0.01)       
>                                    ///
>                 nonote
  6. 
.         esttab lincom1 lincom2 lincom3 lincom4 using "../output/fd_dynamic_li
> ncom_table.tex", ///
>                 compress se replace                                          
>                                                                            //
> /
>         stats(zs_trend zs_trend_sq zs_trend_cu N, fmt(%9.0g)                 
>                                    ///
>                 labels("Zipcode-specifc linear trend"                        
>                                                            ///
>             "Zipcode-specific linear and square trend"                       
>                                                    ///
>                 "Zipcode-specific linear, square and cubic trend" "Observatio
> ns"))                              ///
>                 star(* 0.10 ** 0.05 *** 0.01)                                
>                                                                    ///
>                 nonote coeflabel((1) "Sum of MW effects")
  7. end

. 
. program run_static_model
  1.     syntax, depvar(str) absorb(str) cluster(str)
  2.         
.         eststo clear
  3.         eststo: reghdfe D.`depvar' D.ln_mw,                               
>                       ///
>                 absorb(`absorb') ///
>                 vce(cluster `cluster') nocons
  4.         comment_table, trend_lin("No") trend_sq("No") trend_cu("No")
  5. 
.         eststo: reghdfe D.`depvar' D.ln_mw,                                  
>                    ///
>                 absorb(`absorb' c.trend#i.zipcode) ///
>                 vce(cluster `cluster') nocons
  6.         comment_table, trend_lin("Yes") trend_sq("No") trend_cu("No")
  7. 
.         eststo: reghdfe D.`depvar' D.ln_mw,                                  
>                    ///
>                 absorb(`absorb' c.trend#i.zipcode  c.trend_sq#i.zipcode) ///
>                 vce(cluster `cluster') nocons
  8.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("No")
  9. 
.         eststo: reghdfe D.`depvar' D.ln_mw,                                  
>                    ///
>                 absorb(`absorb' c.trend#i.zipcode  c.trend_sq#i.zipcode c.tre
> nd_cu#i.zipcode) ///
>                 vce(cluster `cluster') nocons
 10.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("Yes")
 11. end

. 
. program run_dynamic_model
  1.     syntax, depvar(str) absorb(str) cluster(str)
  2.         
.         eststo clear
  3.         eststo reg1: reghdfe D.`depvar' L(-5/5).D.ln_mw,                  
>       ///
>             absorb(`absorb') ///
>                 vce(cluster `cluster') nocons
  4.         comment_table, trend_lin("No") trend_sq("No") trend_cu("No")
  5.         
.         coefplot, vertical base gen
  6.         
.         preserve
  7.         keep __at __b __se
  8.         rename (__at __b __se) (at b se)
  9.         tset at
 10.         gen cumsum_b = b[1]
 11.         replace cumsum_b = cumsum_b[_n-1] + b[_n] if _n>1
 12.         keep if !missing(at)
 13. 
.         gen b_lb = b - 2*se
 14.         gen b_ub = b + 2*se
 15. 
.         twoway (scatter b at, mcol(navy)) ///
>                 (rcap b_lb b_ub at, col(navy)) ///
>                 (line cumsum at, lcol(olive)), ///
>                 yline(0, lcol(grey) lpat(dot)) ///
>                 graphregion(color(white)) bgcolor(white) ///
>                 xlabel(1 "F5D.ln_mw" 2 "F4D.ln_mw" 3 "F3D.ln_mw" 4 "F2D.ln_mw
> " ///
>                 5 "FD.ln_mw" 6 "D.ln_mw" 7 "LD.ln_mw" 8 "L2D.ln_mw" 9 "L3D.ln
> _mw" ///
>                 10 "L4D.ln_mw" 11 "L5D.ln_mw", labsize(vsmall)) xtitle("Leads
>  and lags of ln MW") ///
>                 ytitle("Effect on ln rent per sqft (dollars)") ///
>                 legend(order(1 "Coefficient" 3 "Cumulative sum of coefficient
> s"))
 16.         graph export "../output/fd_dynamic.png", replace
 17.         restore
 18.         
.         eststo lincom1: lincomest D1.ln_mw + LD.ln_mw + L2D.ln_mw +     ///
>             L3D.ln_mw + L4D.ln_mw + L5D.ln_mw
 19.         comment_table, trend_lin("No") trend_sq("No") trend_cu("No")
 20.         
.         eststo reg2: reghdfe D.`depvar' L(-5/5).D.ln_mw,                     
>    ///
>             absorb(`absorb' c.trend#i.zipcode) ///
>                 vce(cluster `cluster') nocons
 21.         comment_table, trend_lin("Yes") trend_sq("No") trend_cu("No")
 22. 
.         eststo lincom2: lincomest D1.ln_mw + LD.ln_mw + L2D.ln_mw +     ///
>             L3D.ln_mw + L4D.ln_mw + L5D.ln_mw
 23.         comment_table, trend_lin("Yes") trend_sq("No") trend_cu("No")
 24.         
.         eststo reg3: reghdfe D.`depvar' L(-5/5).D.ln_mw,                     
>    ///
>             absorb(`absorb' c.trend#i.zipcode c.trend_sq#i.zipcode) ///
>                 vce(cluster `cluster') nocons
 25.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("No")
 26. 
.         eststo lincom3: lincomest D1.ln_mw + LD.ln_mw + L2D.ln_mw +     ///
>             L3D.ln_mw + L4D.ln_mw + L5D.ln_mw
 27.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("No")
 28. 
.         eststo reg4: reghdfe D.`depvar' L(-5/5).D.ln_mw,                     
>    ///
>             absorb(`absorb' c.trend#i.zipcode c.trend_sq#i.zipcode c.trend_cu
> #i.zipcode) ///
>                 vce(cluster `cluster') nocons
 29.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("Yes")
 30.         
.         eststo lincom4: lincomest D1.ln_mw + LD.ln_mw + L2D.ln_mw +     ///
>             L3D.ln_mw + L4D.ln_mw + L5D.ln_mw
 31.         comment_table, trend_lin("Yes") trend_sq("Yes") trend_cu("Yes")
 32. end 

. program comment_table
  1.         syntax, trend_lin(str) trend_sq(str) trend_cu(str)
  2. 
.         estadd local zs_trend           "`trend_lin'"   
  3.         estadd local zs_trend_sq        "`trend_sq'"
  4.         estadd local zs_trend_cu        "`trend_cu'"
  5. end

. 
. main
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 1 HDFE group                            F(   1,     39) =       3.85
Statistics robust to heteroskedasticity           Prob > F        =     0.0569
                                                  R-squared       =     0.0220
                                                  Adj R-squared   =     0.0209
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0277

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0270025   .0137584     1.96   0.057    -.0008266    .0548315
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(est1 stored)

added macro:
           e(zs_trend) : "No"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 2 HDFE groups                           F(   1,     39) =       4.32
Statistics robust to heteroskedasticity           Prob > F        =     0.0442
                                                  R-squared       =     0.0238
                                                  Adj R-squared   =     0.0127
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0278

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0269371   .0129531     2.08   0.044     .0007369    .0531373
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
      year_month |       118           0         118     |
 zipcode#c.trend |      1098           0        1098    ?|
---------------------------------------------------------+
? = number of redundant parameters may be higher
(est2 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 25 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 3 HDFE groups                           F(   1,     39) =       4.19
Statistics robust to heteroskedasticity           Prob > F        =     0.0474
                                                  R-squared       =     0.0263
                                                  Adj R-squared   =     0.0052
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0279

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0264333   .0129119     2.05   0.047     .0003166      .05255
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       118           0         118     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher
(est3 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 159 iterations)

HDFE Linear regression                            Number of obs   =    108,763
Absorbing 4 HDFE groups                           F(   1,     39) =       3.83
Statistics robust to heteroskedasticity           Prob > F        =     0.0576
                                                  R-squared       =     0.0290
                                                  Adj R-squared   =    -0.0025
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0280

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0259148   .0132445     1.96   0.058    -.0008747    .0527043
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       118           0         118     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
 zipcode#c.trend_cu |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher
(est4 stored)

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "Yes"
(note: file ../output/fd_table.tex not found)
(output written to ../output/fd_table.tex)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    103,202
Absorbing 1 HDFE group                            F(  11,     39) =       5.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0223
                                                  Adj R-squared   =     0.0212
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         40       Root MSE        =     0.0277

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F5D. |  -.0112712   .0095938    -1.17   0.247    -.0306765    .0081341
        F4D. |  -.0044511   .0121409    -0.37   0.716    -.0290085    .0201062
        F3D. |   .0029455    .011315     0.26   0.796    -.0199412    .0258323
        F2D. |   .0040384   .0131304     0.31   0.760    -.0225203    .0305971
         FD. |  -.0035317   .0109534    -0.32   0.749    -.0256871    .0186237
         D1. |   .0280288   .0136156     2.06   0.046     .0004887    .0555689
         LD. |   .0126523   .0056748     2.23   0.032     .0011739    .0241307
        L2D. |  -.0078337   .0136237    -0.58   0.569    -.0353902    .0197229
        L3D. |   .0067939   .0085019     0.80   0.429    -.0104028    .0239906
        L4D. |   .0106391   .0073019     1.46   0.153    -.0041304    .0254085
        L5D. |   .0091586   .0066995     1.37   0.179    -.0043923    .0227096
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       109           0         109     |
-----------------------------------------------------+

added macro:
           e(zs_trend) : "No"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"

Generated variables:
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
__by            byte    %9.0g      __by       subgraph ID
__plot          byte    %9.0g      __plot     plot ID
__at            byte    %9.0g                 plot position (category axis)
__mlbl          str1    %9s                   marker label
__mlpos         byte    %9.0g                 marker label position
__b             float   %9.0g                 coefficient
__V             float   %9.0g                 variance
__se            float   %9.0g                 standard error
__t             float   %9.0g                 t or z statistic
__df            byte    %9.0g                 degrees of freedom
__pval          float   %9.0g                 p-value
__ll1           float   %9.0g                 CI1: lower limit
__ul1           float   %9.0g                 CI1: upper limit
        time variable:  at, 1 to 11
                delta:  1 unit
(150,359 real changes made, 150,349 to missing)
(150,349 observations deleted)
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/fd_dynamic.png not found)
(file ../output/fd_dynamic.png written in PNG format)
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0594391   .0357927     1.66   0.105    -.0129585    .1318367
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "No"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    103,202
Absorbing 2 HDFE groups                           F(  11,     39) =       5.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0243
                                                  Adj R-squared   =     0.0126
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         40       Root MSE        =     0.0279

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F5D. |   -.011455    .009806    -1.17   0.250    -.0312895    .0083796
        F4D. |  -.0049048   .0112887    -0.43   0.666    -.0277384    .0179288
        F3D. |   .0024562   .0104189     0.24   0.815    -.0186181    .0235305
        F2D. |   .0035583   .0136464     0.26   0.796    -.0240442    .0311609
         FD. |  -.0038899   .0120022    -0.32   0.748    -.0281668    .0203869
         D1. |   .0277154   .0126859     2.18   0.035     .0020558     .053375
         LD. |   .0120271   .0062703     1.92   0.062    -.0006557    .0247099
        L2D. |  -.0085104   .0134187    -0.63   0.530    -.0356522    .0186315
        L3D. |   .0060847   .0076922     0.79   0.434    -.0094741    .0216436
        L4D. |   .0099144   .0074055     1.34   0.188    -.0050646    .0248934
        L5D. |   .0084487   .0071052     1.19   0.242    -.0059229    .0228204
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
      year_month |       109           0         109     |
 zipcode#c.trend |      1098           0        1098    ?|
---------------------------------------------------------+
? = number of redundant parameters may be higher

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .05568   .0327748     1.70   0.097    -.0106133    .1219733
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "No"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 26 iterations)

HDFE Linear regression                            Number of obs   =    103,202
Absorbing 3 HDFE groups                           F(  11,     39) =       5.42
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0271
                                                  Adj R-squared   =     0.0048
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         40       Root MSE        =     0.0280

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F5D. |  -.0123421   .0101883    -1.21   0.233    -.0329499    .0082657
        F4D. |  -.0061491   .0106059    -0.58   0.565    -.0276015    .0153034
        F3D. |   .0013336   .0106242     0.13   0.901    -.0201559    .0228231
        F2D. |   .0024593   .0134717     0.18   0.856    -.0247897    .0297084
         FD. |  -.0050719   .0128839    -0.39   0.696    -.0311321    .0209884
         D1. |   .0266508   .0123843     2.15   0.038     .0016013    .0517004
         LD. |   .0103594   .0064069     1.62   0.114    -.0025999    .0233186
        L2D. |  -.0101531   .0126306    -0.80   0.426    -.0357009    .0153947
        L3D. |   .0045499   .0084542     0.54   0.594    -.0125504    .0216501
        L4D. |   .0084678    .007561     1.12   0.270    -.0068258    .0237613
        L5D. |   .0073265   .0070559     1.04   0.305    -.0069454    .0215984
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       109           0         109     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "No"
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0472013   .0308375     1.53   0.134    -.0151734     .109576
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "No"
(MWFE estimator converged in 201 iterations)

HDFE Linear regression                            Number of obs   =    103,202
Absorbing 4 HDFE groups                           F(  11,     39) =       5.89
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0298
                                                  Adj R-squared   =    -0.0033
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         40       Root MSE        =     0.0281

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F5D. |  -.0114877   .0101864    -1.13   0.266    -.0320915    .0091162
        F4D. |  -.0048631   .0100356    -0.48   0.631     -.025162    .0154358
        F3D. |   .0025787   .0104095     0.25   0.806    -.0184764    .0236338
        F2D. |   .0037499   .0139036     0.27   0.789    -.0243728    .0318725
         FD. |  -.0042076   .0131121    -0.32   0.750    -.0307294    .0223142
         D1. |   .0274856   .0127231     2.16   0.037     .0017507    .0532206
         LD. |   .0111159    .007425     1.50   0.142    -.0039026    .0261344
        L2D. |  -.0093922   .0133652    -0.70   0.486    -.0364258    .0176413
        L3D. |   .0053161   .0089405     0.59   0.556    -.0127678       .0234
        L4D. |   .0092487   .0085267     1.08   0.285    -.0079982    .0264957
        L5D. |   .0081958   .0072308     1.13   0.264    -.0064297    .0228214
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------+
        Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------+---------------------------------------|
         year_month |       109           0         109     |
    zipcode#c.trend |      1098           0        1098    ?|
 zipcode#c.trend_sq |      1098           0        1098    ?|
 zipcode#c.trend_cu |      1098           0        1098    ?|
------------------------------------------------------------+
? = number of redundant parameters may be higher

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "Yes"
Confidence interval for formula:
D1.ln_mw+LD.ln_mw+L2D.ln_mw+L3D.ln_mw+L4D.ln_mw+L5D.ln_mw

------------------------------------------------------------------------------
D.           |
ln_med_ren~t |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .05197   .0363894     1.43   0.161    -.0216345    .1255745
------------------------------------------------------------------------------

added macro:
           e(zs_trend) : "Yes"

added macro:
        e(zs_trend_sq) : "Yes"

added macro:
        e(zs_trend_cu) : "Yes"
(note: file ../output/fd_dynamic_table.tex not found)
(output written to ../output/fd_dynamic_table.tex)
(note: file ../output/fd_dynamic_lincom_table.tex not found)
(output written to ../output/fd_dynamic_lincom_table.tex)

. 
end of do-file

 make.py ended: 2020-06-15 08:22:27
