
 make.py started: 2020-11-22 10:50:38 /Users/gabriborg/Dropbox (Brown)/research/min_wage_rent/analysis/first_differences_nlist/code 




Execute:  stataSE -e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 120-user network perpetual
Serial number: 401606201670
  Licensed to: Brown University
               Brown University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/gabriborg/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/gabriborg/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/output"
  2.         local outstub "../temp"
  3.         local logfile "../output/data_file_manifest.log"
  4. 
.         use "`instub'/baseline_rent_panel.dta", clear 
  5.         keep zipcode place_code msa countyfips statefips                                 
>                                         ///
>                 year_month calendar_month trend trend_sq trend_cu                           
>                                      ///
>                 dactual_mw actual_mw medrentpricepsqft_*                                    
>                                      ///
>                 medlistingpricepsqft_sfcc monthlylistings_nsa_sfcc newmonthlylistings_nsa_sf
> cc       ///
>                 med_hhinc20105 renthouse_share2010 white_share2010 black_share2010 housing_u
> nits2010 ///
>                 college_share20105 work_county_share20105 unemp_share20105 teen_share2010   
>          ///
>                 estcount_* avgwwage_* emp_* u1*                                             
>                                             
  6. 
.         
. 
.         local het_vars "med_hhinc20105 renthouse_share2010 college_share20105 black_share201
> 0"
  7.         local het_vars "`het_vars' unemp_share20105 teen_share2010" 
  8. 
.         create_vars, log_vars(actual_mw medrentpricepsqft_sfcc ///
>                                                   medlistingpricepsqft_sfcc monthlylistings_
> nsa_sfcc newmonthlylistings_nsa_sfcc ///
>                                                   emp_* estcount_* avgwwage_* u1*)      ///
>                                  heterogeneity_vars(`het_vars')
  9.         
.         simplify_varnames
 10. 
.         xtset zipcode year_month
 11.         gen d_ln_mw = D.ln_mw
 12. 
.         save_data "`outstub'/fd_rent_panel.dta", key(zipcode year_month) replace log(`logfil
> e')
 13. end

. 
. program create_vars
  1.         syntax, log_vars(str) heterogeneity_vars(str)
  2. 
.         local log_vars_expanded "" 
  3.         foreach v in `log_vars' {
  4.                 unab this_var: `v'
  5.                 local log_vars_expanded `"`log_vars_expanded' `this_var'"'
  6.         }
  7.         unab bpsvars: u1*
  8.         foreach var in `bpsvars' {
  9.                 replace `var' = 1 + `var'
 10.         }
 11.         foreach var in `log_vars_expanded' {
 12.                 gen ln_`var' = ln(`var')
 13.         }
 14. 
.         gen nonwhite_share2010 = 1 - white_share2010
 15.         
.         gen trend_times2 = 2*trend
 16. 
.         foreach var in `heterogeneity_vars' {
 17. 
.                 gquantiles `var'_nat_qtl = `var', xtile nq(4)
 18. 
.                 gquantiles `var'_st_qtl  = `var', xtile nq(4) by(statefips)
 19.         }
 20. 
.         g listwgt =  housing_units2010 / monthlylistings_nsa_sfcc
 21. end

. 
. program simplify_varnames
  1.         
.         cap rename ln_actual_mw                   ln_mw 
  2.         cap rename ln_medrentpricepsqft_sfcc      ln_med_rent_psqft_sfcc
  3.         cap rename ln_medrentpricepsqft_2br       ln_med_rent_psqft_2br
  4.         cap rename ln_medrentpricepsqft_mfr5plus  ln_med_rent_psqft_mfr5plus
  5.         cap rename ln_medlistingpricepsqft_sfcc   ln_med_list_psqft_sfcc
  6.         cap rename monthlylistings_nsa_sfcc               n_listings_sfcc
  7.         cap rename ln_monthlylistings_nsa_sfcc    ln_n_listings_sfcc
  8.         cap rename newmonthlylistings_nsa_sfcc    n_newlistings_sfcc
  9.         cap rename ln_newmonthlylistings_nsa_sfcc ln_n_newlistings_sfcc
 10. 
. 
. 
. 
. end

. 
. main
(136,332 real changes made)
(136,332 real changes made)
(136,332 real changes made)
(136,332 real changes made)
(136,332 real changes made)
(136,332 real changes made)
(43,225 missing values generated)
(16,530 missing values generated)
(58,310 missing values generated)
(122,028 missing values generated)
(4,266 missing values generated)
(5,523 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,290 missing values generated)
(5,028 missing values generated)
(4,266 missing values generated)
(7,515 missing values generated)
(5,544 missing values generated)
(7,224 missing values generated)
(4,266 missing values generated)
(7,704 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,791 missing values generated)
(4,266 missing values generated)
(4,473 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(5,523 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,290 missing values generated)
(5,028 missing values generated)
(4,266 missing values generated)
(7,515 missing values generated)
(5,544 missing values generated)
(7,224 missing values generated)
(4,266 missing values generated)
(7,704 missing values generated)
(4,266 missing values generated)
(20,637 missing values generated)
(20,637 missing values generated)
(20,791 missing values generated)
(20,422 missing values generated)
(20,422 missing values generated)
(20,632 missing values generated)
(58,310 missing values generated)
       panel variable:  zipcode (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(1,305 missing values generated)
(data already sorted by zipcode year_month)
  variable trend_times2 was float now int
  (313,200 bytes saved)
============================================================================
File: ../temp/fd_rent_panel.dta
Key: zipcode year_month
============================================================================
  156600:138(100430):4168318272:4216028480

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |    156,600    51920.57    29185.78       2113      99577
  year_month |    156,600       659.5    34.63992        600        719
  place_code |    129,840    40657.65    22564.03        410      87240
  countyfips |    156,240    24077.04    16484.28       1003      56021
   statefips |    156,600    23.97854    16.42626          1         56
-------------+---------------------------------------------------------
medlisting~c |    140,070    191.3318    215.5706   15.75758   2743.823
n_listings~c |     98,290    257.1136    152.4201         18       2139
n_newlisti~c |     34,572    70.31254    36.18672         11        609
   actual_mw |    156,600     8.07779    1.207718       7.25         16
  dactual_mw |    156,600    .0152048    .1121804          0       2.21
-------------+---------------------------------------------------------
calendar_m~h |    156,600         6.5    3.452064          1         12
         msa |    156,600    436.1801    240.1675         12        860
       trend |    156,600       225.5    34.63992        166        285
    trend_sq |    156,600    52050.17    15659.42      27556      81225
    trend_cu |    156,600    1.23e+07     5408203    4574296   2.31e+07
-------------+---------------------------------------------------------
medrentpri~c |    113,375    1.188344    .7824813   .4180214   6.731387
medrentpri~r |     24,789     1.84165    .9184999   .5015197   6.499599
medrentpri~s |     37,588    1.842276    1.001968   .5106889    6.48415
white_s~2010 |    156,600    .5392018    .2225559   .0037838   .9401773
black_s~2010 |    156,600     .165993    .2003044    .003148   .9753076
-------------+---------------------------------------------------------
teen_sh~2010 |    156,600    .1391686    .0481773   .0154552   .6235335
housing~2010 |    156,600     16339.5     6030.11   1464.953   47225.96
renthou~2010 |    156,600    .3834818     .176359   .0644567   .9662035
work_c~20105 |    156,600    .7557563    .2036341   .1421741    .995271
colleg~20105 |    156,600    .4447718    .1662964   .0856991   .9082218
-------------+---------------------------------------------------------
unemp_~20105 |    156,600    .0918395    .0398028   .0211286   .3417086
med_hh~20105 |    156,600    66919.72    24575.33   20527.66   191553.2
estcount_b~v |    152,334    9998.143    9478.137         60      56304
avgwwage_b~v |    152,334    1252.921    434.7633        226       4727
 emp_bizserv |    152,334    134293.3    143883.8        329     642234
-------------+---------------------------------------------------------
estcount_c~t |    152,334    3240.371    2963.656         35      16939
avgwwage_c~t |    152,334    1101.648    300.1755          0       2608
   emp_const |    152,334    33963.15    34828.46          0     173773
estcount_e~e |    152,334    8227.496    21233.92         48     245645
avgwwage_e~e |    152,334    941.4689    149.2949        415       1975
-------------+---------------------------------------------------------
   emp_eduhe |    152,334    115827.1    123161.7        481     835039
estcount_f~v |    152,334    114.6271    78.41068          3        456
avgwwage_f~v |    152,334    1433.109    237.1039        654       2724
  emp_fedgov |    152,334    13996.39    16476.49         42     215436
estcount_g~r |    152,334    5036.921    4952.914         68      30126
-------------+---------------------------------------------------------
avgwwage_g~r |    152,334    1224.162    338.4809          0       4214
  emp_goodpr |    152,334    86332.35    101028.4          0     500610
estcount_i~o |    152,334    920.6698    1382.296          4      13212
avgwwage_i~o |    152,334    1504.754    620.2263          0       7381
    emp_info |    152,334    21043.15    35144.92          0     240358
-------------+---------------------------------------------------------
estcount_l~s |    152,334    4278.093    4708.605         27      39222
avgwwage_l~s |    152,334    446.7107    134.2103        203       1131
    emp_leis |    152,334    93087.95    93948.61        279     551791
estcount_l~v |    152,334    307.0594    500.3306          1       4162
avgwwage_l~v |    152,334    961.0816    234.2459          0       2042
-------------+---------------------------------------------------------
  emp_locgov |    152,334    72439.67    83732.02          0     463785
estcount_m~u |    152,334    1585.444    1953.882         10      13469
avgwwage_m~u |    152,334    1272.906    396.7543          0       4970
    emp_manu |    152,334    47068.67    62218.62          0     376653
estcount_n~s |    151,809    211.8363    322.4826          1       1859
-------------+---------------------------------------------------------
avgwwage_n~s |    151,809    1133.199    862.1232          0       8606
  emp_natres |    151,809    5209.704     14256.1          0      97846
estcount_s~r |    152,334    44916.23    55840.58        321     473025
avgwwage_s~r |    152,334     1000.91    364.5153        375       3353
  emp_servpr |    152,334    595541.6    612777.8       2751    3452495
-------------+---------------------------------------------------------
estcount_s~v |    152,127    140.9399    411.3288          1       5969
avgwwage_s~v |    152,127     1014.47    299.4505          0       2572
   emp_stgov |    152,127    15709.17    16292.85          0     114555
estcount_t~p |    152,334    9406.654    9421.556         84      59438
avgwwage_t~p |    152,334    861.6196    200.9441        356       3194
-------------+---------------------------------------------------------
  emp_transp |    152,334    143879.2    144973.2        629     872187
    u1_bldgs |    136,332    274.6464    358.5711      -1621       2688
    u1_units |    136,332    274.6464    358.5711      -1621       2688
    u1_value |    136,332    6.74e+07    8.85e+07  -1.35e+08   6.43e+08
 u1rep_bldgs |    136,332    262.2207    357.1151       -477       3759
-------------+---------------------------------------------------------
 u1rep_units |    136,332    262.2207    357.1151       -477       3759
 u1rep_value |    136,332    6.48e+07    8.80e+07  -1.32e+08   8.74e+08
       ln_mw |    156,600    2.079602    .1327775   1.981001   2.772589
ln_med_ren~c |    113,375    .0472541    .4493362  -.8722228   1.906781
ln_med_lis~c |    140,070    4.978332    .6512788   2.757321   7.917108
-------------+---------------------------------------------------------
ln_n_listi~c |     98,290    5.398087    .5551297   2.890372   7.668094
ln_n_newli~c |     34,572    4.135226    .4872817   2.397895   6.411819
ln_emp_biz~v |    152,334      11.108    1.386834   5.796058   13.37271
ln_emp_const |    151,077    9.898307    1.163937    5.31812   12.06551
ln_emp_eduhe |    152,334    11.04985    1.265766   6.175867   13.63523
-------------+---------------------------------------------------------
ln_emp_fed~v |    152,334    8.916786    1.366298    3.73767   12.28042
ln_emp_goo~r |    152,310    10.75745    1.182625   6.135565   13.12358
 ln_emp_info |    151,572    9.006427    1.549256   2.397895   12.38988
 ln_emp_leis |    152,334    10.86033    1.201436   5.631212   13.22092
ln_emp_loc~v |    149,085    10.64621    1.126274   7.035269   13.04718
-------------+---------------------------------------------------------
 ln_emp_manu |    151,056    10.03152     1.30013   4.543295   12.83908
ln_emp_nat~s |    149,376    6.965401    1.822471   .6931472   11.49115
ln_emp_ser~r |    152,334    12.69881    1.249131    7.91972   15.05461
ln_emp_stgov |    148,896    9.034419    1.380182   3.433987   11.64881
ln_emp_tra~p |    152,334    11.32727    1.175193   6.444131   13.67876
-------------+---------------------------------------------------------
ln_estcou~rv |    152,334    8.631106    1.247359   4.094345   10.93852
ln_estcoun~t |    152,334     7.63511    1.038369   3.555348   9.737374
ln_estcoun~e |    152,334    8.181748    1.281099   3.871201   12.41164
ln_estc~dgov |    152,334     4.47362    .8084446   1.098612   6.122493
ln_estco~dpr |    152,334    8.042478     1.06762   4.219508   10.31314
-------------+---------------------------------------------------------
ln_estcoun~o |    152,334    6.071127    1.338069   1.386294   9.488881
ln_estcou~is |    152,334    7.826004    1.132324   3.295837   10.57699
ln_estc~cgov |    152,334     5.01103    1.182176          0   8.333751
ln_estcoun~u |    152,334    6.723692    1.232639   2.302585   9.508146
ln_estcou~es |    151,809    4.487308    1.395918          0   7.527794
-------------+---------------------------------------------------------
ln_estco~vpr |    152,334    10.11085    1.210602   5.771441    13.0669
ln_estc~tgov |    152,127     4.15392    1.108557          0   8.694335
ln_estcoun~p |    152,334    8.611787     1.14944   4.430817   10.99269
ln_avgwwa~rv |    152,334    7.078686     .326307   5.420535   8.461046
ln_avgwwag~t |    151,077    6.982866    .2416437   6.122493   7.866339
-------------+---------------------------------------------------------
ln_avgwwag~e |    152,334    6.835003    .1581551   6.028278   7.588324
ln_avgw~dgov |    152,334    7.254022    .1652418   6.483108   7.909857
ln_avgww~dpr |    152,310    7.075718    .2589759   6.154858   8.346168
ln_avgwwag~o |    151,572    7.255305    .3551565   5.888878   8.906665
ln_avgwwa~is |    152,334     6.06221    .2759165   5.313206   7.030858
-------------+---------------------------------------------------------
ln_avgw~cgov |    149,085    6.872041    .1863058    6.05444   7.621685
ln_avgwwag~u |    151,056    7.120315    .2656149   6.139884   8.511175
ln_avgwwa~es |    149,376    6.864521    .5646428   5.384495   9.060215
ln_avgww~vpr |    152,334    6.858202     .302611   5.926926   8.117611
ln_avgw~tgov |    148,896    6.912444    .2492661   6.001415   7.852439
-------------+---------------------------------------------------------
ln_avgwwag~p |    152,334    6.733492    .2227758   5.874931   8.069029
 ln_u1_bldgs |    135,963    4.775056    1.589248          0   7.896553
 ln_u1_units |    135,963    4.775056    1.589248          0   7.896553
 ln_u1_value |    135,809    16.64258    3.649391          0   20.28197
ln_u1rep_b~s |    136,178    4.599205    1.755203          0   8.231908
-------------+---------------------------------------------------------
ln_u1rep_u~s |    136,178    4.599205    1.755203          0   8.231908
ln_u1rep_v~e |    135,968    16.17866    4.454632          0   20.58904
nonwhit~2010 |    156,600    .4607982    .2225559   .0598227   .9962162
trend_times2 |    156,600         451    69.27985        332        570
med_h~at_qtl |    156,600    2.498851     1.11838          1          4
-------------+---------------------------------------------------------
med_h~st_qtl |    156,600    2.467433    1.120644          1          4
renth~at_qtl |    156,600    2.498851     1.11838          1          4
renth~st_qtl |    156,600    2.467433    1.120644          1          4
colle~at_qtl |    156,600    2.498851     1.11838          1          4
colle~st_qtl |    156,600    2.467433    1.120644          1          4
-------------+---------------------------------------------------------
black~at_qtl |    156,600    2.498851     1.11838          1          4
black~st_qtl |    156,600    2.467433    1.120644          1          4
unemp~at_qtl |    156,600    2.498851     1.11838          1          4
unemp~st_qtl |    156,600    2.467433    1.120644          1          4
teen_~at_qtl |    156,600    2.498851     1.11838          1          4
-------------+---------------------------------------------------------
teen_~st_qtl |    156,600    2.467433    1.120644          1          4
     listwgt |     98,290    82.91839    56.11871   7.822441   941.2348
     d_ln_mw |    155,295    .0016445    .0119584   -.290338   .2412503




(note: file ../temp/fd_rent_panel.dta not found)
file ../temp/fd_rent_panel.dta saved

. 
end of do-file


Execute:  stataSE -e do "./estimate_compbias.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 120-user network perpetual
Serial number: 401606201670
  Licensed to: Brown University
               Brown University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do ./estimate_compbias.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/gabriborg/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/gabriborg/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/gabriborg/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/gabriborg/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../temp"
  2.         local outstub "../output"
  3. 
.         use "`instub'/fd_rent_panel.dta", clear
  4. 
.         make_results_labels
  5.         local estlabels_dyn "`r(estlabels_dyn)'"
  6.         local estlabels_static "`r(estlabels_static)'"
  7. 
.         * Static Model
.         run_static_placebo, depvar(ln_med_rent_psqft_sfcc) placebovar(ln_n_listings_sfcc) co
> ntrols(ln_med_list_psqft_sfcc) ///
>                                                 absorb(year_month i.zipcode) cluster(statefi
> ps)         
  8.                                                 
.         esttab * using "`outstub'/fd_table_placebo.tex", keep(D.ln_mw) compress se replace s
> ubstitute(\_ _)     ///
>                         coeflabels(`estlabels_static') ///
>                         stats(r2 N, fmt(%9.3f %9.0gc) ///
>                         labels("R-squared" "Observations")) star(* 0.10 ** 0.05 *** 0.01) //
> /
>                         mgroups("$\Delta$ ln(Median rent)" "$\Delta$ ln(No. listings)", patt
> ern(1 0 1 0) ///
>                         prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr)
> {@span})) ///
>                         nonote nomtitles
  9. 
.         plot_dynamic_placebo, depvar(ln_med_rent_psqft_sfcc) placebovar(ln_n_listings_sfcc) 
> ///
>                                                 absorb(year_month zipcode) cluster(statefips
> )
 10. 
. 
. 
. end

. 
. 
. program run_static_placebo
  1.         syntax, depvar(str) placebovar(str) absorb(str) cluster(str) [controls(str)]
  2. 
.         eststo clear
  3.         eststo: reghdfe D.`depvar' D.ln_mw, ///
>                 absorb(`absorb') ///
>                 vce(cluster `cluster') nocons
  4. 
.         eststo: reghdfe D.`placebovar' D.ln_mw, ///
>                 absorb(`absorb') ///
>                 vce(cluster `cluster') nocons
  5. 
. end

. 
. program plot_dynamic_placebo 
  1.         syntax, depvar(str) placebovar(str) absorb(str) cluster(str) [controls(str) w(int
>  5)]
  2. 
.         eststo clear
  3.         
.         eststo: reghdfe D.`placebovar' L(-`w'/`w').D.ln_mw `controls', ///
>                 absorb(`absorb') ///
>                 vce(cluster `cluster') nocons
  4. 
.         preserve
  5.                 coefplot, vertical base gen
  6.                 local winspan = 2*`w' + 1
  7.                 keep if _n<=`winspan'
  8.                 keep __at __b __se
  9.                 rename (__at __b __se) (at b_placebo1 se_placebo1)
 10.                 keep if !missing(at)
 11. 
.                 gen b_placebo1_lb = b_placebo1 - 1.645*se_placebo1
 12.                 gen b_placebo1_ub = b_placebo1 + 1.645*se_placebo1
 13. 
.                 sort at 
 14. 
.                 local period0 = `w' + 1
 15. 
.                 twoway (connected b_placebo1 at, mc(edkblue) lc(edkblue) lw(thin)) (rcap b_p
> lacebo1_lb b_placebo1_ub at, lc(edkblue) lp(dash) lw(vthin)), /// 
>                         graphregion(color(white)) bgcolor(white) ///
>                         xlabel(1 "-5" 2 "-4" 3 "-3" 4 "-2" ///
>                         5 "-1" 6 "0" 7 "1" 8 "2" 9 "3" ///
>                         10 "4" 11 "5", labsize(vsmall)) xtitle("Leads and lags of ln MW") //
> /
>                         ytitle("Effect on ln No. listings") ylabel(-0.3(0.1).5, grid labsize
> (small) angle(90))  ///
>                         yline(0, lcol(black)) ///
>                         legend(off)
 16.                 graph export "../output/fd_placebo.png", replace
 17.         restore
 18. 
. end 

. 
. program comment_table
  1.         syntax, trend_lin(str) trend_sq(str)
  2. 
.         estadd local zs_trend           "`trend_lin'"   
  3.         estadd local zs_trend_sq        "`trend_sq'"
  4. end

. 
. program store_dynamic_coeffs
  1.         syntax, model(str) w(int)
  2.         preserve
  3.                 coefplot, vertical base gen
  4.                 local winspan = 2*`w' + 1
  5.                 keep if _n<=`winspan'
  6.                 keep __at __b __se
  7.                 rename (__at __b __se) (at b_`model' se_`model')
  8.         
.                 keep if !missing(at)
  9. 
.                 gen b_`model'_lb = b_`model' - 1.645*se_`model'
 10.                 gen b_`model'_ub = b_`model' + 1.645*se_`model'
 11.         
.                 save "../temp/plot_coeffs_`model'.dta", replace
 12.         restore
 13. end 

. 
. program make_results_labels, rclass
  1.                 
.                 local estlabels_dyn `"            F5D.ln_mw "$\Delta \ln(MW)_{t-5}$" F4D.ln_
> mw "$\Delta \ln(MW)_{t-4}$""'
  2.                 local estlabels_dyn `"`estlabels_dyn' F3D.ln_mw "$\Delta \ln(MW)_{t-3}$" 
> F2D.ln_mw "$\Delta \ln(MW)_{t-2}$""'
  3.                 local estlabels_dyn `"`estlabels_dyn' FD.ln_mw "$\Delta \ln(MW)_{t-1}$" D
> .ln_mw "$\Delta \ln(MW)_{t}$""'
  4.                 local estlabels_dyn `"`estlabels_dyn' LD.ln_mw "$\Delta \ln(MW)_{t+1}$" L
> 2D.ln_mw "$\Delta \ln(MW)_{t+2}$""'
  5.                 local estlabels_dyn `"`estlabels_dyn' L3D.ln_mw "$\Delta \ln(MW)_{t+3}$" 
> L4D.ln_mw "$\Delta \ln(MW)_{t+4}$""'
  6.                 local estlabels_dyn `"`estlabels_dyn' L5D.ln_mw "$\Delta \ln(MW)_{t+5}$""
> '
  7. 
.                 return local estlabels_dyn "`estlabels_dyn'"    
  8. 
.                 local estlabels_static `"D.ln_mw "$\Delta \ln(MW)_{t}$""'
  9.                 return local estlabels_static "`estlabels_static'"
 10. end 

. 
. program make_plot_xlabels, rclass 
  1.         syntax, w(int)
  2. 
.         local xlab ""
  3.         forval lead = 1/`w' {
  4.                 local leadlab = `lead' - `w' - 1
  5.                 local xlab `"`xlab' `lead' "`leadlab'""'
  6.         }
  7.         local zero = `w' + 1
  8.         local xlab `"`xlab' `zero' "0""'
  9.         forval lag = 1/`w' {
 10.                 local coeflag = `zero' + `lag'
 11.                 local xlab `"`xlab' `coeflag' "`lag'""'
 12.         }
 13. 
.         return local xlab `xlab'
 14. end 

. 
. main
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =    112,232
Absorbing 2 HDFE groups                           F(   1,     40) =       4.56
Statistics robust to heteroskedasticity           Prob > F        =     0.0389
                                                  R-squared       =     0.0236
                                                  Adj R-squared   =     0.0125
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         41       Root MSE        =     0.0281

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .0256987   .0120325     2.14   0.039     .0013801    .0500173
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
     zipcode |      1143        1143           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(est1 stored)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     97,104
Absorbing 2 HDFE groups                           F(   1,     40) =       1.51
Statistics robust to heteroskedasticity           Prob > F        =     0.2265
                                                  R-squared       =     0.3823
                                                  Adj R-squared   =     0.3742
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         41       Root MSE        =     0.0893

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_n_listi~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |   .1044816   .0850636     1.23   0.227    -.0674384    .2764016
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        83           0          83     |
     zipcode |      1186        1186           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(est2 stored)
(note: file ../output/fd_table_placebo.tex not found)
(output written to ../output/fd_table_placebo.tex)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,174
Absorbing 2 HDFE groups                           F(  11,     40) =      11.27
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.3734
                                                  Adj R-squared   =     0.3645
                                                  Within R-sq.    =     0.0018
Number of clusters (statefips) =         41       Root MSE        =     0.0895

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_n_listi~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F5D. |  -.0000418   .0826749    -0.00   1.000    -.1671341    .1670505
        F4D. |   .0014688   .1470745     0.01   0.992    -.2957798    .2987174
        F3D. |   .1820305   .0920952     1.98   0.055    -.0041009    .3681619
        F2D. |   .0156342   .1099191     0.14   0.888    -.2065206    .2377889
         FD. |  -.0767019   .1247964    -0.61   0.542    -.3289248     .175521
         D1. |   .0900642   .0873124     1.03   0.308    -.0864007    .2665291
         LD. |  -.0042314   .0468975    -0.09   0.929    -.0990148    .0905521
        L2D. |   .0990927    .092367     1.07   0.290     -.087588    .2857735
        L3D. |  -.0474973    .088246    -0.54   0.593     -.225849    .1308544
        L4D. |  -.0325405   .1173392    -0.28   0.783    -.2696919    .2046109
        L5D. |  -.1671548   .0628683    -2.66   0.011    -.2942163   -.0400933
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        78           0          78     |
     zipcode |      1185        1185           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(est1 stored)

Generated variables:
              storage   display    value
variable name   type    format     label      variable label
----------------------------------------------------------------------------------------------
__by            byte    %9.0g      __by       subgraph ID
__plot          byte    %9.0g      __plot     plot ID
__at            byte    %9.0g                 plot position (category axis)
__mlbl          str1    %9s                   marker label
__mlpos         byte    %9.0g                 marker label position
__b             float   %9.0g                 coefficient
__V             float   %9.0g                 variance
__se            float   %9.0g                 standard error
__t             float   %9.0g                 t or z statistic
__df            byte    %9.0g                 degrees of freedom
__pval          float   %9.0g                 p-value
__ll1           float   %9.0g                 CI1: lower limit
__ul1           float   %9.0g                 CI1: upper limit
(156,589 observations deleted)
(0 observations deleted)
(file /Users/gabriborg/Dropbox (Brown)/research/min_wage_rent/analysis/first_differences_nlist
> /code/../output/fd_placebo.png written in PNG format)

. 
end of do-file

 make.py ended: 2020-11-22 10:50:49
