
 make.py started: 2021-09-23 20:39:09 C:\Users\shermo\Documents\GitHub\min_wage_rent\derived\zipcode\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local in_geo        "../../../base/geo_master/output"
  2.     local in_base_large "../../../drive/base_large"
  3.     local in_der_large  "../../../drive/derived_large"
  4.     local outstub       "../../../drive/derived_large/zipcode"
  5.     local logfile       "../output/data_file_manifest.log"
  6. 
.     build_zillow_zipcode_stats, instub(`in_base_large')
  7.     clean_zipcode_shares, instub(`in_der_large')
  8. 
.     use "`in_geo'/zip_county_place_usps_master.dta", clear
  9. 
.     merge 1:1 zipcode using "../temp/zillow_zipcodes_with_rents.dta",        
>  ///
>         nogen assert(1 3)
 10.     merge 1:1 zipcode using "`in_base_large'/demographics/zip_demo_2010.dt
> a", ///
>         nogen keep(1 3)
 11.     merge 1:1 zipcode using "../temp/zipcode_shares.dta",                 
>     ///
>         nogen keep(1 3)
 12. 
.     strcompress
 13.     save_data "`outstub'/zipcode_cross.dta",                              
>     ///
>         key(zipcode) log(`logfile') replace
 14.         export delimited "`outstub'/zipcode_cross.csv", replace
 15. end

. 
. program build_zillow_zipcode_stats
  1.     syntax, instub(str)
  2. 
.     use "`instub'/zillow/zillow_zipcode_clean.dta"
  3. 
.     keep if !missing(medrentpricepsqft_SFCC)
  4.     collapse (count) n_months_zillow_rents = medrentpricepsqft_SFCC, by(zi
> pcode)
  5.     tostring zipcode, format(%05.0f) replace
  6. 
.     save "../temp/zillow_zipcodes_with_rents.dta", replace
  7. end

. 
. program clean_zipcode_shares
  1.     syntax, instub(str)
  2. 
.     import delimited "`instub'/shares/zipcode_shares.csv", clear
  3.     tostring zipcode, format(%05.0f) replace
  4.     
.     save "../temp/zipcode_shares.dta"
  5. end

. 
. 
. main
(9,066,669 observations deleted)
zipcode already string; no replace
(note: file ../temp/zillow_zipcodes_with_rents.dta not found)
file ../temp/zillow_zipcodes_with_rents.dta saved
(18 vars, 39,134 obs)
zipcode was long now str5
file ../temp/zipcode_shares.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,172
        from master                    37,172  
        from using                          0  

    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,715
        from master                     1,715  
        from using                          0  

    matched                            38,773  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,721
        from master                     1,721  
        from using                          0  

    matched                            38,767  
    -----------------------------------------
  Converting str to strL: zipcode place_code countyfips cbsa10 zcta place_name 
> county_name cbsa10_name state_abb statefips
    strcompress grew data 74% so far, but I'm not done yet!
  variable n_months_zillow_rents was long now int
  variable zipcode was strL now str5
  variable place_code was strL now str5
  variable countyfips was strL now str5
  variable cbsa10 was strL now str5
  variable zcta was strL now str5
  place_name is strL now coalesced
  variable county_name was strL now str34
  cbsa10_name is strL now coalesced
  variable state_abb was strL now str2
  variable statefips was strL now str2
  (27,000,308 bytes saved)
       compress shrank data 47%
    strcompress shrank data  7% overall
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../../../drive/derived_large/zipcode/zipcode_cross.dta
Key: zipcode
===============================================================================
  40488:72(84401):798151669:3512531727

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  place_code |          0
  countyfips |          0
      cbsa10 |          0
        zcta |          0
-------------+---------------------------------------------------------
  place_name |          0
 county_name |          0
 cbsa10_name |          0
   state_abb |          0
   statefips |          0
-------------+---------------------------------------------------------
houses_zct~y |     40,488    3314.308      5032.1          1      47617
       rural |     40,488     .444675    .4969359          0          1
n_months_z~s |      3,316    59.70386    34.21254         12        119
     pop2010 |     38,773    7948.124    12720.91          0   113889.5
urb_sha~2010 |     34,593    .4613761    .4322838          0          1
-------------+---------------------------------------------------------
white_s~2010 |     34,593    .7672467    .2445641          0   .9947553
black_s~2010 |     34,593    .0835678    .1587737          0   .9884837
hisp_sh~2010 |     34,593    .0961775    .1577955          0    .990709
asian_s~2010 |     34,593    .0225304     .053216          0   .8468078
natam_s~2010 |     34,593    .0010224    .0080404          0   .3070784
-------------+---------------------------------------------------------
child_s~2010 |     34,593     .187605    .0428689          0    .484375
teen_sh~2010 |     34,593    .1292772    .0575974          0    .996958
youngad~2010 |     34,593     .118441     .041287          0   .5365554
adult_s~2010 |     34,593    .4128375    .0528451   .0001275   .7731959
elder_s~2010 |     34,593    .1518393    .0556119          0   .8564868
-------------+---------------------------------------------------------
housing~2010 |     38,773    3392.469    5173.868          0    47208.2
hh_couple_s~ |     34,585     .581981    .1150927          0          1
h~child_sh~0 |     34,583    .4022907    .0900778          0          1
renthou~2010 |     34,574    .2867532    .1724197   .0201613          1
workers20105 |     38,773    3602.293    5892.602          0   52364.31
-------------+---------------------------------------------------------
workers_pr~5 |     38,773    2876.938    4795.112          0   45090.99
work_c~20105 |     34,574    .6986709    .1894666          0          1
worktravel.. |     34,573     .175861    .1115814          0          1
worktravel.. |     34,573    .7431935    .1115257          0          1
worktravel.. |     34,573    .0809455    .0579218          0   .7333333
-------------+---------------------------------------------------------
colleg~20105 |     34,581    .3114013    .1492459          0          1
poor_s~20105 |     34,568    .1497958    .0956043          0          1
lo_hhi~20105 |     34,568     .465272    .1490258          0          1
hi_hhi~20105 |     34,568    .1834618    .1276682          0   .8888889
unemp_~20105 |     34,574    .0875349    .0456768          0   .4514774
-------------+---------------------------------------------------------
employ~20105 |     34,573    .8785067    .0618031   .3702624          1
work~ce20105 |     38,773    205.1118    385.5918          0   8881.796
tot_pinc20~5 |     38,773    1.79e+08    3.25e+08          0   5.33e+09
tot_pinc_f~5 |     38,773    1.48e+08    2.75e+08          0   4.60e+09
res_ratio_~m |     38,773    12.32049    39.30639          0   1521.203
-------------+---------------------------------------------------------
     rel_wgt |     38,773    .4518264    .3455028          0          1
worker_foo.. |     34,573    .0533413     .028772          0   .4623032
med_hh~20105 |     34,564    52634.71    21493.29       4607     250001
med_pi~20105 |     34,580    29804.26    9730.952       2499     127375
med_earn_h~5 |     32,047    22150.45    11708.58       2499     250001
-------------+---------------------------------------------------------
m~tectserv~5 |     31,544    42908.11    21188.16       2499     250001
med_earn_f~5 |     34,060     12568.8    6619.361       2499     250001
med_earn_c~5 |     33,532    19457.94     10530.6       2499     250001
med_~e_20105 |     33,425    16226.17    10071.91       2499     250001
med~sp_20105 |     34,354    32124.37    10454.59       2499     250001
-------------+---------------------------------------------------------
     workers |     38,767    3630.173    7859.805          0   189187.3
workers_yo~g |     38,767    845.4302    1825.673          0   48805.49
workers_lo~c |     38,767    832.8288    1641.201          0   53570.84
   residents |     34,601    4074.604    6233.506   .1946674    48838.9
residents_~g |     34,601    948.8076    1496.424   .0379372   15045.72
-------------+---------------------------------------------------------
residents_~c |     34,601    934.1051    1402.226    .044504   12589.05
   w_zipcode |     34,581     50082.1    27393.31       1001      99919
    own_jobs |     34,581    455.6732    980.6828          0    13930.5
own_jobs_y~g |     34,581    104.1031    235.4801          0   4854.239
own_jobs_l~c |     34,581    129.6497    266.5152          0   3995.538
-------------+---------------------------------------------------------
share_resi~g |     34,601    .2276282    .0366584   .1098524    .571236
share_resi~c |     34,601    .2453488    .0430792   .0508377   .5169173
sha~rs_young |     34,601    .2217406    .0503643          0   .7346939
sh~rs_lowinc |     34,601    .2639209    .0793858   .0145278   .8580786
share_work~o |     34,581    .0764637    .1010944          0   .8858448
-------------+---------------------------------------------------------
shar~o_young |     34,581     .016174     .022405          0   .2732153
sha~o_lowinc |     34,581    .0227128    .0294979          0   .3617685




file ../../../drive/derived_large/zipcode/zipcode_cross.dta saved
file ../../../drive/derived_large/zipcode/zipcode_cross.csv saved

. 
end of do-file

 make.py ended: 2021-09-23 20:39:54
