
 make.py started: 2022-02-25 13:54:13 C:\Users\shermo\Documents\GitHub\min_wage_rent\derived\zipcode\code 




Execute:  StataMP-64 /e do "./make_frame.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./make_frame.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local instub  "../../../drive/base_large/census_block_master"
  2.     local outstub "../../../drive/derived_large/zipcode"
  3.     local logfile "../output/data_file_manifest.log"
  4. 
.     use `instub'/census_block_master.dta if !missing(zipcode), clear
  5. 
.     make_baseline_frame
  6. 
.     assign_geography, instub(`instub') geo(state_place_code)
  7.     assign_geography, instub(`instub') geo(place_code)
  8.     assign_geography, instub(`instub') geo(countyfips)
  9.     assign_geography, instub(`instub') geo(statefips)
 10.     assign_geography, instub(`instub') geo(cbsa10)
 11. 
.     strcompress
 12.     save_data "`outstub'/zipcode_frame.dta",                  ///
>         key(zipcode) log(`logfile') replace
 13.     export delimited "`outstub'/zipcode_frame.csv", replace
 14. end

. 
. program make_baseline_frame
  1. 
.     bys zipcode: gen  n_census_blocks = _N
  2.     bys zipcode: egen n_places        = nvals(place_code)   // Must instal
> l egenmore
  3.     bys zipcode: egen n_counties      = nvals(countyfips)
  4.     bys zipcode: egen n_states        = nvals(statefips)
  5. 
.     preserve
  6.         gcollapse (mean) share_rural_wgt_houses = rural ///
>                 [aweight = num_house10], by(zipcode)
  7. 
.         save ../temp/share_rural.dta, replace
  8.     restore
  9. 
.     gcollapse (max) n_census_blocks n_counties  ///
>                     n_places        n_states    ///
>               (sum) num_houses   = num_house10  ///
>                     population   = pop10        ///
>              (mean) sh_rural     = rural,       ///
>         by(zipcode)
 10. 
.     replace n_places = 0 if missing(n_places)
 11. 
.     merge 1:1 zipcode using ../temp/share_rural.dta, ///
>         assert(1 3) nogen
 12. end

. 
. program assign_geography
  1.     syntax, instub(str) geo(str) [pop]
  2. 
.     preserve
  3.         use `instub'/census_block_master.dta if !missing(zipcode), clear
  4.         if "`geo'"=="state_place_code" {
  5.             egen state_place_code = group(statefips place_code)
  6.         }
  7. 
.         gcollapse (sum) num_houses   = num_house10  ///
>                         population   = pop10,       ///
>             by(zipcode `geo')
  8. 
.         if "`pop'"=="" {
  9.             gsort zipcode -num_houses
 10.         }
 11.         else {
 12.             gsort zipcode -population
 13.         }
 14. 
.         bys zipcode: keep if _n == 1
 15. 
.         tempfile data_geo
 16.         save    `data_geo', replace
 17.     restore
 18. 
.     merge 1:1 zipcode using `data_geo', assert(3) nogen
 19. end

. 
. 
. main
(5633558 missing values generated)
(note: file ../temp/share_rural.dta not found)
file ../temp/share_rural.dta saved
(4,899 real changes made)

    Result                           # of obs.
    -----------------------------------------
    not matched                           251
        from master                       251  
        from using                          0  

    matched                            31,572  
    -----------------------------------------
(5633558 missing values generated)
(49,446 observations deleted)
(note: file C:\Users\shermo\AppData\Local\Temp\13\ST_8298_000002.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\13\ST_8298_000002.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,823  
    -----------------------------------------
(49,385 observations deleted)
(note: file C:\Users\shermo\AppData\Local\Temp\13\ST_8298_000002.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\13\ST_8298_000002.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,823  
    -----------------------------------------
(14,019 observations deleted)
(note: file C:\Users\shermo\AppData\Local\Temp\13\ST_8298_000002.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\13\ST_8298_000002.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,823  
    -----------------------------------------
(458 observations deleted)
(note: file C:\Users\shermo\AppData\Local\Temp\13\ST_8298_000002.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\13\ST_8298_000002.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,823  
    -----------------------------------------
(9,209 observations deleted)
(note: file C:\Users\shermo\AppData\Local\Temp\13\ST_8298_000002.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\13\ST_8298_000002.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,823  
    -----------------------------------------
  Converting str to strL: zipcode place_code countyfips statefips cbsa10
    strcompress grew data 399% so far, but I'm not done yet!
  variable n_census_blocks was float now int
  variable n_counties was float now byte
  variable n_places was float now byte
  variable n_states was float now byte
  variable state_place_code was float now int
  variable num_houses was double now long
  variable population was double now long
  variable zipcode was strL now str5
  variable place_code was strL now str5
  variable countyfips was strL now str5
  variable statefips was strL now str2
  variable cbsa10 was strL now str5
  (10,394,748 bytes saved)
       compress shrank data 86%
    strcompress shrank data 32% overall
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../../../drive/derived_large/zipcode/zipcode_frame.dta
Key: zipcode
===============================================================================
  31823:14(28307):2932860040:125231617

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
n_census_b~s |     31,823    346.8557    355.2548          1       9067
  n_counties |     31,823     1.44053    .6937868          1          7
    n_places |     31,823    1.674638    1.655265          0         80
    n_states |     31,823    1.014392    .1191026          1          2
-------------+---------------------------------------------------------
  num_houses |     31,823    4137.888    5588.714          0      48073
  population |     31,823    9700.747    13765.77          0     115182
    sh_rural |     31,823    .5700665    .3564282          0          1
share_rura~s |     31,572    .4809932    .3647778          0          1
state_plac~e |     15,819    13743.93    8614.375          3      29373
-------------+---------------------------------------------------------
  place_code |          0
  countyfips |          0
   statefips |          0
      cbsa10 |          0




(note: file ../../../drive/derived_large/zipcode/zipcode_frame.dta not found)
file ../../../drive/derived_large/zipcode/zipcode_frame.dta saved
(note: file ../../../drive/derived_large/zipcode/zipcode_frame.csv not found)
file ../../../drive/derived_large/zipcode/zipcode_frame.csv saved

. 
end of do-file


Execute:  StataMP-64 /e do "./make_cross.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./make_cross.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local in_frame      "../../../drive/derived_large/zipcode"
  2.     local in_base_large "../../../drive/base_large"
  3.     local in_der_large  "../../../drive/derived_large"
  4.     local outstub       "../../../drive/derived_large/zipcode"
  5.     local logfile       "../output/data_file_manifest.log"
  6. 
.     build_zillow_zipcode_stats, instub(`in_base_large')
  7. 
.     use `in_frame'/zipcode_frame.dta, clear
  8. 
.     merge 1:1 zipcode using "../temp/zillow_zipcodes_with_rents.dta",        
>  ///
>         nogen assert(1 3)
  9. 
.     *merge 1:1 zipcode using "`in_base_large'/demographics/zip_demo_2010.dta"
> , ///
>     *    nogen keep(1 3)
.     ** SHOULD WE DROP THE OLD base/demographics?
. 
.     *merge_lodes_shares, instub(`in_base_large')
.     *merge_lodes_shares, instub(`in_base_large') yy(2017)
.     *merge_od_shares,    instub(`in_der_large')
. 
.     strcompress
 10.     save_data "`outstub'/zipcode_cross.dta",                              
>     ///
>         key(zipcode) log(`logfile') replace
 11.     export delimited "`outstub'/zipcode_cross.csv", replace
 12. end

. 
. program build_zillow_zipcode_stats
  1.     syntax, instub(str)
  2. 
.     use "`instub'/zillow/zillow_zipcode_clean.dta"
  3. 
.     keep if !missing(medrentpricepsqft_SFCC)
  4.     collapse (count) n_months_zillow_rents = medrentpricepsqft_SFCC, by(zi
> pcode)
  5.     tostring zipcode, format(%05.0f) replace
  6. 
.     save "../temp/zillow_zipcodes_with_rents.dta", replace
  7. end

. 
. program merge_lodes_shares
  1.     syntax, instub(str) [yy(int 2014)]
  2. 
.     preserve
  3.         use "`instub'/lodes_zipcodes/jobs.dta" if jobs_by == "residence" &
>  year == `yy', clear
  4.         
.         keep zipcode share_age_* share_earn_* share_naics_* share_sch_*
  5.         rename share_age_* sh_residents_*_`yy'
  6.         rename share_earn_* sh_residents_*_`yy'
  7.         rename share_naics_* sh_residents_*_`yy'
  8.         rename share_sch_* sh_residents_*_`yy'
  9.         
.         save "../temp/residents_shares.dta", replace
 10.     restore
 11.     
.     preserve
 12.         use "`instub'/lodes_zipcodes/jobs.dta" if jobs_by == "workplace" &
>  year == `yy', clear
 13.         
.         keep zipcode share_age_* share_earn_* share_naics_* share_sch_*
 14.         rename share_age_* sh_workers_*_`yy'
 15.         rename share_earn_* sh_workers_*_`yy'
 16.         rename share_naics_* sh_workers_*_`yy'
 17.         rename share_sch_* sh_workers_*_`yy'
 18.         
.         save "../temp/workers_shares.dta", replace
 19.     restore
 20. 
.     merge 1:1 zipcode using "../temp/residents_shares.dta", nogen
 21.     merge 1:1 zipcode using "../temp/workers_shares.dta", nogen
 22. end

. 
. program merge_od_shares
  1.     syntax, instub(str)
  2. 
.     foreach yy in 2014 2017 {
  3.         preserve
  4.             clear
  5.             import delimited "`instub'/shares/zipcode_shares.csv", stringc
> ols(1)
  6. 
.             keep if year == `yy'
  7. 
.             keep zipcode share_*
  8.             rename share_workers_*      sh_workers_od_*_`yy'
  9.             rename share_residents_*    sh_residents_od_*_`yy'
 10.             rename share_work_samegeo_* sh_work_samegeo_od_*_`yy'
 11. 
.             save "../temp/od_shares_`yy'.dta"
 12.         restore
 13.     }
 14.     merge 1:1 zipcode using "../temp/od_shares_2014.dta", nogen
 15.     merge 1:1 zipcode using "../temp/od_shares_2017.dta", nogen
 16. end

. 
. 
. main
(9,066,669 observations deleted)
zipcode already string; no replace
(note: file ../temp/zillow_zipcodes_with_rents.dta not found)
file ../temp/zillow_zipcodes_with_rents.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        28,507
        from master                    28,507  
        from using                          0  

    matched                             3,316  
    -----------------------------------------
  Converting str to strL: zipcode place_code countyfips statefips cbsa10
    strcompress grew data 538% so far, but I'm not done yet!
  variable n_months_zillow_rents was long now int
  variable zipcode was strL now str5
  variable place_code was strL now str5
  variable countyfips was strL now str5
  variable statefips was strL now str2
  variable cbsa10 was strL now str5
  (9,874,596 bytes saved)
       compress shrank data 85%
    strcompress shrank data  4% overall
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../../../drive/derived_large/zipcode/zipcode_cross.dta
Key: zipcode
===============================================================================
  31823:15(72445):2541927261:3288792883

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
n_census_b~s |     31,823    346.8557    355.2548          1       9067
  n_counties |     31,823     1.44053    .6937868          1          7
    n_places |     31,823    1.674638    1.655265          0         80
    n_states |     31,823    1.014392    .1191026          1          2
-------------+---------------------------------------------------------
  num_houses |     31,823    4137.888    5588.714          0      48073
  population |     31,823    9700.747    13765.77          0     115182
    sh_rural |     31,823    .5700665    .3564282          0          1
share_rura~s |     31,572    .4809932    .3647778          0          1
state_plac~e |     15,819    13743.93    8614.375          3      29373
-------------+---------------------------------------------------------
  place_code |          0
  countyfips |          0
   statefips |          0
      cbsa10 |          0
n_months_z~s |      3,316    59.70386    34.21254         12        119




(note: file ../../../drive/derived_large/zipcode/zipcode_cross.dta not found)
file ../../../drive/derived_large/zipcode/zipcode_cross.dta saved
(note: file ../../../drive/derived_large/zipcode/zipcode_cross.csv not found)
file ../../../drive/derived_large/zipcode/zipcode_cross.csv saved

. 
end of do-file

 make.py ended: 2022-02-25 13:59:41
