
 make.py started: 2021-11-11 07:21:15 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_stacked_experimental\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/stacked_sample_experime
> ntal"
  2.         local logfile "../output/data_file_manifest.log"
  3. 
.         local cluster "cbsa10"
  4.         
.         use "`instub'/stacked_sample_window6.dta", clear
  5.         *describe d_ln_emp_* d_ln_estcount_* d_ln_avgwwage_*, varlist
.         *local controls = r(varlist)
.         local absorb "year_month#event_id cbsa10" 
  6.         
.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(`absorb') cluster(statefips) ///
>                 model_name(stacked_static_w6) outfolder("../temp")
  7.                 
.     estimate_dyn_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(`absorb') cluster(statefips) ///
>                 model_name(stacked_dyn_w6) outfolder("../temp")
  8.                 
.         use "`instub'/stacked_sample_window3.dta", clear
  9.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(`absorb') cluster(statefips) ///
>                 model_name(stacked_static_w3) outfolder("../temp")
 10.                 
.     estimate_dyn_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") w(3) ///
>             absorb(`absorb') cluster(statefips) ///
>                 model_name(stacked_dyn_w3) outfolder("../temp")
 11.                 
.         use "`instub'/stacked_sample_window9.dta", clear
 12.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(`absorb') cluster(statefips) ///
>                 model_name(stacked_static_w9) outfolder("../temp")
 13.                 
.     estimate_dyn_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") w(9) ///
>             absorb(`absorb') cluster(statefips) ///
>                 model_name(stacked_dyn_w9) outfolder("../temp")
 14.                 
.         use ../temp/estimates_stacked_static_w6.dta, clear
 15.         foreach ff in stacked_static_w3 stacked_static_w9 {
 16.                 append using ../temp/estimates_`ff'.dta
 17.         }
 18.         save_data "../output/estimates_stacked_static.dta", ///
>             key(model var at) log(`logfile') replace
 19.         export delimited "../output/estimates_stacked_static.csv", replace
 20.         
.         use ../temp/estimates_stacked_dyn_w6.dta, clear
 21.         foreach ff in stacked_dyn_w3 stacked_dyn_w9 {
 22.                 append using ../temp/estimates_`ff'.dta
 23.         }
 24.         save_data "../output/estimates_stacked_dyn.dta", ///
>             key(model var at) log(`logfile') replace
 25.         export delimited "../output/estimates_stacked_dyn.csv", replace
 26. end

. 
. main
(dropped 128 singleton observations)
(MWFE estimator converged in 10 iterations)

HDFE Linear regression                            Number of obs   =  1,010,565
Absorbing 2 HDFE groups                           F(   2,     27) =       0.04
Statistics robust to heteroskedasticity           Prob > F        =     0.9588
                                                  R-squared       =     0.0238
                                                  Adj R-squared   =     0.0172
                                                  Within R-sq.    =     0.0000
Number of clusters (statefips) =         28       Root MSE        =     0.0316

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0002187   .0061607    -0.04   0.972    -.0128595     .012422
 d_exp_ln_mw |   .0019649   .0123575     0.16   0.875    -.0233906    .0273203
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      6747           0        6747     |
                cbsa10 |       150          19         131     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    0.01
            Prob > F =    0.9048
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(1,011,957 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w6.dta not found)
file ../temp/estimates_stacked_static_w6.dta saved
(note: file ../temp/estimates_stacked_static_w6.csv not found)
file ../temp/estimates_stacked_static_w6.csv saved
(dropped 134 singleton observations)
(MWFE estimator converged in 10 iterations)

HDFE Linear regression                            Number of obs   =    951,338
Absorbing 2 HDFE groups                           F(  14,     27) =     426.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0251
                                                  Adj R-squared   =     0.0182
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         28       Root MSE        =     0.0312

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
F6_d_exp_l~w |  -.0154976   .0157334    -0.99   0.333    -.0477797    .0167846
F5_d_exp_l~w |   -.015412   .0239078    -0.64   0.525    -.0644669    .0336428
F4_d_exp_l~w |  -.0105255   .0104433    -1.01   0.322    -.0319534    .0109024
F3_d_exp_l~w |   .0037259   .0161134     0.23   0.819     -.029336    .0367878
F2_d_exp_l~w |   .0301526   .0154205     1.96   0.061    -.0014876    .0617928
F1_d_exp_l~w |   .0630929   .0340708     1.85   0.075    -.0068146    .1330004
 d_exp_ln_mw |  -.0059257   .0274199    -0.22   0.831    -.0621867    .0503352
L1_d_exp_l~w |    .003058   .0145569     0.21   0.835    -.0268103    .0329264
L2_d_exp_l~w |   .0030457   .0124297     0.25   0.808    -.0224579    .0285494
L3_d_exp_l~w |   .0144338   .0129969     1.11   0.277    -.0122337    .0411013
L4_d_exp_l~w |    .053982   .0136299     3.96   0.000     .0260157    .0819483
L5_d_exp_l~w |   .0495043   .0260883     1.90   0.068    -.0040245    .1030331
L6_d_exp_l~w |  -.0337397   .0067978    -4.96   0.000    -.0476875   -.0197918
     d_ln_mw |  -.0205195   .0168501    -1.22   0.234     -.055093     .014054
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      6582           0        6582     |
                cbsa10 |       150          19         131     |
---------------------------------------------------------------+

 ( 1)  - d_exp_ln_mw + d_ln_mw = 0

       F(  1,    27) =    0.11
            Prob > F =    0.7379

 ( 1)  F1_d_exp_ln_mw = 0
 ( 2)  F2_d_exp_ln_mw = 0
 ( 3)  F3_d_exp_ln_mw = 0
 ( 4)  F4_d_exp_ln_mw = 0
 ( 5)  F5_d_exp_ln_mw = 0
 ( 6)  F6_d_exp_ln_mw = 0

       F(  6,    27) =    5.89
            Prob > F =    0.0005
file ../temp/estimates.dta saved
(1,011,945 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(14 real changes made)
(1 real change made)
(note: file ../temp/estimates_stacked_dyn_w6.dta not found)
file ../temp/estimates_stacked_dyn_w6.dta saved
(note: file ../temp/estimates_stacked_dyn_w6.csv not found)
file ../temp/estimates_stacked_dyn_w6.csv saved
(dropped 49 singleton observations)
(MWFE estimator converged in 10 iterations)

HDFE Linear regression                            Number of obs   =    662,128
Absorbing 2 HDFE groups                           F(   2,     28) =       0.58
Statistics robust to heteroskedasticity           Prob > F        =     0.5657
                                                  R-squared       =     0.0267
                                                  Adj R-squared   =     0.0205
                                                  Within R-sq.    =     0.0000
Number of clusters (statefips) =         29       Root MSE        =     0.0328

                             (Std. Err. adjusted for 29 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0108741   .0115318    -0.94   0.354    -.0344959    .0127477
 d_exp_ln_mw |   .0204005   .0260629     0.78   0.440    -.0329869    .0737879
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      4060           0        4060     |
                cbsa10 |       157          20         137     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    28) =    0.70
            Prob > F =    0.4094
file ../temp/estimates.dta saved
(662,947 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w3.dta not found)
file ../temp/estimates_stacked_static_w3.dta saved
(note: file ../temp/estimates_stacked_static_w3.csv not found)
file ../temp/estimates_stacked_static_w3.csv saved
(dropped 53 singleton observations)
(MWFE estimator converged in 10 iterations)

HDFE Linear regression                            Number of obs   =    646,196
Absorbing 2 HDFE groups                           F(   8,     28) =      59.00
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0270
                                                  Adj R-squared   =     0.0207
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         29       Root MSE        =     0.0326

                             (Std. Err. adjusted for 29 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
F3_d_exp_l~w |   .0094635   .0091089     1.04   0.308    -.0091952    .0281222
F2_d_exp_l~w |  -.0172446   .0139993    -1.23   0.228    -.0459207    .0114316
F1_d_exp_l~w |   .0285625   .0149905     1.91   0.067    -.0021441     .059269
 d_exp_ln_mw |   .0225838   .0246284     0.92   0.367    -.0278653    .0730329
L1_d_exp_l~w |   .0530933   .0216058     2.46   0.020     .0088358    .0973508
L2_d_exp_l~w |   .0139002    .011705     1.19   0.245    -.0100764    .0378768
L3_d_exp_l~w |   .0157821   .0076929     2.05   0.050      .000024    .0315403
     d_ln_mw |  -.0097795   .0107341    -0.91   0.370    -.0317672    .0122083
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      4038           0        4038     |
                cbsa10 |       157          20         137     |
---------------------------------------------------------------+

 ( 1)  - d_exp_ln_mw + d_ln_mw = 0

       F(  1,    28) =    0.85
            Prob > F =    0.3650

 ( 1)  F1_d_exp_ln_mw = 0
 ( 2)  F2_d_exp_ln_mw = 0
 ( 3)  F3_d_exp_ln_mw = 0

       F(  3,    28) =    1.84
            Prob > F =    0.1621
file ../temp/estimates.dta saved
(662,941 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(8 real changes made)
(1 real change made)
(note: file ../temp/estimates_stacked_dyn_w3.dta not found)
file ../temp/estimates_stacked_dyn_w3.dta saved
(note: file ../temp/estimates_stacked_dyn_w3.csv not found)
file ../temp/estimates_stacked_dyn_w3.csv saved
(dropped 266 singleton observations)
(MWFE estimator converged in 10 iterations)

HDFE Linear regression                            Number of obs   =  1,340,852
Absorbing 2 HDFE groups                           F(   2,     27) =       1.68
Statistics robust to heteroskedasticity           Prob > F        =     0.2051
                                                  R-squared       =     0.0247
                                                  Adj R-squared   =     0.0177
                                                  Within R-sq.    =     0.0000
Number of clusters (statefips) =         28       Root MSE        =     0.0316

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |   .0103167   .0060244     1.71   0.098    -.0020443    .0226776
 d_exp_ln_mw |  -.0099308   .0107788    -0.92   0.365     -.032047    .0121855
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      9310           0        9310     |
                cbsa10 |       143          19         124     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    1.62
            Prob > F =    0.2144
file ../temp/estimates.dta saved
(1,341,854 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w9.dta not found)
file ../temp/estimates_stacked_static_w9.dta saved
(note: file ../temp/estimates_stacked_static_w9.csv not found)
file ../temp/estimates_stacked_static_w9.csv saved
(dropped 231 singleton observations)
(MWFE estimator converged in 10 iterations)

HDFE Linear regression                            Number of obs   =  1,109,186
Absorbing 2 HDFE groups                           F(  20,     27) =   10515.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0287
                                                  Adj R-squared   =     0.0211
                                                  Within R-sq.    =     0.0006
Number of clusters (statefips) =         28       Root MSE        =     0.0303

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
F9_d_exp_l~w |   -.068403    .027475    -2.49   0.019    -.1247769    -.012029
F8_d_exp_l~w |  -.0150564   .0197678    -0.76   0.453    -.0556165    .0255037
F7_d_exp_l~w |  -.0243862   .0132227    -1.84   0.076     -.051517    .0027447
F6_d_exp_l~w |   .0058372   .0226803     0.26   0.799     -.040699    .0523734
F5_d_exp_l~w |   .0620975   .0298041     2.08   0.047     .0009445    .1232505
F4_d_exp_l~w |  -.0250773    .014303    -1.75   0.091    -.0544247    .0042701
F3_d_exp_l~w |   .0140782   .0233135     0.60   0.551    -.0337571    .0619136
F2_d_exp_l~w |   .0163843   .0184529     0.89   0.382    -.0214779    .0542465
F1_d_exp_l~w |   .0600816    .023076     2.60   0.015     .0127335    .1074298
 d_exp_ln_mw |  -.0165932   .0236678    -0.70   0.489    -.0651555    .0319691
L1_d_exp_l~w |  -.0222266   .0146432    -1.52   0.141    -.0522719    .0078187
L2_d_exp_l~w |  -.0027169   .0133435    -0.20   0.840    -.0300955    .0246617
L3_d_exp_l~w |   .0765775   .0253853     3.02   0.006     .0244911    .1286638
L4_d_exp_l~w |   .0843051   .0171273     4.92   0.000     .0491627    .1194475
L5_d_exp_l~w |   .0592401   .0169422     3.50   0.002     .0244776    .0940026
L6_d_exp_l~w |  -.0510094   .0075213    -6.78   0.000    -.0664418   -.0355771
L7_d_exp_l~w |  -.0944911   .0165276    -5.72   0.000    -.1284028   -.0605793
L8_d_exp_l~w |   .0124871   .0175242     0.71   0.482    -.0234696    .0484437
L9_d_exp_l~w |  -.0178803    .006002    -2.98   0.006    -.0301955   -.0055652
     d_ln_mw |  -.0072705   .0130096    -0.56   0.581     -.033964    .0194231
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      8456           0        8456     |
                cbsa10 |       142          19         123     |
---------------------------------------------------------------+

 ( 1)  - d_exp_ln_mw + d_ln_mw = 0

       F(  1,    27) =    0.08
            Prob > F =    0.7835

 ( 1)  F1_d_exp_ln_mw = 0
 ( 2)  F2_d_exp_ln_mw = 0
 ( 3)  F3_d_exp_ln_mw = 0
 ( 4)  F4_d_exp_ln_mw = 0
 ( 5)  F5_d_exp_ln_mw = 0
 ( 6)  F6_d_exp_ln_mw = 0
 ( 7)  F7_d_exp_ln_mw = 0
 ( 8)  F8_d_exp_ln_mw = 0
 ( 9)  F9_d_exp_ln_mw = 0

       F(  9,    27) =  224.50
            Prob > F =    0.0000
file ../temp/estimates.dta saved
(1,341,836 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(20 real changes made)
(1 real change made)
(note: file ../temp/estimates_stacked_dyn_w9.dta not found)
file ../temp/estimates_stacked_dyn_w9.dta saved
(note: file ../temp/estimates_stacked_dyn_w9.csv not found)
file ../temp/estimates_stacked_dyn_w9.csv saved
(data now sorted by model var at)
  (0 bytes saved)
===============================================================================
File: ../output/estimates_stacked_static.dta
Key: model var at
===============================================================================
  6:8(69955):3890818883:2024044178

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       model |          0
         var |          0
          at |          6           0           0          0          0
           b |          6    .0019431    .0120061  -.0108741   .0204005
          se |          6    .0121527    .0073385   .0060244   .0260629
-------------+---------------------------------------------------------
           N |          6     1004515    303570.8     662128    1340852
          r2 |          6    .0250565    .0012991   .0238466   .0266673
  p_equality |          6    .5095307    .3183712   .2143822   .9048262




(note: file ../output/estimates_stacked_static.dta not found)
file ../output/estimates_stacked_static.dta saved
(note: file ../output/estimates_stacked_static.csv not found)
file ../output/estimates_stacked_static.csv saved
(data now sorted by model var at)
  (0 bytes saved)
===============================================================================
File: ../output/estimates_stacked_dyn.dta
Key: model var at
===============================================================================
  42:9(97289):4186952612:3290934248

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       model |          0
         var |          0
          at |         42           0    4.361696         -9          9
           b |         42    .0067075    .0380215  -.0944911   .0843051
          se |         42    .0172551    .0066578    .006002   .0340708
-------------+---------------------------------------------------------
           N |         42    968381.4    173276.4     646196    1109186
          r2 |         42    .0271764    .0015779   .0251445    .028661
  p_equality |         42    .6885927    .1601697   .3650217   .7835249
  p_pretrend |         42    .0310376     .064335   5.31e-23   .1620784




(note: file ../output/estimates_stacked_dyn.dta not found)
file ../output/estimates_stacked_dyn.dta saved
(note: file ../output/estimates_stacked_dyn.csv not found)
file ../output/estimates_stacked_dyn.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> 
> 
> main <- function() {
+   instub  <- "../output/"
+   outstub <- "../output/"
+   
+   est <- read.csv(file.path(instub, "estimates_stacked_static.csv"))
+   
+   txt <- c("<tab:stacked>")
+   txt <- c(txt, 
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$b,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$b, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$b, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$se,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$se, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$se, sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_exp_ln_mw",]$b,
+                  est[est$model == "stacked_static_w6" & est$var == "d_exp_ln_mw",]$b, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_exp_ln_mw",]$b, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_exp_ln_mw",]$se,
+                  est[est$model == "stacked_static_w6" & est$var == "d_exp_ln_mw",]$se, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_exp_ln_mw",]$se, sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$p_equality,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$p_equality,
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$p_equality, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$r2,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$r2,
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$r2, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$N,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$N,
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$N, sep = "\t"))
+   
+   fileConn <- file(file.path(outstub, "stacked.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.26    0.20    1.10 


Execute:  StataMP-64 /e do "./figures.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./figures.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     use "../output/estimates_stacked_dyn.dta", clear
  2.     make_bounds
  3.     
.     local y_label       "-0.16(0.04).2"
  4.     local exp_ln_mw_var "exp_ln_mw_17"
  5.     sum at
  6.     local w = r(max)
  7. 
.     offset_x_axis
  8. 
.     plot_dynamics_both, model(stacked_dyn_w6) dyn_var(d_exp_ln_mw) ///
>         legend_dyn_var(Workplace MW) y_label(`y_label') ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce) ///
>         stat_var(d_ln_mw) legend_stat_var(Residence MW) ///
>         color_stat_var(maroon) symbol_stat_var(square) ///
>         x_label(-6(1)6) name(fd_stacked_w6)
  9.         
.     plot_dynamics_both, model(stacked_dyn_w3) dyn_var(d_exp_ln_mw) ///
>         legend_dyn_var(Workplace MW) y_label(`y_label') ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce) ///
>         stat_var(d_ln_mw) legend_stat_var(Residence MW) ///
>         color_stat_var(maroon) symbol_stat_var(square) ///
>         x_label(-3(1)3)  name(fd_stacked_w3)
 10.                 
.     plot_dynamics_both, model(stacked_dyn_w9) dyn_var(d_exp_ln_mw) ///
>         legend_dyn_var(Workplace MW) y_label(`y_label') ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce) ///
>         stat_var(d_ln_mw) legend_stat_var(Residence MW) ///
>         color_stat_var(maroon) symbol_stat_var(square) ///
>         x_label(-9(1)9) name(fd_stacked_w9)
 11. end

. 
. program make_bounds
  1.     gen b_lb = b - 1.96*se
  2.     gen b_ub = b + 1.96*se
  3. end

. 
. program offset_x_axis
  1.     syntax, [k(real 0.15)]
  2.     cap drop at_r at_l
  3.     gen at_r = at + `k'
  4.     gen at_l = at - `k'
  5. end

. 
. program plot_dynamics_both
  1.     syntax, model(str) dyn_var(str) stat_var(str) y_label(str) ///
>         legend_dyn_var(str) color_dyn_var(str) symbol_dyn_var(str) ///
>         legend_stat_var(str) color_stat_var(str) symbol_stat_var(str) ///
>         x_label(str) name(str)
  2.         
.     preserve
  3.         keep if model == "`model'"
  4.         twoway  (scatter b      at_r if var == "`dyn_var'" & at == 0,     
>       ///
>                      mcol(`color_dyn_var') msymbol(`symbol_dyn_var'))        
>    ///
>                 (scatter b      at   if var == "`dyn_var'" & at != 0,        
>    ///
>                      mcol(`color_dyn_var') msymbol(`symbol_dyn_var'))        
>    ///
>                 (rcap b_lb b_ub at_r if var == "`dyn_var'" & at == 0,        
>    ///
>                     lcol(`color_dyn_var') lw(thin))                          
>    ///
>                 (rcap b_lb b_ub at   if var == "`dyn_var'" & at != 0,        
>    ///
>                     lcol(`color_dyn_var') lw(thin))                          
>    ///
>                 (scatter b      at_l if var == "`stat_var'",                 
>    ///
>                     mcol(`color_stat_var') msymbol(`symbol_stat_var'))       
>    ///
>                 (rcap b_lb b_ub at_l if var == "`stat_var'",                 
>    ///
>                     col(`color_stat_var') lw(thin)),                         
>    ///
>             yline(0, lcol(black))                                            
>    ///
>             xlabel(`x_label', labsize(small)) xtitle("")                     
>       ///
>             ylabel(`y_label', grid labsize(small)) ytitle("Coefficient")     
>    ///
>             legend(order(1 `"`legend_dyn_var'"' 5 `"`legend_stat_var'"' ))   
>    ///
>             graphregion(color(white)) bgcolor(white)
  5.         
.         graph export "../output/`name'.png", replace
  6.         graph export "../output/`name'.eps", replace
  7.     restore
  8. end

. 
. 
. main

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          at |         42           0    4.361696         -9          9
(28 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note: file ../output/fd_stacked_w6.png not found)
(file ../output/fd_stacked_w6.png written in PNG format)
(note: file ../output/fd_stacked_w6.eps not found)
(file ../output/fd_stacked_w6.eps written in EPS format)
(34 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note: file ../output/fd_stacked_w3.png not found)
(file ../output/fd_stacked_w3.png written in PNG format)
(note: file ../output/fd_stacked_w3.eps not found)
(file ../output/fd_stacked_w3.eps written in EPS format)
(22 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note: file ../output/fd_stacked_w9.png not found)
(file ../output/fd_stacked_w9.png written in PNG format)
(note: file ../output/fd_stacked_w9.eps not found)
(file ../output/fd_stacked_w9.eps written in EPS format)

. 
end of do-file

 make.py ended: 2021-11-11 07:23:40
