
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ".\figures.do" 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     local instub "../../fd_baseline/output"
  2.     
.     use "`instub'/estimates_dynamic.dta", replace
  3.     make_bounds
  4.     
.     local exp_ln_mw_var "exp_ln_mw_17"
  5.     sum at
  6.     local w = r(max)
  7.     
.     plot_dynamics, model(ln_mw_only_dynamic) var(ln_mw) ///
>         legend_var(Residence MW) ///
>         color(maroon) symbol(square) ///
>         name(fd_ln_mw_only_dynamic)
  8.         
.     plot_dynamics, model(`exp_ln_mw_var'_only_dynamic) var(`exp_ln_mw_var') /
> //
>         legend_var(Workplace MW) ///
>         color(navy) symbol(circle) ///
>         name(fd_`exp_ln_mw_var'_only_dynamic)
  9.     
.     offset_x_axis
 10. 
.     plot_dynamics_both, model(baseline_`exp_ln_mw_var'_dynamic) dyn_var(`exp_
> ln_mw_var') ///
>         legend_dyn_var(Workplace MW) ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce) ///
>         stat_var(ln_mw) legend_stat_var(Residence MW) ///
>         color_stat_var(maroon) symbol_stat_var(square) ///
>         name(fd_baseline_`exp_ln_mw_var'_dynamic)
 11.         
.     plot_dynamics_both, model(both_ln_mw_dynamic) dyn_var(ln_mw) ///
>         legend_dyn_var(Residence MW) ///
>         color_dyn_var(maroon) symbol_dyn_var(square) ///
>         stat_var(`exp_ln_mw_var') legend_stat_var(Workplace MW) ///
>         color_stat_var(navy) symbol_stat_var(circle) ///
>         name(fd_both_ln_mw_dynamic)
 12. end

. 
. program make_bounds
  1.     gen b_lb = b - 1.96*se
  2.     gen b_ub = b + 1.96*se
  3. end

. 
. program offset_x_axis
  1.     gen at_r = at + 0.15
  2.     gen at_l = at - 0.15
  3. end

. 
. program plot_dynamics
  1.     syntax, model(str) var(str) ///
>         legend_var(str) color(str) symbol(str) ///
>         name(str)
  2.         
.     preserve
  3.         keep if model == "`model'"
  4.         twoway (scatter b       at if var == "`var'", mcol(`color') msymbo
> l(`symbol')) ///
>                 (rcap b_lb b_ub at if var == "`var'", lcol(`color') lw(thin))
>           ///
>                 (line b         at if var == "cumsum_from0", col(`color'))   
>           ///
>                 (line b_lb      at if var == "cumsum_from0",                 
>           ///
>                     col(`color') lw(thin) lp(dash))                          
>           ///
>                 (line b_ub      at if var == "cumsum_from0",                 
>           ///
>                     col(`color') lw(thin) lp(dash)),                         
>           ///
>             yline(0, lcol(black))                                            
>           ///
>             xlabel(-6(1)6, labsize(small)) xtitle("")                        
>           ///
>             ylabel(-0.06(0.02).16, grid labsize(small)) ytitle("Coefficient")
>           ///
>             legend(order(1 `"`legend_var'"' 3 "Cumulative sum"))             
>           ///
>             graphregion(color(white)) bgcolor(white)
  5.         
.         graph export "../output/`name'.png", replace
  6.         graph export "../output/`name'.eps", replace
  7.     restore
  8. end

. 
. program plot_dynamics_both
  1.     syntax, model(str) dyn_var(str) stat_var(str) ///
>         legend_dyn_var(str) color_dyn_var(str) symbol_dyn_var(str) ///
>         legend_stat_var(str) color_stat_var(str) symbol_stat_var(str) ///
>         name(str)
  2.         
.     preserve
  3.         keep if model == "`model'"
  4.         twoway  (scatter b      at_r if var == "`dyn_var'" & at == 0,     
>       ///
>                      mcol(`color_dyn_var') msymbol(`symbol_dyn_var'))        
>    ///
>                 (scatter b      at   if var == "`dyn_var'" & at != 0,        
>    ///
>                      mcol(`color_dyn_var') msymbol(`symbol_dyn_var'))        
>    ///
>                 (rcap b_lb b_ub at_r if var == "`dyn_var'" & at == 0,        
>    ///
>                     lcol(`color_dyn_var') lw(thin))                          
>    ///
>                 (rcap b_lb b_ub at   if var == "`dyn_var'" & at != 0,        
>    ///
>                     lcol(`color_dyn_var') lw(thin))                          
>    ///
>                 (scatter b      at_l if var == "`stat_var'",                 
>    ///
>                     mcol(`color_stat_var') msymbol(`symbol_stat_var'))       
>    ///
>                 (rcap b_lb b_ub at_l if var == "`stat_var'",                 
>    ///
>                     col(`color_stat_var') lw(thin))                          
>    ///
>                 (line b at      if var == "cumsum_from0", col(`color_dyn_var'
> )) ///
>                 (line b_lb at   if var == "cumsum_from0",                    
>    ///
>                     col(`color_dyn_var') lw(thin) lp(dash))                  
>    ///
>                 (line b_ub at   if var == "cumsum_from0",                    
>    ///
>                     col(`color_dyn_var') lw(thin) lp(dash)),                 
>    ///
>             yline(0, lcol(black))                                            
>    ///
>             xlabel(-6(1)6, labsize(small)) xtitle("")                        
>    ///
>             ylabel(-0.06(0.02).16, grid labsize(small)) ytitle("Coefficient")
>    ///
>             legend(order(1 `"`legend_dyn_var'"' 5 `"`legend_stat_var'"'      
>    ///
>                 7 "Cumulative sum"))                                         
>    ///
>             graphregion(color(white)) bgcolor(white)
  5.         
.         graph export "../output/`name'.png", replace
  6.         graph export "../output/`name'.eps", replace
  7.     restore
  8. end

. 
. 
. main

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          at |         86    .9302326    3.466786         -6          6
(65 observations deleted)
(file ../output/fd_ln_mw_only_dynamic.png written in PNG format)
(file ../output/fd_ln_mw_only_dynamic.eps written in EPS format)
(65 observations deleted)
(file ../output/fd_exp_ln_mw_17_only_dynamic.png written in PNG format)
(file ../output/fd_exp_ln_mw_17_only_dynamic.eps written in EPS format)
(64 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(file ../output/fd_baseline_exp_ln_mw_17_dynamic.png written in PNG format)
(file ../output/fd_baseline_exp_ln_mw_17_dynamic.eps written in EPS format)
(64 observations deleted)
(file ../output/fd_both_ln_mw_dynamic.png written in PNG format)
(file ../output/fd_both_ln_mw_dynamic.eps written in EPS format)

. 
end of do-file
