
 make.py started: 2022-05-19 08:46:11 C:\Users\diegog\Desktop\Diego\min_wage_rent\descriptive\zillow_benchmark\code 




Execute:  StataMP-64 /e do "./compare_zillow_zipcode.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./compare_zillow_zipcode.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000 


. 
. program main 
  1.     local instub_zillow "../../../drive/derived_large/estimation_samples"
  2.     local instub_safmr "../../../base/safmr/output"
  3.     local logfile "../output/data_file_manifest.log"
  4.     
.     import delim "../../../drive/raw_data/cpi2012/cpi2012_usa.csv", clear  
  5.     replace cpi2012 = cpi2012 /100
  6.     save ../temp/cpi2012.dta, replace
  7.     
.     use "`instub_safmr'/safmr_2017_2019_by_zipcode_cbsa.dta", clear
  8.     collapse (sum) safmr1br safmr2br safmr3br safmr4br, ///
>         by(zipcode year)
  9.     save "../temp/safmr_2017_2019.dta", replace
 10.     
.     use "`instub_safmr'/safmr_2012_2016_by_zipcode_county_cbsa.dta", clear
 11.     collapse (sum) safmr1br safmr2br safmr3br safmr4br, ///
>         by(zipcode year)
 12.     append using "../temp/safmr_2017_2019.dta"
 13.     save "../temp/safmr.dta", replace
 14. 
.     compare_zillow_safmr_zipcode, inzillow(`instub_zillow') ///
>         mlist(1)
 15. end

. 
. program compare_zillow_safmr_zipcode
  1.     syntax, inzillow(str) mlist(str)
  2.     
.     use zipcode place_code cbsa countyfips statefips ///
>         year_month medrentprice_SFCC ///
>         using "`inzillow'/zipcode_months.dta"
  3. 
.     g rmtag = (medrentprice_SFCC == .)
  4.     bys zipcode (year_month): g ziplen = _N
  5.     bys zipcode (year_month): gegen rmcount = sum(rmtag)
  6.     g sample_SFCC = (ziplen != rmcount)
  7.     drop ziplen rmtag rmcount
  8. 
.     unab samplist: sample_*
  9.     gegen allmis = rowtotal(`samplist')
 10.     drop if allmis==0 
 11.     drop allmis 
 12.     g year = yofd(dofm(year_month))
 13.     keep if inrange(year, 2010, 2019)
 14. 
.     foreach m in `mlist' {
 15.         preserve
 16.         g month = month(dofm(year_month))
 17. 
.         keep if month == `m'
 18.         merge 1:1 zipcode year using "../temp/safmr.dta"    
 19. 
. 
.         unab safmrvars: safmr*
 20.         collapse (mean)  medrentprice_SFCC `safmrvars', by(year)
 21. 
.         merge 1:1 year using "../temp/cpi2012.dta", nogen keep(1 3)
 22.         foreach v in medrentprice_SFCC {
 23.             replace `v' = `v'/cpi2012
 24.         }
 25. 
.         twoway (line medrentprice_SFCC year, lc(eltblue))            ///
>                (line safmr2br year, lp(dash) lc(gs11))               ///
>                (line safmr3br year, lp(dash) lc(lavender))           ///
>                (line safmr4br year, lp(dash) lc(black)),             ///
>             legend(order(1 "Zillow SFCC" 2 "SAFMR 2br"               ///
>                          3 "SAFMR 3br" 4 "SAFMR 4br") cols(2))       ///
>             ylabel(, grid labsize(small)) ytitle("Rent (2012 $)",    ///
>                                                  size(medsmall))     ///
>             xlabel(, labsize(small))      xtitle(, size(medsmall))   ///
>             graphregion(color(white)) bgcolor(white)
 26.         graph export ../output/trend_zillow_safmr_zipcode_m`m'.png, ///
>             replace height(650) width(900)
 27.         graph export ../output/trend_zillow_safmr_zipcode_m`m'.eps, ///
>             replace
 28. 
.         twoway (line medrentprice_SFCC year, lc(eltblue))           ///
>                (line safmr3br year, lp(dash) lc(black)),            ///
>             legend(order(1 "Zillow SFCC" 2 "SAFMR 3br") cols(2))    ///
>             ylabel(, grid labsize(small)) ytitle("Rent (2012 $)",   ///
>                                                  size(medsmall))    ///
>             xlabel(, labsize(small))      xtitle(, size(medsmall))  ///
>             graphregion(color(white)) bgcolor(white)
 29.         graph export "../output/trend_zillow_safmr3br_zipcode_m`m'.png", /
> //
>             replace height(650) width(900)
 30.         graph export "../output/trend_zillow_safmr3br_zipcode_m`m'.eps", /
> //
>             replace
 31.         restore    
 32.     }
 33. end

. 
. 
. main 
(2 vars, 10 obs)
(10 real changes made)
(note: file ../temp/cpi2012.dta not found)
file ../temp/cpi2012.dta saved
(note: file ../temp/safmr_2017_2019.dta not found)
file ../temp/safmr_2017_2019.dta saved
(note: file ../temp/safmr.dta not found)
file ../temp/safmr.dta saved
performance warning: -by- prefix may be slower than -by()-
rowtotal() is not a gtools function and no by(); falling back on egen
(54,670 observations deleted)
(0 observations deleted)
(215,746 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                       162,738
        from master                     1,241  (_merge==1)
        from using                    161,497  (_merge==2)

    matched                            16,733  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                10  
    -----------------------------------------
(8 real changes made)
(note: file ../output/trend_zillow_safmr_zipcode_m1.png not found)
(file ../output/trend_zillow_safmr_zipcode_m1.png written in PNG format)
(note: file ../output/trend_zillow_safmr_zipcode_m1.eps not found)
(file ../output/trend_zillow_safmr_zipcode_m1.eps written in EPS format)
(note: file ../output/trend_zillow_safmr3br_zipcode_m1.png not found)
(file ../output/trend_zillow_safmr3br_zipcode_m1.png written in PNG format)
(note: file ../output/trend_zillow_safmr3br_zipcode_m1.eps not found)
(file ../output/trend_zillow_safmr3br_zipcode_m1.eps written in EPS format)

. 
end of do-file

 make.py ended: 2022-05-19 08:46:18
