
 make.py started: 2022-03-18 22:11:41 C:\Users\Usuario\Documents\GitHub\min_wage_rent\analysis\autocorrelation\code 




Execute:  StataMP-64 /e do "./autocorrelation.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      Downloadly.ir     
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata network license expires 20 Aug 2022:
       Serial number:  501609213901
         Licensed to:  DOWNLOADLY.IR 085227746673
                       WwW.DownLoadLy.iR 085227746673

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./autocorrelation.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata\Stata16\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata\Stata16\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\Usuario\ado\personal/"
  [5]  (PLUS)      "C:\Users\Usuario\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata\Stata16\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata\Stata16\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\Usuario\ado\personal/"
  [5]  (PLUS)      "C:\Users\Usuario\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main 
  1. 
.         local instub "../../../drive/derived_large/estimation_samples"
  2.         local outstub "../output"
  3. 
.         local controls "`r(economic_controls)'"
  4. 
.         use "`instub'/zipcode_months", clear
  5.         keep if baseline_sample
  6. 
.         gen ln_medrents = log(medrentpricepsqft_SFCC)
  7. 
.         xtset zipcode_num year_month
  8. 
.         reghdfe D.ln_medrents D.mw_res D.mw_wkp_tot_17 `controls',      ///
>                         absorb(year_month)      ///
>                         vce(cluster statefips) nocons residuals(fd_res)
  9.         
.         reg fd_res L.fd_res, cluster(statefips)
 10.         test (L.fd_res = -0.5) 
 11.         scalar p_val_auto = r(p)
 12. 
.         estimate_stacked_model, depvar(ln_medrents)  ///
>         mw_var1(mw_res) mw_var2(mw_wkp_tot_17) controls(`controls') ///
>         absorb(year_month zipcode) cluster(statefips) ///
>         model_name(levels_model) outfolder("../temp")
 13. 
.         estimate_dist_lag_model, depvar(ln_medrents) ///
>         dyn_var(mw_wkp_tot_17) w(0) stat_var(mw_res) ///
>         controls(`controls') absorb(year_month) cluster(statefips) ///
>         model_name(baseline_model) outfolder("../temp")
 14.                 
.         use ../temp/estimates_levels_model.dta, clear
 15.         append using ../temp/estimates_baseline_model.dta
 16. 
.         gen p_val = .
 17.         replace p_val = p_val_auto if model == "baseline_model"
 18.          
.         export delimited `outstub'/estimates_autocorrelation.csv, replace
 19. end

. 
. main
(64,239 observations deleted)
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    132,178
Absorbing 1 HDFE group                            F(   2,     39) =       2.17
Statistics robust to heteroskedasticity           Prob > F        =     0.1277
                                                  R-squared       =     0.0207
                                                  Adj R-squared   =     0.0198
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0290

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
 ln_medrents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0176755   .0172566    -1.02   0.312    -.0525804    .0172293
             |
mw_wkp_to~17 |
         D1. |   .0509891   .0289321     1.76   0.086    -.0075316    .1095098
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+

Linear regression                               Number of obs     =    130,834
                                                F(1, 39)          =    1603.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0558
                                                Root MSE          =     .02808

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
      fd_res |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      fd_res |
         L1. |  -.2349725    .005868   -40.04   0.000    -.2468417   -.2231034
             |
       _cons |  -.0000109   .0002142    -0.05   0.960    -.0004443    .0004224
------------------------------------------------------------------------------

 ( 1)  L.fd_res = -.5

       F(  1,    39) = 2039.87
            Prob > F =    0.0000
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =    133,522
Absorbing 2 HDFE groups                           F(   2,     39) =       0.10
Statistics robust to heteroskedasticity           Prob > F        =     0.9050
                                                  R-squared       =     0.9881
                                                  Adj R-squared   =     0.9880
                                                  Within R-sq.    =     0.0014
Number of clusters (statefips) =         40       Root MSE        =     0.0505

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
 ln_medrents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |    .102548   .2355045     0.44   0.666    -.3738047    .5789007
mw_wkp_to~17 |  -.0870658   .2288403    -0.38   0.706     -.549939    .3758073
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       119           0         119     |
     zipcode |      1344        1344           0    *|
-----------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation

 ( 1)  mw_res - mw_wkp_tot_17 = 0

       F(  1,    39) =    0.17
            Prob > F =    0.6814
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
file ../temp/estimates.dta saved

 ( 1)  mw_res + mw_wkp_tot_17 = 0

------------------------------------------------------------------------------
 ln_medrents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0154822   .0746874     0.21   0.837    -.1355873    .1665517
------------------------------------------------------------------------------
number of observations will be reset to 1
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 1
(note: file ../temp/estimates_cumsum_from0.dta not found)
file ../temp/estimates_cumsum_from0.dta saved
(133,520 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str6 now str13
(1 real change made)
(2 real changes made)
(note: variable at was byte, now float to accommodate using data's values)
(note: file ../temp/estimates_levels_model.dta not found)
file ../temp/estimates_levels_model.dta saved
(note: file ../temp/estimates_levels_model.csv not found)
file ../temp/estimates_levels_model.csv saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    132,178
Absorbing 1 HDFE group                            F(   2,     39) =       2.17
Statistics robust to heteroskedasticity           Prob > F        =     0.1277
                                                  R-squared       =     0.0207
                                                  Adj R-squared   =     0.0198
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         40       Root MSE        =     0.0290

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
 ln_medrents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp_to~17 |
         D1. |   .0509891   .0289321     1.76   0.086    -.0075316    .1095098
             |
      mw_res |
         D1. |  -.0176755   .0172566    -1.02   0.312    -.0525804    .0172293
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
file ../temp/estimates.dta saved
(133,520 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(2 real changes made)
(1 real change made)
(note: file ../temp/estimates_baseline_model.dta not found)
file ../temp/estimates_baseline_model.dta saved

 ( 1)  D.mw_wkp_tot_17 + D.mw_res = 0

------------------------------------------------------------------------------
D.           |
 ln_medrents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0333135   .0159954     2.08   0.044     .0009597    .0656674
------------------------------------------------------------------------------
number of observations will be reset to 1
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 1
(note: file ../temp/estimates_baseline_model_sumsum_from0.dta not found)
file ../temp/estimates_baseline_model_sumsum_from0.dta saved
(note: variable at was byte, now float to accommodate using data's values)
file ../temp/estimates_baseline_model.dta saved
(note: file ../temp/estimates_baseline_model.csv not found)
file ../temp/estimates_baseline_model.csv saved
(note: variable model was str12, now str14 to accommodate using data's
       values)
(6 missing values generated)
(3 real changes made)
(note: file ../output/estimates_autocorrelation.csv not found)
file ../output/estimates_autocorrelation.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./table.R" table.Rout

R version 4.1.2 (2021-11-01) -- "Bird Hippie"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R es un software libre y viene sin GARANTIA ALGUNA.
Usted puede redistribuirlo bajo ciertas circunstancias.
Escriba 'license()' o 'licence()' para detalles de distribucion.

R es un proyecto colaborativo con muchos contribuyentes.
Escriba 'contributors()' para obtener más información y
'citation()' para saber cómo citar R o paquetes de R en publicaciones.

Escriba 'demo()' para demostraciones, 'help()' para el sistema on-line de ayuda,
o 'help.start()' para abrir el sistema de ayuda HTML con su navegador.
Escriba 'q()' para salir de R.

> remove(list = ls())
> 
> library(data.table)
> 
> main <- function() {
+   instub <- "../output"
+   outstub <- "../output/"
+   
+   est <- fread(file.path(instub, "estimates_autocorrelation.csv"))
+   est_var <- est[var != "cumsum_from0"]
+   
+   txt <- c("<tab:static>")
+   
+   txt <- c(txt, 
+            paste(est_var[model == "levels_model" & var == "mw_res"]$b, 
+                  est_var[model == "baseline_model" & var == "mw_res"]$b, sep = "\t"), 
+            paste(est_var[model == "levels_model" & var == "mw_res"]$se, 
+                  est_var[model == "baseline_model" & var == "mw_res"]$se, sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est_var[model == "levels_model" & var == "mw_wkp_tot_17"]$b, 
+                  est_var[model == "baseline_model" & var == "mw_wkp_tot_17"]$b, sep = "\t"), 
+            paste(est_var[model == "levels_model" & var == "mw_wkp_tot_17"]$se,
+                  est_var[model == "baseline_model" & var == "mw_wkp_tot_17"]$se, sep = "\t"))
+   
+   txt <- c(txt, paste(format(round(est_var[model == "baseline_model" & var == "mw_res"]$p_val),nsmall=3)))
+   
+   txt <- c(txt, paste(est_var[model == "levels_model" & var == "mw_res"]$N, 
+                       est_var[model == "baseline_model" & var == "mw_res"]$N, sep = "\t"))
+   
+   fileConn <- file(file.path(outstub, "autocorrelation.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.26    0.07    0.32 

 make.py ended: 2022-03-18 22:11:51
