
 make.py started: 2021-10-02 17:17:35 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local in_baseline "../../../drive/derived_large/estimation_samples
> "
  2.         local in_zip_year "../../../drive/derived_large/zipcode_year"
  3. 
.         local outstub "../output"
  4.         
.         define_controls
  5.         local controls "`r(economic_controls)'"
  6.         local cluster "statefips"
  7.         
.         ** STATIC
.         load_and_clean, in_baseline(`in_baseline') ///
>             in_zip_year(`in_zip_year')
  8. 
.         xtset zipcode_num year_month
  9.         eststo clear
 10.         foreach var in under29 under1250 underHS {
 11.         eststo: reghdfe D.ln_med_rent_var D.ln_mw D.ln_mw_times_wrkpl_`var
> ' ///
>              D.exp_ln_mw_17 D.exp_ln_mw_17_int_res_`var', nocons ///
>                 absorb(year_month) cluster(statefips)   
 12.         }
 13.     esttab *, se r2
 14. end

. 
. 
. program load_and_clean
  1.     syntax, in_baseline(str) in_zip_year(str)
  2. 
.         use "`in_baseline'/baseline_zipcode_months.dta", clear
  3.         merge m:1 zipcode year using "`in_zip_year'/zipcode_year.dta", ///
>             nogen keep(3) keepusing (res_* wrkpl_*)
  4.         
.         xtset zipcode_num year_month
  5.                 
.         foreach var in under29 under1250 underHS {
  6.             bys statefips: egen sh_res_`var'_med  = median(res_`var')
  7.             bys statefips: egen sh_wrkpl_`var'_med = median(wrkpl_`var')  
>       
  8.             
.                 gen sh_res_`var'_above_med_st    = (res_`var'   > sh_res_`var
> '_med)
  9.             gen sh_wrkpl_`var'_above_med_st  = (wrkpl_`var' > sh_wrkpl_`va
> r'_med)
 10.             drop *_med
 11.                 
.             gen ln_mw_times_wrkpl_`var'    = ln_mw*sh_wrkpl_`var'_above_med_s
> t
 12.             gen exp_ln_mw_17_int_res_`var' = exp_ln_mw_17*sh_res_`var'_abo
> ve_med_st
 13.         }
 14. end

. 
. 
. main

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           161,400  
    -----------------------------------------
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(120 missing values generated)
(120 missing values generated)
(120 missing values generated)
(120 missing values generated)
(120 missing values generated)
(120 missing values generated)
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    132,255
Absorbing 1 HDFE group                            F(   4,     40) =       1.94
Statistics robust to heteroskedasticity           Prob > F        =     0.1228
                                                  R-squared       =     0.0208
                                                  Adj R-squared   =     0.0199
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         41       Root MSE        =     0.0291

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |  -.0290118   .0171085    -1.70   0.098    -.0635893    .0055657
             |
ln_mw_tim~29 |
         D1. |  -.0002871    .000519    -0.55   0.583    -.0013361    .0007619
             |
exp_ln_mw_17 |
         D1. |   .0635033   .0280971     2.26   0.029      .006717    .1202895
             |
exp_ln_mw~29 |
         D1. |   .0001639   .0004373     0.37   0.710    -.0007199    .0010478
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    132,255
Absorbing 1 HDFE group                            F(   4,     40) =       2.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0496
                                                  R-squared       =     0.0208
                                                  Adj R-squared   =     0.0199
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         41       Root MSE        =     0.0291

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |  -.0285272   .0170721    -1.67   0.103    -.0630312    .0059767
             |
ln_mw_t~1250 |
         D1. |  -.0002252   .0005397    -0.42   0.679    -.0013159    .0008655
             |
exp_ln_mw_17 |
         D1. |   .0632258   .0276252     2.29   0.027     .0073932    .1190583
             |
exp_ln_~1250 |
         D1. |  -.0006086   .0003733    -1.63   0.111     -.001363    .0001458
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    132,255
Absorbing 1 HDFE group                            F(   4,     40) =       2.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0723
                                                  R-squared       =     0.0208
                                                  Adj R-squared   =     0.0199
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         41       Root MSE        =     0.0291

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |  -.0291064    .017022    -1.71   0.095    -.0635091    .0052962
             |
ln_mw_time~S |
         D1. |   .0003461   .0003413     1.01   0.317    -.0003437     .001036
             |
exp_ln_mw_17 |
         D1. |   .0631701   .0280683     2.25   0.030     .0064419    .1198983
             |
exp_ln_mw_~S |
         D1. |  -.0001069   .0004757    -0.22   0.823    -.0010684    .0008546
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(est3 stored)

------------------------------------------------------------
                      (1)             (2)             (3)   
             D.ln_med_r~r    D.ln_med_r~r    D.ln_med_r~r   
------------------------------------------------------------
D.ln_mw           -0.0290         -0.0285         -0.0291   
                 (0.0171)        (0.0171)        (0.0170)   

D.ln_mw_t~29    -0.000287                                   
               (0.000519)                                   

D.exp_l~w_17       0.0635*         0.0632*         0.0632*  
                 (0.0281)        (0.0276)        (0.0281)   

D.exp_ln_~29     0.000164                                   
               (0.000437)                                   

D.ln_mw~1250                    -0.000225                   
                               (0.000540)                   

D.exp_l~1250                    -0.000609                   
                               (0.000373)                   

D.ln_mw_ti~S                                     0.000346   
                                               (0.000341)   

D.exp_ln_m~S                                    -0.000107   
                                               (0.000476)   
------------------------------------------------------------
N                  132255          132255          132255   
R-sq                0.021           0.021           0.021   
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
end of do-file

 make.py ended: 2021-10-02 17:17:47
