
 make.py started: 2022-05-03 09:41:17 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local incross "../../../drive/derived_large/zipcode"
  3.     local in_hud "../../../drive/base_large/hud_housing_assistance"
  4.     local outstub "../temp"
  5. 
.     use "`in_hud'/zipcode.dta", clear
  6.     keep if program_label == "Public Housing"
  7.     keep if year == 2017
  8.     keep zipcode total_units
  9.     save_data "`outstub'/public_housing_2017.dta", ///
>         key(zipcode) replace log(none)
 10. 
.     load_and_clean, instub(`instub') incross(`incross')
 11.     gen high_res_mw = sh_res_underHS_above_med*sh_res_under1250_above_med
 12.     gen high_work_mw = sh_workers_underHS_above_med*sh_workers_under1250_a
> bove_med
 13. 
.     merge m:1 zipcode using "`outstub'/public_housing_2017.dta", ///
>         nogen keep(1 3)
 14.     gen public_housing = (total_units > 0) if !missing(total_units)
 15.     replace public_housing = 0 if missing(total_units)
 16. 
.     save_data "`outstub'/fullbal_sample_with_vars_for_het.dta", ///
>         key(zipcode year_month) replace log(none)
 17. end

. 
. 
. program load_and_clean
  1.     syntax, instub(str) incross(str)
  2. 
.     define_controls
  3.     local controls     "`r(economic_controls)'"
  4. 
.     use zipcode statefips cbsa year_month zipcode_num ln_rents mw_res ///
>         mw_wkp_tot_17 fullbal_sample_SFCC `controls' ///
>         using "`instub'/zipcode_months.dta" if fullbal_sample_SFCC, clear
  5.     drop fullbal_sample_SFCC
  6.     xtset zipcode_num year_month
  7. 
.     merge m:1 zipcode using "`incross'/zipcode_cross.dta", nogen ///
>         keep(3) keepusing(sh_mw_wkrs_statutory sh_workers_under29_2013 ///
>         sh_residents_under29_2013 sh_residents_underHS_2013 ///
>         sh_residents_under1250_2013 sh_workers_underHS_2013 ///
>         sh_workers_under1250_2013 sh_residents_accomm_food_2013 ///
>         sh_workers_accomm_food_2013)
  8.     rename *_2013 *
  9.     rename *residents* *res*
 10. 
.     foreach var in sh_mw_wkrs_statutory sh_workers_accomm_food ///
>         sh_workers_underHS sh_res_accomm_food sh_res_underHS ///
>         sh_res_under1250 sh_workers_under1250 {
 11.         bys statefips: egen `var'_med = median(`var')
 12.         gen `var'_above_med = (`var'   > `var'_med)
 13.         drop `var'_med
 14. 
.         gen resint_`var' = mw_res*`var'_above_med
 15.         gen wkpint_`var' = mw_wkp_tot_17*`var'_above_med
 16.     }
 17. end

. 
. 
. main
(310,972 observations deleted)
(24,164 observations deleted)
(data now sorted by zipcode)
  variable total_units was double now int
  (37,974 bytes saved)
===============================================================================
File: ../temp/public_housing_2017.dta
Key: zipcode
===============================================================================
  6329:2(60726):1417201667:2500064492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
 total_units |      6,329    164.4508    388.0311          0      10966




(note: file ../temp/public_housing_2017.dta not found)
file ../temp/public_housing_2017.dta saved
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m1 to 2019m12, but with gaps
                delta:  1 month

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           169,767  
    -----------------------------------------
(1101 missing values generated)
(27 missing values generated)
(27 missing values generated)
(27 missing values generated)
(27 missing values generated)
(27 missing values generated)
(27 missing values generated)
(27 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                       103,671
        from master                   103,671  
        from using                          0  

    matched                            66,096  
    -----------------------------------------
(103,671 missing values generated)
(103,671 real changes made)
(data now sorted by zipcode year_month)
  variable sh_mw_wkrs_statutory_above_med was float now byte
  variable sh_workers_accomm_food_above_med was float now byte
  variable sh_workers_underHS_above_med was float now byte
  variable sh_res_accomm_food_above_med was float now byte
  variable sh_res_underHS_above_med was float now byte
  variable sh_res_under1250_above_med was float now byte
  variable sh_workers_under1250_above_med was float now byte
  variable high_res_mw was float now byte
  variable high_work_mw was float now byte
  variable public_housing was float now byte
  (5,093,010 bytes saved)
===============================================================================
File: ../temp/fullbal_sample_with_vars_for_het.dta
Key: zipcode year_month
===============================================================================
  169767:51(68190):609725537:1658719605

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |    169,767    683.8908     26.0572        600        719
 zipcode_num |    169,767    52531.26    30991.37       1060      99705
   statefips |          0
        cbsa |          0
-------------+---------------------------------------------------------
      mw_res |    169,767     2.15152    .1803797   1.981001   2.772589
mw_wkp_to~17 |    169,740    2.154257    .1743137   1.981001   2.694807
    ln_rents |     79,355    .1382903    .4705438  -.7630667   3.100092
ln_emp_biz~v |    169,761    11.12367    1.365044   5.575949   13.38876
 ln_emp_info |    168,839    9.026474     1.57939   2.397895   12.38988
-------------+---------------------------------------------------------
  ln_emp_fin |    169,751    10.17874    1.391722   3.044523   12.89542
ln_estcoun~v |    169,767     8.61997    1.233624   1.098612   10.96353
ln_estcoun~o |    169,761    6.097871    1.373436          0   9.531191
ln_estcoun~n |    169,767     7.92518    1.197428    1.94591   10.33748
ln_avgwwag~v |    169,761     7.16725    .3111125   5.420535   9.135509
-------------+---------------------------------------------------------
ln_avgwwag~o |    168,839    7.348603    .3687912   5.891644   9.584453
ln_avgwwag~n |    169,751     7.32874    .3652629   6.293419   9.163982
sh_mw_wkrs~y |    159,829    .1476203    .0503619          0   .5496104
sh_res_un~29 |    169,740    .2264907    .0405204          0   .4475389
sh_res_~1250 |    169,740    .2305316    .0482118          0   .4304474
-------------+---------------------------------------------------------
sh_res_und~S |    169,740    .0966068    .0341883          0    .267153
sh_res_ac~od |    169,740    .0991494    .0401881          0          1
sh_worker~29 |    169,767    .2382449    .0509657   .0878358   .4709218
sh_work~1250 |    169,767    .2660073    .0814622    .029254   .6991277
sh_workers~S |    169,767    .1030457    .0354747   .0319356   .3313758
-------------+---------------------------------------------------------
sh_worker~od |    169,767    .1122733    .0712552          0   .8823267
sh_mw_wkrs~d |    169,767     .520914    .4995639          0          1
resint_sh_~y |    169,767    1.121902    1.083887          0   2.772589
wkpint_sh_~y |    169,740    1.122204    1.083863          0   2.691215
sh_workers.. |    169,767    .4985716    .4999994          0          1
-------------+---------------------------------------------------------
resint_sh_.. |    169,767    1.072502    1.083047          0   2.772589
wkpint_sh_.. |    169,740     1.07378    1.083642          0   2.694137
sh_workers.. |    169,767    .4995965    .5000013          0          1
r~rs_underHS |    169,767    1.076558    1.085281          0   2.772589
w~rs_underHS |    169,740    1.077993    1.085958          0   2.691215
-------------+---------------------------------------------------------
sh_res_ac~ed |    169,767    .4978588    .4999969          0          1
resint_sh_.. |    169,767    1.071825    1.084074          0   2.772589
wkpint_sh_.. |    169,740    1.071694    1.083499          0   2.694807
sh_res_und.. |    169,767    .5016228    .4999988          0          1
r~es_underHS |    169,767    1.080314    1.084526          0   2.772589
-------------+---------------------------------------------------------
w~es_underHS |    169,740    1.081049    1.084928          0   2.691215
sh_res_und.. |    169,767    .4988484    .5000001          0          1
resint_sh_.. |    169,767    1.074605    1.084655          0   2.772589
wkpint_sh_.. |    169,740    1.074806    1.084597          0   2.691215
sh_workers.. |    169,767    .5024769    .4999953          0          1
-------------+---------------------------------------------------------
resint_sh_.. |    169,767    1.081739     1.08399          0   2.772589
wkpint_sh_.. |    169,740    1.083097    1.084752          0   2.691215
 high_res_mw |    169,767    .3579023    .4793846          0          1
high_work_mw |    169,767    .2943623    .4557569          0          1
 total_units |     66,096    258.9212    550.7862          0      10966
-------------+---------------------------------------------------------
public_hou~g |    169,767    .3881202    .4873236          0          1




(note: file ../temp/fullbal_sample_with_vars_for_het.dta not found)
file ../temp/fullbal_sample_with_vars_for_het.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.     local instub  "../temp"
  2.     local outstub "../output"
  3. 
.     define_controls
  4.     local controls     "`r(economic_controls)'"
  5.     local cluster_vars "statefips"
  6.     local absorb "year_month"
  7. 
.     use "`instub'/fullbal_sample_with_vars_for_het.dta", clear
  8.     xtset zipcode_num year_month
  9. 
.     estimate_dist_lag_model, depvar(ln_rents) ///
>         dyn_var(mw_wkp_tot_17) w(0) stat_var(mw_res) ///
>         controls(`controls') absorb(`absorb') cluster(`cluster_vars') ///
>         model_name(static_both)
 10.         
.     reghdfe D.ln_rents c.D.mw_res#ib0.high_work_mw ///
>         c.D.mw_wkp_tot_17#ib0.high_res_mw ///
>         D.(`controls'), nocons ///
>         absorb(`absorb'##high_work_mw##high_res_mw) ///
>         cluster(`cluster_vars')
 11.     process_estimates, res_var(mw_res_high_work_mw) ///
>         wkp_var(mw_wkp_high_res_mw) model(het_mw_shares)
 12. 
.     reghdfe D.ln_rents c.D.mw_res#ib0.public_housing ///
>         c.D.mw_wkp_tot_17#ib0.public_housing ///
>         D.(`controls'), nocons ///
>         absorb(year_month##public_housing) cluster(`cluster_vars')
 13.     process_estimates, res_var(mw_res_high_public_hous) ///
>         wkp_var(mw_wkp_high_public_hous) model(het_public_hous)
 14. 
.     use "../temp/estimates_static_both.dta", clear
 15.     append using "../temp/estimates_het_mw_shares.dta"
 16.     append using "../temp/estimates_het_public_hous.dta"
 17.     export delimited "../temp/estimates_het.csv", replace
 18. end

. 
. program process_estimates
  1.     syntax, res_var(str) wkp_var(str) model(str)
  2. 
.     preserve
  3.         local N = e(N)
  4.         local r2 = e(r2)
  5. 
.         qui coefplot, vertical base gen
  6.         keep __at __b __se
  7.         rename (__at __b __se) (at b se)
  8.         keep if _n <= 4
  9.         keep if !missing(at)
 10.         replace at = 0
 11.         replace at = 1 if inlist(_n, 2, 4)
 12.         gen var     = "`res_var'"  
 13.         replace var = "`wkp_var'" if _n >= 3
 14.         gen N = `N'
 15.         gen r2 = `r2'
 16.         gen model = "`model'"
 17. 
.         save "../temp/estimates_`model'.dta", replace
 18.     restore
 19. end

. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m1 to 2019m12, but with gaps
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     77,567
Absorbing 1 HDFE group                            F(  11,     40) =       3.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0013
                                                  R-squared       =     0.0216
                                                  Adj R-squared   =     0.0208
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0297

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp_to~17 |
         D1. |   .0682528   .0306608     2.23   0.032     .0062849    .1302206
             |
      mw_res |
         D1. |  -.0201556   .0200408    -1.01   0.321    -.0606595    .0203484
             |
ln_emp_biz~v |
         D1. |   .0185599   .0085991     2.16   0.037     .0011805    .0359393
             |
 ln_emp_info |
         D1. |   .0022322    .004402     0.51   0.615    -.0066647    .0111291
             |
  ln_emp_fin |
         D1. |   .0112185   .0077973     1.44   0.158    -.0045404    .0269773
             |
ln_estcoun~v |
         D1. |   .0125664   .0176318     0.71   0.480    -.0230687    .0482015
             |
ln_estcoun~o |
         D1. |   .0036026   .0088281     0.41   0.685    -.0142397    .0214448
             |
ln_estcoun~n |
         D1. |  -.0124931   .0194276    -0.64   0.524    -.0517577    .0267714
             |
ln_avgwwag~v |
         D1. |   .0024476   .0041605     0.59   0.560    -.0059612    .0108563
             |
ln_avgwwag~o |
         D1. |  -.0004892   .0016403    -0.30   0.767    -.0038044     .002826
             |
ln_avgwwag~n |
         D1. |  -.0021324   .0015485    -1.38   0.176    -.0052621    .0009973
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        58           0          58     |
-----------------------------------------------------+
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(169,765 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(2 real changes made)
(1 real change made)
(note: file ../temp/estimates_static_both.dta not found)
file ../temp/estimates_static_both.dta saved

 ( 1)  D.mw_wkp_tot_17 + D.mw_res = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0480972   .0165846     2.90   0.006     .0145784    .0816159
------------------------------------------------------------------------------
number of observations will be reset to 1
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 1
(note: file ../temp/estimates_static_both_sumsum_from0.dta not found)
file ../temp/estimates_static_both_sumsum_from0.dta saved
(note: variable at was byte, now float to accommodate using data's values)
file ../temp/estimates_static_both.dta saved
(note: file ../temp/estimates_static_both.csv not found)
file ../temp/estimates_static_both.csv saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     77,567
Absorbing 1 HDFE group                            F(  13,     40) =       4.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.0243
                                                  Adj R-squared   =     0.0212
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0297

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
high_work_mw#|
   cD.mw_res |
          0  |  -.0189647   .0195346    -0.97   0.337    -.0584456    .0205161
          1  |  -.0204134   .0287432    -0.71   0.482    -.0785056    .0376788
             |
 high_res_mw#|
         cD. |
mw_wkp_to~17 |
          0  |   .0666271   .0296693     2.25   0.030     .0066633    .1265909
          1  |   .0685831   .0333884     2.05   0.047     .0011027    .1360635
             |
ln_emp_biz~v |
         D1. |   .0178522   .0086497     2.06   0.046     .0003706    .0353339
             |
 ln_emp_info |
         D1. |   .0025193   .0042865     0.59   0.560     -.006144    .0111827
             |
  ln_emp_fin |
         D1. |   .0110044   .0075462     1.46   0.153     -.004247    .0262558
             |
ln_estcoun~v |
         D1. |   .0131692   .0171483     0.77   0.447    -.0214888    .0478272
             |
ln_estcoun~o |
         D1. |   .0039627   .0087943     0.45   0.655    -.0138113    .0217366
             |
ln_estcoun~n |
         D1. |  -.0110223   .0184218    -0.60   0.553    -.0482541    .0262095
             |
ln_avgwwag~v |
         D1. |   .0027709    .004078     0.68   0.501     -.005471    .0110127
             |
ln_avgwwag~o |
         D1. |  -.0003441   .0017147    -0.20   0.842    -.0038096    .0031214
             |
ln_avgwwag~n |
         D1. |  -.0020496   .0015801    -1.30   0.202    -.0052431    .0011439
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------------------------------
> --+
                             Absorbed FE | Categories  - Redundant  = Num. Coef
> s                                                                            
>   |
-----------------------------------------+-------------------------------------
> --|
     year_month#high_work_mw#high_res_mw |       232           0         232   
>                                                                              
>   |
-------------------------------------------------------------------------------
> --+
(169,763 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: file ../temp/estimates_het_mw_shares.dta not found)
file ../temp/estimates_het_mw_shares.dta saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     77,567
Absorbing 1 HDFE group                            F(  13,     40) =       4.34
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.0227
                                                  Adj R-squared   =     0.0211
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0297

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
public_hou~g#|
   cD.mw_res |
          0  |   .0060918   .0258695     0.24   0.815    -.0461925    .0583761
          1  |  -.0675362   .0598419    -1.13   0.266    -.1884812    .0534089
             |
public_hou~g#|
         cD. |
mw_wkp_to~17 |
          0  |    .045088   .0319295     1.41   0.166    -.0194438    .1096198
          1  |   .1101743   .0645124     1.71   0.095    -.0202102    .2405588
             |
ln_emp_biz~v |
         D1. |   .0190822   .0081923     2.33   0.025     .0025249    .0356394
             |
 ln_emp_info |
         D1. |   .0022103   .0043381     0.51   0.613    -.0065573    .0109779
             |
  ln_emp_fin |
         D1. |   .0116349    .007798     1.49   0.144    -.0041254    .0273952
             |
ln_estcoun~v |
         D1. |    .013497   .0174165     0.77   0.443     -.021703    .0486971
             |
ln_estcoun~o |
         D1. |    .003182   .0088764     0.36   0.722     -.014758    .0211219
             |
ln_estcoun~n |
         D1. |  -.0121477   .0198101    -0.61   0.543    -.0521855      .02789
             |
ln_avgwwag~v |
         D1. |   .0023269   .0040585     0.57   0.570    -.0058756    .0105294
             |
ln_avgwwag~o |
         D1. |  -.0005936   .0016854    -0.35   0.727    -.0039999    .0028128
             |
ln_avgwwag~n |
         D1. |  -.0022418   .0015097    -1.48   0.145    -.0052929    .0008094
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------------+
                 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------------+---------------------------------------|
   year_month#public_housing |       116           0         116     |
---------------------------------------------------------------------+
(169,763 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: file ../temp/estimates_het_public_hous.dta not found)
file ../temp/estimates_het_public_hous.dta saved
(note: variable var was str13, now str19 to accommodate using data's values)
(note: variable model was str11, now str13 to accommodate using data's
       values)
(note: variable var was str19, now str23 to accommodate using data's values)
(note: variable model was str13, now str15 to accommodate using data's
       values)
(note: file ../temp/estimates_het.csv not found)
file ../temp/estimates_het.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(data.table)
> 
> main <- function() {
+   instub  <- "../temp/"
+   outstub <- "../output/"
+   
+   est <- fread(file.path(instub, "estimates_het.csv"))
+   
+   txt <- c("<tab:heterogeneity>")
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_res_high_work_mw" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_res_high_work_mw" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_res_high_work_mw" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_res_high_work_mw" & at == 1,]$se, 
+                  sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_wkp_high_res_mw" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_wkp_high_res_mw" & at == 1,]$se, 
+                  sep = "\t"))
+   
+    txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$r2,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$r2,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$r2, 
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$N,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$N,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$N, 
+                  sep = "\t"))
+ 
+   fileConn <- file(file.path(outstub, "heterogeneity.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.56    0.17    0.70 

 make.py ended: 2022-05-03 09:41:38
