
 make.py started: 2022-06-10 11:51:55 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local incross "../../../drive/derived_large/zipcode"
  3.     local in_hud "../../../drive/base_large/hud_housing_assistance"
  4.     local outstub "../temp"
  5. 
.     use "`in_hud'/zipcode.dta", clear
  6.     keep if program_label == "Public Housing"
  7.     keep if year == 2017
  8.     keep zipcode total_units
  9.     save_data "`outstub'/public_housing_2017.dta", key(zipcode) replace lo
> g(none)
 10. 
.     load_and_clean, instub(`instub') incross(`incross')
 11. 
.     merge m:1 zipcode using "`outstub'/public_housing_2017.dta",    ///
>         nogen keep(1 3)
 12.     gen public_housing = (total_units > 0) if !missing(total_units)
 13.     replace public_housing = 0 if missing(total_units)
 14. 
.     save_data "`outstub'/fullbal_sample_with_vars_for_het.dta",     ///
>         key(zipcode year_month) replace log(none)
 15. end

. 
. 
. program load_and_clean
  1.     syntax, instub(str) incross(str)
  2. 
.     define_controls
  3.     local controls     "`r(economic_controls)'"
  4. 
.     use zipcode statefips cbsa year_month zipcode_num ln_rents mw_res  ///
>         mw_wkp_tot_17 fullbal_sample_SFCC `controls'                   ///
>         using "`instub'/zipcode_months.dta" if fullbal_sample_SFCC == 1, clea
> r
  5.     drop fullbal_sample_SFCC
  6.     xtset zipcode_num year_month
  7. 
.     merge m:1 zipcode using "`incross'/zipcode_cross.dta", nogen       ///
>         keep(3) keepusing(sh_mw_wkrs_statutory med_hhld_inc_acs2014)
  8. 
.     gen pc_mw_wkrs_statutory = sh_mw_wkrs_statutory*100
  9.     
.     egen pc_mw_wkrs_statutory_med = median(pc_mw_wkrs_statutory)
 10.     gen pc_mw_wkrs_statutory_diff_med = pc_mw_wkrs_statutory - pc_mw_wkrs_
> statutory_med
 11.     drop pc_mw_wkrs_statutory_med
 12.         
.         gen th_med_hhld_inc = med_hhld_inc_acs2014/1000
 13.         drop med_hhld_inc_acs2014
 14. end

. 
. 
. main
(310,972 observations deleted)
(24,164 observations deleted)
(data now sorted by zipcode)
  variable total_units was double now int
  (37,974 bytes saved)
===============================================================================
File: ../temp/public_housing_2017.dta
Key: zipcode
===============================================================================
  6329:2(60726):1417201667:2500064492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
 total_units |      6,329    164.4508    388.0311          0      10966




(note: file ../temp/public_housing_2017.dta not found)
file ../temp/public_housing_2017.dta saved
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2015m1 to 2019m12
                delta:  1 month

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            80,700  
    -----------------------------------------
(4,920 missing values generated)
(4,920 missing values generated)
(3,060 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                        53,880
        from master                    53,880  
        from using                          0  

    matched                            26,820  
    -----------------------------------------
(53,880 missing values generated)
(53,880 real changes made)
(data now sorted by zipcode year_month)
  variable public_housing was float now byte
  (242,100 bytes saved)
===============================================================================
File: ../temp/fullbal_sample_with_vars_for_het.dta
Key: zipcode year_month
===============================================================================
  80700:23(27848):3841081518:1544998296

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |     80,700       689.5    17.31821        660        719
 zipcode_num |     80,700    53665.63    29070.98       2109      99577
   statefips |          0
        cbsa |          0
-------------+---------------------------------------------------------
      mw_res |     80,700    2.132054    .1678798   1.981001   2.772589
mw_wkp_to~17 |     80,700     2.13596    .1632247   1.981412   2.694137
    ln_rents |     80,700    .1368194    .4708669  -.7634219   3.100092
ln_emp_biz~v |     80,700    11.19374    1.376256   6.021023   13.38876
 ln_emp_info |     80,352    9.011645    1.567368   2.397895   12.38988
-------------+---------------------------------------------------------
  ln_emp_fin |     80,688    10.22864    1.434146    4.75359   12.89542
ln_estcoun~v |     80,700    8.713603     1.24719   4.356709   10.96353
ln_estcoun~o |     80,700    6.125135    1.351283   1.609438   9.531191
ln_estcoun~n |     80,700    8.008003    1.208489   3.663562   10.33748
ln_avgwwag~v |     80,700    7.143119    .3080602   5.726848   8.178078
-------------+---------------------------------------------------------
ln_avgwwag~o |     80,352    7.327531    .3554562   5.891644   8.906665
ln_avgwwag~n |     80,688    7.311874    .3682792   6.326149   9.163982
sh_mw_wkrs~y |     75,780    .1496538    .0468091   .0132085   .5346981
pc_mw_wkrs~y |     75,780    14.96538    4.680913   1.320845   53.46981
pc_mw_wkrs~d |     75,780    .5324682    4.680913  -13.11206   39.03691
-------------+---------------------------------------------------------
th_med_hhl~c |     77,640    60.45692    22.91414     15.041   176.1697
 total_units |     26,820     232.047    616.2516          0      10966
public_hou~g |     80,700     .330855    .4705239          0          1




(note: file ../temp/fullbal_sample_with_vars_for_het.dta not found)
file ../temp/fullbal_sample_with_vars_for_het.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.     local instub  "../temp"
  2.     local outstub "../output"
  3. 
.     define_controls
  4.     local controls     "`r(economic_controls)'"
  5.     local cluster_vars "statefips"
  6.     local absorb "year_month"
  7. 
.     use "`instub'/fullbal_sample_with_vars_for_het.dta", clear
  8.     xtset zipcode_num year_month
  9. 
.     estimate_dist_lag_model, depvar(ln_rents)                         ///
>         dyn_var(mw_wkp_tot_17) w(0) stat_var(mw_res)                  ///
>         controls(`controls') absorb(`absorb') cluster(`cluster_vars') ///
>         model_name(static_both)
 10.         
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.pc_mw_wkrs_statutory_diff_med 
>                    ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.pc_mw_wkrs_statutory_diff_med  
>                             ///
>         D.(`controls'), nocons                                        ///
>         absorb(`absorb'#c.pc_mw_wkrs_statutory_diff_med)                   //
> /
>         cluster(`cluster_vars')
 11.     
.     process_estimates, res_var(mw_res_pc_mw_wkrs_diff_med)                   
> ///
>         wkp_var(mw_wkp_pc_mw_wkrs_diff_med) model(het_mw_shares)
 12. 
.         reghdfe D.ln_rents c.D.mw_res c.D.mw_res#1.public_housing            
>       ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#1.public_housing                 
>          ///
>         D.(`controls'), nocons                                        ///
>         absorb(year_month) cluster(`cluster_vars')
 13.     
.     process_estimates, res_var(mw_res_high_public_hous)               ///
>         wkp_var(mw_wkp_high_public_hous) model(het_public_hous)
 14. 
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.th_med_hhld_inc               
>      ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.th_med_hhld_inc                
>               ///
>         D.(`controls'), nocons                                        ///
>         absorb(`absorb'#c.th_med_hhld_inc)                   ///
>         cluster(`cluster_vars')
 15.     
.     process_estimates, res_var(mw_res_th_med_hhld_inc)                   ///
>         wkp_var(mw_wkp_th_med_hhld_inc) model(het_med_inc)
 16. 
.     use "../temp/estimates_static_both.dta", clear
 17.     append using "../temp/estimates_het_mw_shares.dta"
 18.     append using "../temp/estimates_het_public_hous.dta"
 19.     append using "../temp/estimates_het_med_inc.dta"
 20.     export delimited "../output/estimates_het.csv", replace
 21. end

. 
. program process_estimates
  1.     syntax, res_var(str) wkp_var(str) model(str)
  2. 
.     preserve
  3.         local N = e(N)
  4.         local r2 = e(r2)
  5. 
.         qui coefplot, vertical base gen
  6.         keep __at __b __se
  7.         rename (__at __b __se) (at b se)
  8.         keep if _n <= 4
  9.         keep if !missing(at)
 10. 
.         replace at = 0
 11.         replace at = 1 if inlist(_n, 2, 4)
 12. 
.         gen     var = "`res_var'"  
 13.         replace var = "`wkp_var'" if _n >= 3
 14. 
.         gen N = `N'
 15.         gen r2 = `r2'
 16.         gen model = "`model'"
 17. 
.         save "../temp/estimates_`model'.dta", replace
 18.     restore
 19. end

. 
. main
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2015m1 to 2019m12
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     78,912
Absorbing 1 HDFE group                            F(  11,     40) =       3.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0012
                                                  R-squared       =     0.0216
                                                  Adj R-squared   =     0.0207
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0296

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp_to~17 |
         D1. |   .0687172   .0298119     2.31   0.026      .008465    .1289694
             |
      mw_res |
         D1. |  -.0199171   .0195096    -1.02   0.313    -.0593474    .0195131
             |
ln_emp_biz~v |
         D1. |   .0183028    .008743     2.09   0.043     .0006325    .0359731
             |
 ln_emp_info |
         D1. |   .0023708    .004417     0.54   0.594    -.0065563     .011298
             |
  ln_emp_fin |
         D1. |   .0113835   .0078043     1.46   0.152    -.0043896    .0271566
             |
ln_estcoun~v |
         D1. |   .0126444   .0176372     0.72   0.478    -.0230018    .0482905
             |
ln_estcoun~o |
         D1. |   .0035645    .008817     0.40   0.688    -.0142554    .0213844
             |
ln_estcoun~n |
         D1. |  -.0125562   .0194456    -0.65   0.522    -.0518572    .0267449
             |
ln_avgwwag~v |
         D1. |   .0024521   .0041577     0.59   0.559     -.005951    .0108551
             |
ln_avgwwag~o |
         D1. |   -.000489   .0016398    -0.30   0.767     -.003803    .0028251
             |
ln_avgwwag~n |
         D1. |  -.0021355   .0015493    -1.38   0.176    -.0052667    .0009958
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        59           0          59     |
-----------------------------------------------------+
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(80,698 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(2 real changes made)
(1 real change made)
(note: file ../temp/estimates_static_both.dta not found)
file ../temp/estimates_static_both.dta saved

 ( 1)  D.mw_wkp_tot_17 + D.mw_res = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0488001    .016213     3.01   0.005     .0160324    .0815677
------------------------------------------------------------------------------
number of observations will be reset to 1
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 1
(note: file ../temp/estimates_static_both_sumsum_from0.dta not found)
file ../temp/estimates_static_both_sumsum_from0.dta saved
(note: variable at was byte, now float to accommodate using data's values)
file ../temp/estimates_static_both.dta saved
(note: file ../temp/estimates_static_both.csv not found)
file ../temp/estimates_static_both.csv saved
(warning: no intercepts terms in absorb(); regression lacks constant term)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 1 HDFE group                            F(  13,     38) =      22.46
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0070
                                                  Adj R-squared   =     0.0060
                                                  Within R-sq.    =     0.0053
Number of clusters (statefips) =         39       Root MSE        =     0.0300

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0995384   .0323619    -3.08   0.004    -.1650516   -.0340252
             |
   cD.mw_res#|
          c. |
pc_mw_wkrs~d |  -.0181412   .0104062    -1.74   0.089    -.0392075    .0029251
             |
mw_wkp_to~17 |
         D1. |   .2397065   .0404594     5.92   0.000     .1578007    .3216124
             |
         cD. |
mw_wkp_to~17#|
          c. |
pc_mw_wkrs~d |   .0185281    .012567     1.47   0.149    -.0069126    .0439687
             |
ln_emp_biz~v |
         D1. |   .0253167   .0071845     3.52   0.001     .0107724    .0398609
             |
 ln_emp_info |
         D1. |   .0047793   .0036435     1.31   0.197    -.0025966    .0121551
             |
  ln_emp_fin |
         D1. |   .0353994   .0077236     4.58   0.000     .0197638    .0510351
             |
ln_estcoun~v |
         D1. |  -.0189008   .0474189    -0.40   0.692    -.1148954    .0770937
             |
ln_estcoun~o |
         D1. |   .0161587   .0132407     1.22   0.230    -.0106457     .042963
             |
ln_estcoun~n |
         D1. |  -.0083883   .0383828    -0.22   0.828    -.0860902    .0693136
             |
ln_avgwwag~v |
         D1. |  -.0170657   .0037622    -4.54   0.000    -.0246817   -.0094496
             |
ln_avgwwag~o |
         D1. |   .0005646   .0016549     0.34   0.735    -.0027856    .0039149
             |
ln_avgwwag~n |
         D1. |  -.0023118   .0019599    -1.18   0.246    -.0062795    .0016559
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------------------------------
> -----+
                                Absorbed FE | Categories  - Redundant  = Num. C
> oefs                                                                         
>      |
--------------------------------------------+----------------------------------
> -----|
 year_month#c.pc_mw_wkrs_statutory_diff_med |        59           0          59
>     ?                                                                        
>      |
-------------------------------------------------------------------------------
> -----+
? = number of redundant parameters may be higher
(80,696 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: file ../temp/estimates_het_mw_shares.dta not found)
file ../temp/estimates_het_mw_shares.dta saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     78,912
Absorbing 1 HDFE group                            F(  13,     40) =       3.94
Statistics robust to heteroskedasticity           Prob > F        =     0.0004
                                                  R-squared       =     0.0216
                                                  Adj R-squared   =     0.0207
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0296

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |   .0073698   .0244276     0.30   0.764    -.0420002    .0567398
             |
public_hou~g#|
   cD.mw_res |
          1  |  -.0825915   .0780323    -1.06   0.296    -.2403007    .0751177
             |
mw_wkp_to~17 |
         D1. |   .0385242   .0303331     1.27   0.211    -.0227812    .0998296
             |
public_hou~g#|
         cD. |
mw_wkp_to~17 |
          1  |   .0907782   .0770774     1.18   0.246     -.065001    .2465574
             |
ln_emp_biz~v |
         D1. |   .0184199   .0087296     2.11   0.041     .0007767    .0360631
             |
 ln_emp_info |
         D1. |   .0023902   .0044073     0.54   0.591    -.0065173    .0112978
             |
  ln_emp_fin |
         D1. |   .0114629    .007792     1.47   0.149    -.0042854    .0272111
             |
ln_estcoun~v |
         D1. |   .0126843   .0176979     0.72   0.478    -.0230846    .0484532
             |
ln_estcoun~o |
         D1. |   .0034821   .0088238     0.39   0.695    -.0143515    .0213157
             |
ln_estcoun~n |
         D1. |  -.0123859   .0195304    -0.63   0.530    -.0518582    .0270864
             |
ln_avgwwag~v |
         D1. |   .0023058   .0041238     0.56   0.579    -.0060287    .0106403
             |
ln_avgwwag~o |
         D1. |  -.0005061   .0016391    -0.31   0.759    -.0038189    .0028067
             |
ln_avgwwag~n |
         D1. |  -.0021375     .00156    -1.37   0.178    -.0052904    .0010154
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        59           0          59     |
-----------------------------------------------------+
(80,696 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: file ../temp/estimates_het_public_hous.dta not found)
file ../temp/estimates_het_public_hous.dta saved
(warning: no intercepts terms in absorb(); regression lacks constant term)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     75,919
Absorbing 1 HDFE group                            F(  13,     39) =       9.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0263
                                                  Adj R-squared   =     0.0254
                                                  Within R-sq.    =     0.0012
Number of clusters (statefips) =         40       Root MSE        =     0.0296

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.2548118   .0962682    -2.65   0.012    -.4495327    -.060091
             |
   cD.mw_res#|
          c. |
th_med_hhl~c |   .0032792   .0011695     2.80   0.008     .0009136    .0056447
             |
mw_wkp_to~17 |
         D1. |   .4294648   .1154413     3.72   0.001     .1959628    .6629668
             |
         cD. |
mw_wkp_to~17#|
          c. |
th_med_hhl~c |  -.0050442   .0014151    -3.56   0.001    -.0079065    -.002182
             |
ln_emp_biz~v |
         D1. |   .0213983    .009624     2.22   0.032     .0019319    .0408647
             |
 ln_emp_info |
         D1. |   .0020567   .0046203     0.45   0.659    -.0072888    .0114022
             |
  ln_emp_fin |
         D1. |   .0141892   .0080785     1.76   0.087     -.002151    .0305295
             |
ln_estcoun~v |
         D1. |   .0194285   .0209867     0.93   0.360    -.0230211    .0618781
             |
ln_estcoun~o |
         D1. |   .0052959   .0089315     0.59   0.557    -.0127697    .0233615
             |
ln_estcoun~n |
         D1. |  -.0192948   .0228566    -0.84   0.404    -.0655266    .0269369
             |
ln_avgwwag~v |
         D1. |   .0011713   .0036826     0.32   0.752    -.0062775    .0086201
             |
ln_avgwwag~o |
         D1. |  -.0001277   .0015349    -0.08   0.934    -.0032323    .0029768
             |
ln_avgwwag~n |
         D1. |  -.0023011   .0019394    -1.19   0.243     -.006224    .0016217
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------------+
                  Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------------+---------------------------------------|
 year_month#c.th_med_hhld_inc |        59           0          59    ?|
----------------------------------------------------------------------+
? = number of redundant parameters may be higher
(80,696 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: file ../temp/estimates_het_med_inc.dta not found)
file ../temp/estimates_het_med_inc.dta saved
(note: variable var was str13, now str26 to accommodate using data's values)
(note: variable model was str11, now str13 to accommodate using data's
       values)
(note: variable model was str13, now str15 to accommodate using data's
       values)
(note: file ../output/estimates_het.csv not found)
file ../output/estimates_het.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(data.table)
> 
> main <- function() {
+   instub  <- "../output/"
+   outstub <- "../output/"
+   
+   est <- fread(file.path(instub, "estimates_het.csv"))
+   
+   txt <- c("<tab:heterogeneity>")
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_res_pc_mw_wkrs_diff_med" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$b,
+                  est[model == "het_med_inc"    & var == "mw_res_th_med_hhld_inc" & at == 0,]$b,
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_res_pc_mw_wkrs_diff_med" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$se,
+                  est[model == "het_med_inc"    & var == "mw_res_th_med_hhld_inc" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_res_pc_mw_wkrs_diff_med" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_res_pc_mw_wkrs_diff_med" & at == 1,]$se, 
+                  sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_med_inc" & var == "mw_res_th_med_hhld_inc" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_med_inc" & var == "mw_res_th_med_hhld_inc" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_pc_mw_wkrs_diff_med" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$b,
+                  est[model == "het_med_inc"    & var == "mw_wkp_th_med_hhld_inc" & at == 0,]$b,
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_pc_mw_wkrs_diff_med" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$se,
+                  est[model == "het_med_inc"    & var == "mw_wkp_th_med_hhld_inc" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_wkp_pc_mw_wkrs_diff_med" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_wkp_pc_mw_wkrs_diff_med" & at == 1,]$se, 
+                  sep = "\t"))
+   
+    txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_med_inc" & var == "mw_wkp_th_med_hhld_inc" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_med_inc" & var == "mw_wkp_th_med_hhld_inc" & at == 1,]$se, 
+                  sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$r2,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_pc_mw_wkrs_diff_med" & at == 0,]$r2,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$r2,
+                  est[model == "het_med_inc"    & var == "mw_wkp_th_med_hhld_inc" & at == 0,]$r2, 
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$N,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_pc_mw_wkrs_diff_med" & at == 0,]$N,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$N,
+                  est[model == "het_med_inc"    & var == "mw_wkp_th_med_hhld_inc" & at == 0,]$N, 
+                  sep = "\t"))
+ 
+   fileConn <- file(file.path(outstub, "heterogeneity.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.90    0.39    1.57 

 make.py ended: 2022-06-10 11:52:19
