
 make.py started: 2022-06-23 15:56:38 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local incross "../../../drive/derived_large/zipcode"
  3.     local in_hud "../../../drive/base_large/hud_housing_assistance"
  4.     local outstub "../temp"
  5. 
.     use "`in_hud'/zipcode.dta", clear
  6.     keep if program_label == "Public Housing"
  7.     keep if year == 2017
  8.     keep zipcode total_units
  9.     save_data "`outstub'/public_housing_2017.dta", key(zipcode) replace lo
> g(none)
 10. 
.     load_and_clean, instub(`instub') incross(`incross')
 11. 
.     merge m:1 zipcode using "`outstub'/public_housing_2017.dta",    ///
>         nogen keep(1 3)
 12. 
.     prepare_public_housing
 13. 
.     save_data "`outstub'/fullbal_sample_with_vars_for_het.dta",     ///
>         key(zipcode year_month) replace log(none)
 14. end

. 
. 
. program load_and_clean
  1.     syntax, instub(str) incross(str)
  2. 
.     define_controls
  3.     local controls     "`r(economic_controls)'"
  4. 
.     use zipcode statefips cbsa year_month zipcode_num ln_rents mw_res  ///
>         mw_wkp_tot_17 fullbal_sample_SFCC `controls'                   ///
>         using "`instub'/zipcode_months.dta" if fullbal_sample_SFCC == 1, clea
> r
  5.     drop fullbal_sample_SFCC
  6.     xtset zipcode_num year_month
  7. 
.     merge m:1 zipcode using "`incross'/zipcode_cross.dta", nogen       ///
>         keep(3) keepusing(sh_mw_wkrs_statutory med_hhld_inc_acs2014 n_hhlds_c
> ens2010)
  8. 
.     foreach var in sh_mw_wkrs_statutory med_hhld_inc_acs2014 {
  9.             qui sum `var'
 10.         local avg_`var' = r(mean)
 11.         local sd_`var' = r(sd)
 12.         gen std_`var' = (`var' - `avg_`var'')/`sd_`var''
 13.     }
 14. end

. 
. program prepare_public_housing
  1. 
.     gen     public_housing = (total_units > 0) if !missing(total_units)
  2.     replace public_housing = 0 if missing(total_units)
  3. 
.     gen     sh_public_housing = total_units/n_hhlds_cens2010
  4.     replace sh_public_housing = 0 if missing(total_units)
  5. 
.     qui sum sh_public_housing
  6.     local avg_sh_public_housing = r(mean)
  7.     local sd_sh_public_housing  = r(sd)
  8. 
.     gen std_sh_public_housing   = (sh_public_housing - `avg_sh_public_housing
> ')/`sd_sh_public_housing'
  9. end

. 
. main
(310,972 observations deleted)
(24,164 observations deleted)
(data now sorted by zipcode)
  variable total_units was double now int
  (37,974 bytes saved)
===============================================================================
File: ../temp/public_housing_2017.dta
Key: zipcode
===============================================================================
  6329:2(60726):1417201667:2500064492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
 total_units |      6,329    164.4508    388.0311          0      10966




(note: file ../temp/public_housing_2017.dta not found)
file ../temp/public_housing_2017.dta saved
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2015m1 to 2019m12
                delta:  1 month

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            80,700  
    -----------------------------------------
(4,920 missing values generated)
(3,060 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                        53,880
        from master                    53,880  
        from using                          0  

    matched                            26,820  
    -----------------------------------------
(53,880 missing values generated)
(53,880 real changes made)
(54,180 missing values generated)
(53,880 real changes made)
(300 missing values generated)
(data now sorted by zipcode year_month)
  variable public_housing was float now byte
  (242,100 bytes saved)
===============================================================================
File: ../temp/fullbal_sample_with_vars_for_het.dta
Key: zipcode year_month
===============================================================================
  80700:26(93693):3179026602:376132390

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |     80,700       689.5    17.31821        660        719
 zipcode_num |     80,700    53665.63    29070.98       2109      99577
   statefips |          0
        cbsa |          0
-------------+---------------------------------------------------------
      mw_res |     80,700    2.132054    .1678798   1.981001   2.772589
mw_wkp_to~17 |     80,700     2.13596    .1632247   1.981412   2.694137
    ln_rents |     80,700    .1368194    .4708669  -.7634219   3.100092
ln_emp_biz~v |     80,700    11.19374    1.376256   6.021023   13.38876
 ln_emp_info |     80,352    9.011645    1.567368   2.397895   12.38988
-------------+---------------------------------------------------------
  ln_emp_fin |     80,688    10.22864    1.434146    4.75359   12.89542
ln_estcoun~v |     80,700    8.713603     1.24719   4.356709   10.96353
ln_estcoun~o |     80,700    6.125135    1.351283   1.609438   9.531191
ln_estcoun~n |     80,700    8.008003    1.208489   3.663562   10.33748
ln_avgwwag~v |     80,700    7.143119    .3080602   5.726848   8.178078
-------------+---------------------------------------------------------
ln_avgwwag~o |     80,352    7.327531    .3554562   5.891644   8.906665
ln_avgwwag~n |     80,688    7.311874    .3682792   6.326149   9.163982
n_hhlds~2010 |     80,700    16080.83    5901.083          0      48073
med_hhl~2014 |     77,640    60456.92    22914.14      15041   176169.7
sh_mw_wkrs~y |     75,780    .1496538    .0468091   .0132085   .5346981
-------------+---------------------------------------------------------
std_sh_mw_~y |     75,780   -1.93e-10           1  -2.914929   8.225839
std_med~2014 |     77,640    1.07e-09           1  -1.982004    5.04984
 total_units |     26,820     232.047    616.2516          0      10966
public_hou~g |     80,700     .330855    .4705239          0          1
sh_public_~g |     80,400    .0043692    .0173066          0   .3458869
-------------+---------------------------------------------------------
std_sh_pub~g |     80,400   -7.78e-09           1  -.2524565   19.73339




(note: file ../temp/fullbal_sample_with_vars_for_het.dta not found)
file ../temp/fullbal_sample_with_vars_for_het.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.     local instub  "../temp"
  2.     local outstub "../output"
  3. 
.     define_controls
  4.     local controls     "`r(economic_controls)'"
  5.     local cluster_vars "statefips"
  6.     local absorb "year_month"
  7. 
.     use "`instub'/fullbal_sample_with_vars_for_het.dta", clear
  8.     xtset zipcode_num year_month
  9. 
.     estimate_dist_lag_model, depvar(ln_rents)                         ///
>         dyn_var(mw_wkp_tot_17) w(0) stat_var(mw_res)                  ///
>         controls(`controls') absorb(`absorb') cluster(`cluster_vars') ///
>         model_name(static_both)
 10.         
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.std_sh_mw_wkrs_statutory ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.std_sh_mw_wkrs_statutory  ///
>         D.(`controls'), nocons                                          ///
>         absorb(`absorb') cluster(`cluster_vars')
 11.     process_sum, het_var(std_sh_mw_wkrs_statutory) model(het_mw_shares)
 12.     process_estimates, res_var(mw_res_std_sh_mw_wkrs_statutory)         //
> /
>         wkp_var(mw_wkp_std_sh_mw_wkrs_statutory) model(het_mw_shares)
 13. 
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.std_med_hhld_inc_acs2014 ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.std_med_hhld_inc_acs2014  ///
>         D.(`controls'), nocons                                          ///
>         absorb(`absorb') cluster(`cluster_vars')
 14.     process_sum, het_var(std_med_hhld_inc_acs2014) model(het_med_inc)   
 15.     process_estimates, res_var(mw_res_std_med_hhld_inc)                 //
> /
>         wkp_var(mw_wkp_std_med_hhld_inc) model(het_med_inc)
 16. 
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.std_sh_public_housing    ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.std_sh_public_housing     ///
>         D.(`controls'), nocons                                          ///
>         absorb(year_month) cluster(`cluster_vars')
 17.         process_sum, het_var(std_sh_public_housing) model(het_public_hous)
>     
 18.     process_estimates, res_var(mw_res_high_public_hous)                 //
> /
>         wkp_var(mw_wkp_high_public_hous) model(het_public_hous)
 19. 
.     use "../temp/estimates_static_both.dta", clear
 20.     append using "../temp/estimates_het_mw_shares.dta"
 21.     append using "../temp/estimates_het_public_hous.dta"
 22.     append using "../temp/estimates_het_med_inc.dta"
 23.     export delimited "../output/estimates_het.csv", replace
 24. end

. 
. program process_sum
  1.     syntax, het_var(str) model(str)
  2. 
.     lincom c.D.mw_res + c.D.mw_res#c.`het_var'
  3.     matrix sum_res = (0, r(estimate), r(se))
  4.     lincom c.D.mw_wkp_tot_17 + c.D.mw_wkp_tot_17#c.`het_var'
  5.     matrix sum_wkp = (0, r(estimate), r(se))
  6.     matrix sum = (sum_res \ sum_wkp)
  7.     
.     preserve
  8.         svmat sum
  9.         keep sum1 sum2 sum3
 10.         rename (sum1 sum2 sum3) (at b se)
 11.         drop if missing(at)
 12.         
.         gen     var = "sum_res"  
 13.         replace var = "sum_wkp" if _n == 2
 14.         gen model = "`model'"
 15. 
.         save "../temp/sum_`model'.dta", replace
 16.     restore
 17. end

. 
. program process_estimates
  1.     syntax, res_var(str) wkp_var(str) model(str)
  2. 
.     preserve
  3.         local N = e(N)
  4.         local r2 = e(r2)
  5. 
.         qui coefplot, vertical base gen
  6.         keep __at __b __se
  7.         rename (__at __b __se) (at b se)
  8.         keep if _n <= 4
  9.         keep if !missing(at)
 10. 
.         replace at = 0
 11.         replace at = 1 if inlist(_n, 2, 4)
 12. 
.         gen     var = "`res_var'"  
 13.         replace var = "`wkp_var'" if _n >= 3
 14. 
.         gen N = `N'
 15.         gen r2 = `r2'
 16.         gen model = "`model'"
 17.         
.         append using "../temp/sum_`model'.dta"
 18.         save "../temp/estimates_`model'.dta", replace
 19.     restore
 20. end

. 
. main
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2015m1 to 2019m12
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     78,912
Absorbing 1 HDFE group                            F(  11,     40) =       3.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0012
                                                  R-squared       =     0.0216
                                                  Adj R-squared   =     0.0207
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0296

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp_to~17 |
         D1. |   .0687172   .0298119     2.31   0.026      .008465    .1289694
             |
      mw_res |
         D1. |  -.0199171   .0195096    -1.02   0.313    -.0593474    .0195131
             |
ln_emp_biz~v |
         D1. |   .0183028    .008743     2.09   0.043     .0006325    .0359731
             |
 ln_emp_info |
         D1. |   .0023708    .004417     0.54   0.594    -.0065563     .011298
             |
  ln_emp_fin |
         D1. |   .0113835   .0078043     1.46   0.152    -.0043896    .0271566
             |
ln_estcoun~v |
         D1. |   .0126444   .0176372     0.72   0.478    -.0230018    .0482905
             |
ln_estcoun~o |
         D1. |   .0035645    .008817     0.40   0.688    -.0142554    .0213844
             |
ln_estcoun~n |
         D1. |  -.0125562   .0194456    -0.65   0.522    -.0518572    .0267449
             |
ln_avgwwag~v |
         D1. |   .0024521   .0041577     0.59   0.559     -.005951    .0108551
             |
ln_avgwwag~o |
         D1. |   -.000489   .0016398    -0.30   0.767     -.003803    .0028251
             |
ln_avgwwag~n |
         D1. |  -.0021355   .0015493    -1.38   0.176    -.0052667    .0009958
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        59           0          59     |
-----------------------------------------------------+
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(80,698 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(2 real changes made)
(1 real change made)
(note: file ../temp/estimates_static_both.dta not found)
file ../temp/estimates_static_both.dta saved

 ( 1)  D.mw_wkp_tot_17 + D.mw_res = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0488001    .016213     3.01   0.005     .0160324    .0815677
------------------------------------------------------------------------------
number of observations will be reset to 1
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 1
(note: file ../temp/estimates_static_both_sumsum_from0.dta not found)
file ../temp/estimates_static_both_sumsum_from0.dta saved
(note: variable at was byte, now float to accommodate using data's values)
file ../temp/estimates_static_both.dta saved
(note: file ../temp/estimates_static_both.csv not found)
file ../temp/estimates_static_both.csv saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 1 HDFE group                            F(  13,     38) =      11.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0214
                                                  Adj R-squared   =     0.0205
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         39       Root MSE        =     0.0297

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0448882   .0204356    -2.20   0.034    -.0862579   -.0035185
             |
   cD.mw_res#|
          c. |
std_sh_mw_~y |  -.0788543    .040351    -1.95   0.058    -.1605406     .002832
             |
mw_wkp_to~17 |
         D1. |   .0949789    .030744     3.09   0.004      .032741    .1572168
             |
         cD. |
mw_wkp_to~17#|
          c. |
std_sh_mw_~y |   .0820057   .0461414     1.78   0.084    -.0114026    .1754141
             |
ln_emp_biz~v |
         D1. |   .0171718   .0080144     2.14   0.039     .0009475    .0333961
             |
 ln_emp_info |
         D1. |   .0010573   .0040834     0.26   0.797    -.0072092    .0093238
             |
  ln_emp_fin |
         D1. |   .0098113   .0073213     1.34   0.188      -.00501    .0246325
             |
ln_estcoun~v |
         D1. |   .0070663   .0187478     0.38   0.708    -.0308866    .0450193
             |
ln_estcoun~o |
         D1. |   .0024872   .0094661     0.26   0.794    -.0166759    .0216502
             |
ln_estcoun~n |
         D1. |  -.0081428    .015922    -0.51   0.612    -.0403751    .0240895
             |
ln_avgwwag~v |
         D1. |   .0012845   .0043179     0.30   0.768    -.0074566    .0100256
             |
ln_avgwwag~o |
         D1. |  -.0008115   .0017263    -0.47   0.641    -.0043061    .0026832
             |
ln_avgwwag~n |
         D1. |   -.001371   .0015673    -0.87   0.387    -.0045438    .0018018
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        59           0          59     |
-----------------------------------------------------+

 ( 1)  D.mw_res + cD.mw_res#c.std_sh_mw_wkrs_statutory = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1237426   .0553154    -2.24   0.031    -.2357228   -.0117623
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_tot_17 + cD.mw_wkp_tot_17#c.std_sh_mw_wkrs_statutory = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1769847   .0672777     2.63   0.012     .0407881    .3131812
------------------------------------------------------------------------------
(80,698 observations deleted)
(1 real change made)
(note: file ../temp/sum_het_mw_shares.dta not found)
file ../temp/sum_het_mw_shares.dta saved
(80,696 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: variable at was byte, now float to accommodate using data's values)
(note: file ../temp/estimates_het_mw_shares.dta not found)
file ../temp/estimates_het_mw_shares.dta saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     75,919
Absorbing 1 HDFE group                            F(  13,     39) =       6.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0214
                                                  Adj R-squared   =     0.0205
                                                  Within R-sq.    =     0.0006
Number of clusters (statefips) =         40       Root MSE        =     0.0295

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0357181   .0262562    -1.36   0.182    -.0888262    .0173901
             |
   cD.mw_res#|
          c. |
std_med~2014 |   .0541648   .0282063     1.92   0.062    -.0028878    .1112174
             |
mw_wkp_to~17 |
         D1. |   .0871405   .0351824     2.48   0.018     .0159774    .1583037
             |
         cD. |
mw_wkp_to~17#|
          c. |
std_med~2014 |  -.0671281   .0349591    -1.92   0.062    -.1378395    .0035833
             |
ln_emp_biz~v |
         D1. |    .017936   .0087421     2.05   0.047     .0002535    .0356185
             |
 ln_emp_info |
         D1. |   .0020204    .004604     0.44   0.663    -.0072922    .0113329
             |
  ln_emp_fin |
         D1. |   .0103271   .0079914     1.29   0.204     -.005837    .0264912
             |
ln_estcoun~v |
         D1. |   .0156769     .01707     0.92   0.364    -.0188506    .0502043
             |
ln_estcoun~o |
         D1. |   .0032369   .0085866     0.38   0.708    -.0141311    .0206049
             |
ln_estcoun~n |
         D1. |  -.0100381   .0188169    -0.53   0.597    -.0480989    .0280228
             |
ln_avgwwag~v |
         D1. |   .0034621   .0043537     0.80   0.431    -.0053442    .0122683
             |
ln_avgwwag~o |
         D1. |  -.0002334   .0016916    -0.14   0.891     -.003655    .0031882
             |
ln_avgwwag~n |
         D1. |  -.0021597   .0017586    -1.23   0.227    -.0057169    .0013975
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        59           0          59     |
-----------------------------------------------------+

 ( 1)  D.mw_res + cD.mw_res#c.std_med_hhld_inc_acs2014 = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0184468   .0226524     0.81   0.420     -.027372    .0642656
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_tot_17 + cD.mw_wkp_tot_17#c.std_med_hhld_inc_acs2014 = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0200124   .0284503     0.70   0.486    -.0375338    .0775586
------------------------------------------------------------------------------
(80,698 observations deleted)
(1 real change made)
(note: file ../temp/sum_het_med_inc.dta not found)
file ../temp/sum_het_med_inc.dta saved
(80,696 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: variable at was byte, now float to accommodate using data's values)
(note: file ../temp/estimates_het_med_inc.dta not found)
file ../temp/estimates_het_med_inc.dta saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     78,617
Absorbing 1 HDFE group                            F(  13,     40) =       5.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0216
                                                  Adj R-squared   =     0.0207
                                                  Within R-sq.    =     0.0006
Number of clusters (statefips) =         41       Root MSE        =     0.0296

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0173892   .0174732    -1.00   0.326    -.0527039    .0179255
             |
   cD.mw_res#|
          c. |
std_sh_pub~g |  -.0299035   .0335827    -0.89   0.379    -.0977766    .0379696
             |
mw_wkp_to~17 |
         D1. |   .0678158    .027628     2.45   0.019     .0119775    .1236541
             |
         cD. |
mw_wkp_to~17#|
          c. |
std_sh_pub~g |   .0262757   .0376862     0.70   0.490    -.0498909    .1024423
             |
ln_emp_biz~v |
         D1. |   .0184338   .0087523     2.11   0.042     .0007448    .0361228
             |
 ln_emp_info |
         D1. |   .0023501   .0044279     0.53   0.599    -.0065991    .0112992
             |
  ln_emp_fin |
         D1. |   .0116931   .0078296     1.49   0.143     -.004131    .0275172
             |
ln_estcoun~v |
         D1. |   .0138538    .017313     0.80   0.428    -.0211372    .0488447
             |
ln_estcoun~o |
         D1. |   .0033287   .0088124     0.38   0.708    -.0144819    .0211393
             |
ln_estcoun~n |
         D1. |  -.0129358   .0195043    -0.66   0.511    -.0523555    .0264839
             |
ln_avgwwag~v |
         D1. |   .0021998   .0041762     0.53   0.601    -.0062407    .0106402
             |
ln_avgwwag~o |
         D1. |  -.0004411   .0016418    -0.27   0.790    -.0037593    .0028772
             |
ln_avgwwag~n |
         D1. |  -.0018003   .0015947    -1.13   0.266    -.0050233    .0014226
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        59           0          59     |
-----------------------------------------------------+

 ( 1)  D.mw_res + cD.mw_res#c.std_sh_public_housing = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0472927   .0370075    -1.28   0.209    -.1220877    .0275023
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_tot_17 + cD.mw_wkp_tot_17#c.std_sh_public_housing = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0940915   .0469413     2.00   0.052    -.0007805    .1889635
------------------------------------------------------------------------------
(80,698 observations deleted)
(1 real change made)
(note: file ../temp/sum_het_public_hous.dta not found)
file ../temp/sum_het_public_hous.dta saved
(80,696 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: variable at was byte, now float to accommodate using data's values)
(note: file ../temp/estimates_het_public_hous.dta not found)
file ../temp/estimates_het_public_hous.dta saved
(note: variable var was str13, now str31 to accommodate using data's values)
(note: variable model was str11, now str13 to accommodate using data's
       values)
(note: variable model was str13, now str15 to accommodate using data's
       values)
(note: file ../output/estimates_het.csv not found)
file ../output/estimates_het.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(data.table)
> 
> main <- function() {
+   instub  <- "../output/"
+   outstub <- "../output/"
+   
+   est <- fread(file.path(instub, "estimates_het.csv"))
+   
+   txt <- c("<tab:heterogeneity>")
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 0,]$b,
+                  est[model == "het_med_inc"    & var == "mw_res_std_med_hhld_inc" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 0,]$se,
+                  est[model == "het_med_inc"    & var == "mw_res_std_med_hhld_inc" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_med_inc" & var == "mw_res_std_med_hhld_inc" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_med_inc" & var == "mw_res_std_med_hhld_inc" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$b,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$se,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_med_inc" & var == "mw_wkp_std_med_hhld_inc" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_med_inc" & var == "mw_wkp_std_med_hhld_inc" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+    txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$r2,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$r2,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$r2,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$r2,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$N,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$N,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$N,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$N,
+                  sep = "\t"))
+ 
+   fileConn <- file(file.path(outstub, "heterogeneity.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.64    0.20    0.75 


Execute:  StataMP-64 /e do "./make_autofill_values.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./make_autofill_values.do 

. clear all

. version 15

. set more off

. 
. program main
  1.     local in_estimates  "../output"
  2. 
.     import delimited `in_estimates'/estimates_het.csv
  3. 
.     keep if model == "het_mw_shares" & at == 0
  4. 
.     qui sum b if var == "mw_res_std_sh_mw_wkrs_statutory"  
  5.     local tilde_gamma_zero = r(mean)
  6.     qui sum se if var == "mw_res_std_sh_mw_wkrs_statutory"
  7.     local tilde_gamma_zero_se = r(mean)
  8. 
.     qui sum b if var == "mw_wkp_std_sh_mw_wkrs_statutory"  
  9.     local tilde_beta_zero = r(mean)
 10.     qui sum se if var == "mw_wkp_std_sh_mw_wkrs_statutory"
 11.     local tilde_beta_zero_se = r(mean)
 12. 
.     qui sum b if var == "sum_res"
 13.     local tilde_gamma_zero_plus_one = r(mean)
 14.     qui sum se if var == "sum_res"
 15.     local tilde_gamma_zero_plus_one_se = r(mean)
 16. 
.     qui sum b if var == "sum_wkp"
 17.     local tilde_beta_zero_plus_one = r(mean)
 18.     qui sum se if var == "sum_wkp"
 19.     local tilde_beta_zero_plus_one_se = r(mean)
 20. 
.     cap file close f
 21.     file open   f using "../output/autofill_heterogeneity.tex", write repl
> ace
 22.     file write  f "\newcommand{\TildeGammaZero}{\textnormal{"             
>   %4.3f  (`tilde_gamma_zero')             "}}" _n
 23.     file write  f "\newcommand{\TildeBetaZero}{\textnormal{"              
>   %4.3f  (`tilde_beta_zero')              "}}" _n
 24.     file write  f "\newcommand{\TildeGammaZeroSE}{\textnormal{"           
>   %4.3f  (`tilde_gamma_zero_se')          "}}" _n
 25.     file write  f "\newcommand{\TildeBetaZeroSE}{\textnormal{"            
>   %4.3f  (`tilde_beta_zero_se')           "}}" _n
 26.     file write  f "\newcommand{\TildeGammaZeroPlusGammaOne}{\textnormal{" 
>   %4.3f  (`tilde_gamma_zero_plus_one')    "}}" _n
 27.     file write  f "\newcommand{\TildeGammaZeroPlusGammaOneSE}{\textnormal{
> " %4.3f  (`tilde_beta_zero_plus_one')     "}}" _n
 28.     file write  f "\newcommand{\TildeBetaZeroPlusGammaOne}{\textnormal{"  
>   %4.3f  (`tilde_gamma_zero_plus_one_se') "}}" _n
 29.     file write  f "\newcommand{\TildeBetaZeroPlusGammaOneSE}{\textnormal{"
>   %4.3f  (`tilde_beta_zero_plus_one_se')  "}}" _n
 30.     file close  f
 31. end

. 
. main
(7 vars, 21 obs)
(17 observations deleted)
(note: file ../output/autofill_heterogeneity.tex not found)

. 
end of do-file

 make.py ended: 2022-06-23 15:56:54
