
 make.py started: 2022-03-27 08:33:37 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.         local instub  "../../../drive/derived_large/estimation_samples"
  2.         local incross "../../../drive/derived_large/zipcode"
  3.         local in_hud "../../../drive/base_large/hud_housing_assistance"
  4.         local outstub "../temp"
  5.         
.         use "`in_hud'/zipcode.dta", clear
  6.         keep if program_label == "Public Housing"
  7.         keep if year == 2017
  8.         keep zipcode total_units
  9.         save_data "`outstub'/public_housing_2017.dta", ///
>             key(zipcode) replace log(none)
 10.         
.         load_and_clean, instub(`instub') incross(`incross')
 11.         gen high_res_mw = sh_res_underHS_above_med*sh_res_under1250_above_
> med
 12.         gen high_work_mw = sh_workers_underHS_above_med*sh_workers_under12
> 50_above_med
 13.         merge m:1 zipcode using "`outstub'/public_housing_2017.dta", ///
>             nogen keep(1 3)
 14.         gen public_housing = (total_units > 0) if !missing(total_units)
 15.         replace public_housing = 0 if missing(total_units)
 16.     save_data "`outstub'/baseline_sample_with_vars_for_het.dta", ///
>             key(zipcode year_month) replace log(none)
 17. end

. 
. 
. program load_and_clean
  1.     syntax, instub(str) incross(str)
  2. 
.         define_controls
  3.         local controls     "`r(economic_controls)'"
  4. 
.         use zipcode statefips cbsa year_month zipcode_num ln_rents mw_res ///
>             mw_wkp_tot_17 baseline_sample `controls' ///
>                 using "`instub'/zipcode_months.dta" if baseline_sample == 1, 
> clear
  5.         drop baseline_sample
  6.         xtset zipcode_num year_month
  7. 
.         merge m:1 zipcode using "`incross'/zipcode_cross.dta", nogen ///
>             keep(3) keepusing(sh_mw_wkrs_statutory sh_workers_under29_2013 //
> /
>                 sh_residents_under29_2013 sh_residents_underHS_2013 ///
>                 sh_residents_under1250_2013 sh_workers_underHS_2013 ///
>                 sh_workers_under1250_2013 sh_residents_accomm_food_2013 ///
>                 sh_workers_accomm_food_2013)
  8.         rename *_2013 *
  9.         rename *residents* *res*
 10.         
.         foreach var in sh_mw_wkrs_statutory sh_workers_accomm_food ///
>             sh_workers_underHS sh_res_accomm_food sh_res_underHS ///
>                 sh_res_under1250 sh_workers_under1250 {
 11.             bys statefips: egen `var'_med = median(`var')
 12.             gen `var'_above_med = (`var'   > `var'_med)
 13.             drop `var'_med
 14. 
.             gen resint_`var' = mw_res*`var'_above_med
 15.             gen wkpint_`var' = mw_wkp_tot_17*`var'_above_med
 16.         }
 17. end

. 
. 
. main
(310,972 observations deleted)
(24,164 observations deleted)
(data now sorted by zipcode)
  variable total_units was double now int
  (37,974 bytes saved)
===============================================================================
File: ../temp/public_housing_2017.dta
Key: zipcode
===============================================================================
  6329:2(60726):1417201667:2500064492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
 total_units |      6,329    164.4508    388.0311          0      10966




(note: file ../temp/public_housing_2017.dta not found)
file ../temp/public_housing_2017.dta saved
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           133,600  
    -----------------------------------------
(922 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                        89,916
        from master                    89,916  
        from using                          0  

    matched                            43,684  
    -----------------------------------------
(89,916 missing values generated)
(89,916 real changes made)
(data now sorted by zipcode year_month)
  variable sh_mw_wkrs_statutory_above_med was float now byte
  variable sh_workers_accomm_food_above_med was float now byte
  variable sh_workers_underHS_above_med was float now byte
  variable sh_res_accomm_food_above_med was float now byte
  variable sh_res_underHS_above_med was float now byte
  variable sh_res_under1250_above_med was float now byte
  variable sh_workers_under1250_above_med was float now byte
  variable high_res_mw was float now byte
  variable high_work_mw was float now byte
  variable public_housing was float now byte
  (4,008,000 bytes saved)
===============================================================================
File: ../temp/baseline_sample_with_vars_for_het.dta
Key: zipcode year_month
===============================================================================
  133600:51(68190):777507733:1592249622

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |    133,600     669.086    29.80335        601        719
 zipcode_num |    133,600    53322.85    28953.65       2109      99577
   statefips |          0
        cbsa |          0
-------------+---------------------------------------------------------
      mw_res |    133,600    2.092484    .1440398   1.981001   2.772589
mw_wkp_to~17 |    133,600    2.095206    .1409483    1.98106   2.694137
    ln_rents |    133,600    .0763131    .4611457  -.8722227   3.100092
ln_emp_biz~v |    133,600    11.14873    1.361126   5.796058   13.38876
 ln_emp_info |    132,909     9.00392    1.531522   2.397895   12.38988
-------------+---------------------------------------------------------
  ln_emp_fin |    133,576    10.20114    1.417736    4.75359   12.89542
ln_estcoun~v |    133,600    8.687532    1.241487   4.127134   10.96353
ln_estcoun~o |    133,600    6.105153     1.33047   1.386294   9.531191
ln_estcoun~n |    133,600     7.98384     1.19824   3.496508   10.33748
ln_avgwwag~v |    133,600    7.092097    .3077541   5.420535   8.432724
-------------+---------------------------------------------------------
ln_avgwwag~o |    132,909    7.274275    .3440752   5.891644   8.906665
ln_avgwwag~n |    133,576    7.248412    .3672322   6.216606   9.163982
sh_mw_wkrs~y |    125,057    .1401641    .0421492   .0114365   .5270913
sh_res_un~29 |    133,600    .2209288    .0382978   .1043165   .4475389
sh_res_~1250 |    133,600    .2281551    .0466076    .081473   .4113271
-------------+---------------------------------------------------------
sh_res_und~S |    133,600    .1013298    .0315857    .045693   .2423261
sh_res_ac~od |    133,600    .1043516    .0429558   .0471225   .4085447
sh_worker~29 |    133,600    .2444845    .0499765   .1058208   .4565147
sh_work~1250 |    133,600    .2750239     .079686   .0534571   .5345912
sh_workers~S |    133,600    .1098003    .0328654   .0450641   .3313758
-------------+---------------------------------------------------------
sh_worker~od |    133,600    .1228112    .0727286          0   .7659544
sh_mw_wkrs~d |    133,600    .5285329    .4991871          0          1
resint_sh_~y |    133,600     1.10513    1.048832          0   2.772589
wkpint_sh_~y |    133,600    1.106202    1.049713          0   2.694137
sh_workers.. |    133,600    .5008458    .5000012          0          1
-------------+---------------------------------------------------------
resint_sh_.. |    133,600    1.047734    1.050879          0   2.772589
wkpint_sh_.. |    133,600     1.04867    1.051591          0   2.689819
sh_workers.. |    133,600    .5018039    .4999986          0          1
r~rs_underHS |    133,600    1.050169    1.051288          0    2.74663
w~rs_underHS |    133,600    1.051543    1.052482          0   2.682079
-------------+---------------------------------------------------------
sh_res_ac~ed |    133,600    .5026497    .4999949          0          1
resint_sh_.. |    133,600    1.052024    1.051408          0   2.772589
wkpint_sh_.. |    133,600    1.052988    1.052178          0   2.694137
sh_res_und.. |    133,600    .5031437     .499992          0          1
r~es_underHS |    133,600    1.052212    1.050358          0    2.74663
-------------+---------------------------------------------------------
w~es_underHS |    133,600    1.053396    1.051401          0   2.680206
sh_res_und.. |    133,600    .5030763    .4999924          0          1
resint_sh_.. |    133,600    1.052112    1.050453          0    2.70805
wkpint_sh_.. |    133,600     1.05287    1.051073          0   2.675503
sh_workers.. |    133,600    .5032934     .499991          0          1
-------------+---------------------------------------------------------
resint_sh_.. |    133,600     1.05211    1.049941          0   2.772589
wkpint_sh_.. |    133,600    1.053078     1.05077          0   2.682079
 high_res_mw |    133,600    .3593787    .4798202          0          1
high_work_mw |    133,600    .2800449    .4490226          0          1
 total_units |     43,684    217.7783     557.065          0      10966
-------------+---------------------------------------------------------
public_hou~g |    133,600     .325771    .4686639          0          1




(note: file ../temp/baseline_sample_with_vars_for_het.dta not found)
file ../temp/baseline_sample_with_vars_for_het.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.         local instub  "../temp"
  2.         local outstub "../output"
  3.         
.         define_controls
  4.         local controls     "`r(economic_controls)'"
  5.         local cluster_vars "statefips"
  6. 
.         use "`instub'/baseline_sample_with_vars_for_het.dta", clear
  7.         xtset zipcode_num year_month
  8.         
.         reghdfe D.ln_rents c.D.mw_res ///
>             c.D.mw_wkp_tot_17#i.public_housing ///
>             D.(`controls'), nocons ///
>                 absorb(year_month##public_housing) cluster(`cluster_vars')
  9.         
.     reghdfe D.ln_rents c.D.mw_res ///
>             c.D.mw_wkp_tot_17#i.high_res_mw ///
>             D.(`controls'), nocons ///
>                 absorb(year_month##high_res_mw) ///
>                 cluster(`cluster_vars')
 10.                 
.     reghdfe D.ln_rents c.D.mw_res#i.high_work_mw ///
>             c.D.mw_wkp_tot_17 ///
>             D.(`controls'), nocons ///
>                 absorb(year_month##high_work_mw) ///
>                 cluster(`cluster_vars')
 11. end

. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    131,383
Absorbing 1 HDFE group                            F(  12,     40) =       4.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.0222
                                                  Adj R-squared   =     0.0204
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         41       Root MSE        =     0.0290

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0203672   .0167448    -1.22   0.231    -.0542097    .0134752
             |
public_hou~g#|
         cD. |
mw_wkp_to~17 |
          0  |    .054793   .0285181     1.92   0.062    -.0028442    .1124303
          1  |   .0530799   .0310489     1.71   0.095    -.0096723    .1158322
             |
ln_emp_biz~v |
         D1. |   .0112647   .0050582     2.23   0.032     .0010417    .0214877
             |
 ln_emp_info |
         D1. |     .00125    .003759     0.33   0.741    -.0063472    .0088472
             |
  ln_emp_fin |
         D1. |   .0096027   .0059942     1.60   0.117    -.0025119    .0217174
             |
ln_estcoun~v |
         D1. |   .0017501   .0149245     0.12   0.907    -.0284135    .0319137
             |
ln_estcoun~o |
         D1. |   .0005133   .0053196     0.10   0.924     -.010238    .0112646
             |
ln_estcoun~n |
         D1. |   .0047324   .0075601     0.63   0.535    -.0105471    .0200119
             |
ln_avgwwag~v |
         D1. |   .0028966   .0029199     0.99   0.327    -.0030048     .008798
             |
ln_avgwwag~o |
         D1. |  -.0000998   .0016849    -0.06   0.953    -.0035051    .0033056
             |
ln_avgwwag~n |
         D1. |  -.0020769   .0010578    -1.96   0.057    -.0042147    .0000609
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------------+
                 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------------+---------------------------------------|
   year_month#public_housing |       236           0         236     |
---------------------------------------------------------------------+
(dropped 1 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    131,382
Absorbing 1 HDFE group                            F(  12,     40) =       2.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0062
                                                  R-squared       =     0.0222
                                                  Adj R-squared   =     0.0204
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         41       Root MSE        =     0.0290

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |   -.020239   .0169083    -1.20   0.238     -.054412    .0139339
             |
 high_res_mw#|
         cD. |
mw_wkp_to~17 |
          0  |   .0526385   .0280861     1.87   0.068    -.0041256    .1094026
          1  |   .0572068   .0296039     1.93   0.060    -.0026249    .1170385
             |
ln_emp_biz~v |
         D1. |   .0107685    .005147     2.09   0.043     .0003661    .0211709
             |
 ln_emp_info |
         D1. |    .001352   .0037631     0.36   0.721    -.0062535    .0089575
             |
  ln_emp_fin |
         D1. |   .0090869   .0060212     1.51   0.139    -.0030823    .0212562
             |
ln_estcoun~v |
         D1. |   .0025166   .0149351     0.17   0.867    -.0276683    .0327015
             |
ln_estcoun~o |
         D1. |   .0011308   .0053379     0.21   0.833    -.0096576    .0119191
             |
ln_estcoun~n |
         D1. |   .0042086   .0071478     0.59   0.559    -.0102377    .0186549
             |
ln_avgwwag~v |
         D1. |   .0030055   .0029777     1.01   0.319    -.0030126    .0090236
             |
ln_avgwwag~o |
         D1. |   .0000672   .0016947     0.04   0.969    -.0033579    .0034922
             |
ln_avgwwag~n |
         D1. |  -.0019988   .0010907    -1.83   0.074    -.0042032    .0002056
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------------------+
              Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------------------+---------------------------------------|
   year_month#high_res_mw |       235           0         235     |
------------------------------------------------------------------+
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    131,383
Absorbing 1 HDFE group                            F(  12,     40) =       3.88
Statistics robust to heteroskedasticity           Prob > F        =     0.0006
                                                  R-squared       =     0.0220
                                                  Adj R-squared   =     0.0202
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         41       Root MSE        =     0.0290

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
high_work_mw#|
   cD.mw_res |
          0  |   -.015583   .0175943    -0.89   0.381    -.0511424    .0199764
          1  |  -.0285606   .0180259    -1.58   0.121    -.0649923    .0078712
             |
mw_wkp_to~17 |
         D1. |   .0535796   .0273215     1.96   0.057    -.0016392    .1087984
             |
ln_emp_biz~v |
         D1. |   .0104979   .0051627     2.03   0.049     .0000637    .0209321
             |
 ln_emp_info |
         D1. |    .001407   .0037615     0.37   0.710    -.0061952    .0090092
             |
  ln_emp_fin |
         D1. |   .0096862   .0059445     1.63   0.111     -.002328    .0217004
             |
ln_estcoun~v |
         D1. |   .0011682   .0148044     0.08   0.937    -.0287527    .0310891
             |
ln_estcoun~o |
         D1. |   .0012379   .0052442     0.24   0.815    -.0093609    .0118368
             |
ln_estcoun~n |
         D1. |   .0042608   .0074085     0.58   0.568    -.0107123    .0192339
             |
ln_avgwwag~v |
         D1. |   .0028582   .0030003     0.95   0.347    -.0032057     .008922
             |
ln_avgwwag~o |
         D1. |  -.0000467   .0017045    -0.03   0.978    -.0034916    .0033982
             |
ln_avgwwag~n |
         D1. |  -.0020174   .0010956    -1.84   0.073    -.0042317    .0001968
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------------------+
               Absorbed FE | Categories  - Redundant  = Num. Coefs |
---------------------------+---------------------------------------|
   year_month#high_work_mw |       236           0         236     |
-------------------------------------------------------------------+

. 
end of do-file

 make.py ended: 2022-03-27 08:33:51
