
 make.py started: 2023-08-02 17:37:07 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local incross "../../../drive/derived_large/zipcode"
  3.     local in_hud "../../../drive/base_large/hud_housing_assistance"
  4.     local outstub "../temp"
  5. 
.     use "`in_hud'/zipcode.dta", clear
  6.     keep if program_label == "Public Housing"
  7.     keep if year == 2017
  8.     keep zipcode total_units
  9.     save_data "../temp/public_housing_2017.dta", key(zipcode) replace log(
> none)
 10. 
.     load_and_clean, instub(`instub') incross(`incross')
 11. 
.     save_data "`outstub'/fullbal_sample_with_vars_for_het.dta",     ///
>         key(zipcode year_month) replace log(none)
 12. end

. 
. 
. program load_and_clean
  1.     syntax, instub(str) incross(str)
  2. 
.     use zipcode fullbal_sample_SFCC  ///
>         using "`instub'/zipcode_months.dta", clear
  3.         
.         keep if fullbal_sample_SFCC == 1
  4.         duplicates drop
  5.         
.         tempfile baseline_sample
  6.         save    `baseline_sample'
  7.         
.     use zipcode sh_mw_wkrs_statutory med_hhld_inc_acs2014 n_hhlds_cens2010 //
> /
>                 using "`incross'/zipcode_cross.dta", clear
  8.         
.         merge 1:1 zipcode using `baseline_sample',                 ///
>                 assert(1 3) keep(3) nogen
  9.         merge 1:1 zipcode using "../temp/public_housing_2017.dta", ///
>                 assert(1 2 3) keep(1 3) nogen
 10. 
.     replace total_units       = 0 if missing(total_units)
 11.     gen     sh_public_housing = total_units/n_hhlds_cens2010
 12.         
.     foreach var in sh_mw_wkrs_statutory med_hhld_inc_acs2014 sh_public_housin
> g {
 13.         egen avg_`var' = mean(`var')
 14.         egen sd_`var'  = sd(`var')
 15.                                 
.         gen std_`var' = (`var' - avg_`var')/sd_`var'
 16.     }
 17.         
.         tempfile std_vars
 18.         save    `std_vars'
 19.         
.     define_controls
 20.     local controls     "`r(economic_controls)'"
 21. 
.     use zipcode statefips cbsa year_month zipcode_num ln_rents mw_res  ///
>         mw_wkp_tot_17 fullbal_sample_SFCC `controls'                   ///
>         using "`instub'/zipcode_months.dta", clear
 22.     xtset zipcode_num year_month
 23.                 
.     merge m:1 zipcode using `std_vars', nogen assert(1 3) keep(3)
 24. end

. 
. 
. main
(310,972 observations deleted)
(24,164 observations deleted)
(data now sorted by zipcode)
  variable total_units was double now int
  (37,974 bytes saved)
===============================================================================
File: ../temp/public_housing_2017.dta
Key: zipcode
===============================================================================
  6329:2(60726):1417201667:2500064492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
 total_units |      6,329    164.4508    388.0311          0      10966




(note: file ../temp/public_housing_2017.dta not found)
file ../temp/public_housing_2017.dta saved
(274,409 observations deleted)

Duplicates in terms of all variables

(79,355 observations deleted)
file C:\Users\shermo\AppData\Local\Temp\8\ST_66bc_000002.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           898
        from master                       898  
        from using                          0  

    matched                               447  
    -----------------------------------------
(898 real changes made)
(9 missing values generated)
(82 missing values generated)
(51 missing values generated)
(9 missing values generated)
file C:\Users\shermo\AppData\Local\Temp\8\ST_66bc_000003.tmp saved
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m1 to 2020m6, but with gaps
                delta:  1 month

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           151,184  
    -----------------------------------------
(data now sorted by zipcode year_month)
  (0 bytes saved)
===============================================================================
File: ../temp/fullbal_sample_with_vars_for_het.dta
Key: zipcode year_month
===============================================================================
  151184:32(44472):3320689506:2169973548

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |    151,184    668.7668    33.26308        600        725
 zipcode_num |    151,184    53421.13    29001.43       2109      99577
   statefips |          0
        cbsa |          0
-------------+---------------------------------------------------------
      mw_res |    151,184    2.094302    .1516782   1.981001   2.796671
mw_wkp_to~17 |    151,184     2.09697    .1485789   1.981057   2.742209
    ln_rents |    133,600    .0763131    .4611457  -.8722227   3.100092
ln_emp_biz~v |    143,114    11.14567    1.363482   5.796058   13.38876
 ln_emp_info |    142,354    9.011185    1.532935   2.397895   12.38988
-------------+---------------------------------------------------------
  ln_emp_fin |    143,086    10.20136     1.41832    4.75359   12.89542
ln_estcoun~v |    143,114    8.685269    1.241875   4.127134   10.96353
ln_estcoun~o |    143,114    6.107783    1.331024   1.386294   9.531191
ln_estcoun~n |    143,114    7.983425     1.19925   3.496508   10.33748
ln_avgwwag~v |    143,114    7.088391    .3087373   5.420535   8.432724
-------------+---------------------------------------------------------
ln_avgwwag~o |    142,354    7.269368    .3436672   5.891644   8.906665
ln_avgwwag~n |    143,086    7.243089    .3698844   6.216606   9.163982
fullbal_sa~C |    133,600    .6040419    .4890573          0          1
n_hhlds~2010 |    151,184    16124.82    5854.712          0      48073
med_hhl~2014 |    145,357    60362.17    22850.66      15041   176169.7
-------------+---------------------------------------------------------
sh_mw_wkrs~y |    142,095    .1498804    .0467857   .0132085   .5346981
 total_units |    151,184    73.83693    359.1998          0      10966
sh_public_~g |    150,194    .0041936    .0166307          0   .3458869
avg_sh_mw_~y |    151,184    .1496538           0   .1496538   .1496538
sd_sh_mw_w~y |    151,184    .0468274           0   .0468274   .0468274
-------------+---------------------------------------------------------
std_sh_mw_~y |    142,095    .0048405    .9991106  -2.913794   8.222636
avg_med~2014 |    151,184    60456.92           0   60456.92   60456.92
sd_med_~2014 |    151,184    22922.85           0   22922.85   22922.85
std_med~2014 |    145,357   -.0041335    .9968506  -1.981251   5.047921
avg_sh_pub~g |    151,184    .0043822           0   .0043822   .0043822
-------------+---------------------------------------------------------
sd_sh_publ~g |    151,184    .0173372           0   .0173372   .0173372
std_sh_pub~g |    150,194   -.0108803    .9592514  -.2527651   19.69778




(note: file ../temp/fullbal_sample_with_vars_for_het.dta not found)
file ../temp/fullbal_sample_with_vars_for_het.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.     local instub  "../temp"
  2.     local outstub "../output"
  3. 
.     define_controls
  4.     local controls     "`r(economic_controls)'"
  5.     local cluster_vars "statefips"
  6.     local absorb "year_month"
  7. 
.     use "`instub'/fullbal_sample_with_vars_for_het.dta", clear
  8.     xtset zipcode_num year_month
  9. 
.     estimate_dist_lag_model if fullbal_sample_SFCC == 1,              ///
>         depvar(ln_rents)                                              ///
>         dyn_var(mw_wkp_tot_17) w(0) stat_var(mw_res)                  ///
>         controls(`controls') absorb(`absorb') cluster(`cluster_vars') ///
>         model_name(static_both)
 10.         
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.std_sh_mw_wkrs_statutory ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.std_sh_mw_wkrs_statutory  ///
>         D.(`controls') if fullbal_sample_SFCC == 1, nocons              ///
>         absorb(`absorb') cluster(`cluster_vars')
 11.     process_sum, het_var(std_sh_mw_wkrs_statutory) model(het_mw_shares)
 12.     process_estimates, res_var(mw_res_std_sh_mw_wkrs_statutory)         //
> /
>         wkp_var(mw_wkp_std_sh_mw_wkrs_statutory) model(het_mw_shares)
 13. 
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.std_med_hhld_inc_acs2014 ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.std_med_hhld_inc_acs2014  ///
>         D.(`controls') if fullbal_sample_SFCC == 1, nocons              ///
>         absorb(`absorb') cluster(`cluster_vars')
 14.     process_sum, het_var(std_med_hhld_inc_acs2014) model(het_med_inc)   
 15.     process_estimates, res_var(mw_res_std_med_hhld_inc)                 //
> /
>         wkp_var(mw_wkp_std_med_hhld_inc) model(het_med_inc)
 16. 
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.std_sh_public_housing    ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.std_sh_public_housing     ///
>         D.(`controls') if fullbal_sample_SFCC == 1, nocons              ///
>         absorb(year_month) cluster(`cluster_vars')
 17.         process_sum, het_var(std_sh_public_housing) model(het_public_hous)
>     
 18.     process_estimates, res_var(mw_res_high_public_hous)                 //
> /
>         wkp_var(mw_wkp_high_public_hous) model(het_public_hous)
 19. 
.     use "../temp/estimates_static_both.dta", clear
 20.     append using "../temp/estimates_het_mw_shares.dta"
 21.     append using "../temp/estimates_het_public_hous.dta"
 22.     append using "../temp/estimates_het_med_inc.dta"
 23.     export delimited "../output/estimates_het.csv", replace
 24. end

. 
. program process_sum
  1.     syntax, het_var(str) model(str)
  2. 
.     lincom c.D.mw_res + c.D.mw_res#c.`het_var'
  3.     matrix sum_res = (0, r(estimate), r(se))
  4.     lincom c.D.mw_wkp_tot_17 + c.D.mw_wkp_tot_17#c.`het_var'
  5.     matrix sum_wkp = (0, r(estimate), r(se))
  6.     matrix sum = (sum_res \ sum_wkp)
  7.     
.     preserve
  8.         svmat sum
  9.         keep sum1 sum2 sum3
 10.         rename (sum1 sum2 sum3) (at b se)
 11.         drop if missing(at)
 12.         
.         gen     var = "sum_res"  
 13.         replace var = "sum_wkp" if _n == 2
 14.         gen model = "`model'"
 15. 
.         save "../temp/sum_`model'.dta", replace
 16.     restore
 17. end

. 
. program process_estimates
  1.     syntax, res_var(str) wkp_var(str) model(str)
  2. 
.     preserve
  3.         local N = e(N)
  4.         local r2 = e(r2)
  5. 
.         qui coefplot, vertical base gen
  6.         keep __at __b __se
  7.         rename (__at __b __se) (at b se)
  8.         keep if _n <= 4
  9.         keep if !missing(at)
 10. 
.         replace at = 0
 11.         replace at = 1 if inlist(_n, 2, 4)
 12. 
.         gen     var = "`res_var'"  
 13.         replace var = "`wkp_var'" if _n >= 3
 14. 
.         gen N = `N'
 15.         gen r2 = `r2'
 16.         gen model = "`model'"
 17.         
.         append using "../temp/sum_`model'.dta"
 18.         save "../temp/estimates_`model'.dta", replace
 19.     restore
 20. end

. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m1 to 2020m6
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     80,241
Absorbing 1 HDFE group                            F(  11,     40) =       3.78
Statistics robust to heteroskedasticity           Prob > F        =     0.0009
                                                  R-squared       =     0.0213
                                                  Adj R-squared   =     0.0204
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0296

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp_to~17 |
         D1. |   .0685098   .0288229     2.38   0.022     .0102567     .126763
             |
      mw_res |
         D1. |  -.0218668   .0175389    -1.25   0.220    -.0573143    .0135808
             |
ln_emp_biz~v |
         D1. |    .015979   .0078822     2.03   0.049     .0000486    .0319095
             |
 ln_emp_info |
         D1. |   .0025091   .0044261     0.57   0.574    -.0064363    .0114545
             |
  ln_emp_fin |
         D1. |    .008268   .0073263     1.13   0.266     -.006539    .0230751
             |
ln_estcoun~v |
         D1. |   .0019985    .020679     0.10   0.923    -.0397953    .0437923
             |
ln_estcoun~o |
         D1. |   .0032411   .0078392     0.41   0.681    -.0126025    .0190846
             |
ln_estcoun~n |
         D1. |  -.0057908   .0188269    -0.31   0.760    -.0438413    .0322597
             |
ln_avgwwag~v |
         D1. |   .0023012   .0036333     0.63   0.530     -.005042    .0096444
             |
ln_avgwwag~o |
         D1. |  -.0002851   .0016648    -0.17   0.865    -.0036498    .0030797
             |
ln_avgwwag~n |
         D1. |  -.0019555     .00151    -1.29   0.203    -.0050074    .0010964
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        60           0          60     |
-----------------------------------------------------+
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(151,182 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(2 real changes made)
(1 real change made)
(note: file ../temp/estimates_static_both.dta not found)
file ../temp/estimates_static_both.dta saved

 ( 1)  D.mw_wkp_tot_17 + D.mw_res = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0466431   .0158352     2.95   0.005      .014639    .0786472
------------------------------------------------------------------------------
number of observations will be reset to 1
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 1
(note: file ../temp/estimates_static_both_sumsum_from0.dta not found)
file ../temp/estimates_static_both_sumsum_from0.dta saved
(note: variable at was byte, now float to accommodate using data's values)
file ../temp/estimates_static_both.dta saved
(note: file ../temp/estimates_static_both.csv not found)
file ../temp/estimates_static_both.csv saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     75,329
Absorbing 1 HDFE group                            F(  13,     38) =       9.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0212
                                                  Adj R-squared   =     0.0202
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         39       Root MSE        =     0.0296

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0483409   .0196067    -2.47   0.018    -.0880325   -.0086493
             |
   cD.mw_res#|
          c. |
std_sh_mw_~y |  -.0800615    .039169    -2.04   0.048    -.1593551   -.0007679
             |
mw_wkp_to~17 |
         D1. |   .0969021   .0300317     3.23   0.003     .0361061    .1576981
             |
         cD. |
mw_wkp_to~17#|
          c. |
std_sh_mw_~y |   .0841259   .0445061     1.89   0.066    -.0059719    .1742238
             |
ln_emp_biz~v |
         D1. |   .0160749   .0072194     2.23   0.032       .00146    .0306897
             |
 ln_emp_info |
         D1. |   .0009379   .0040207     0.23   0.817    -.0072016    .0090774
             |
  ln_emp_fin |
         D1. |   .0062643   .0065614     0.95   0.346    -.0070184    .0195471
             |
ln_estcoun~v |
         D1. |  -.0054114   .0211768    -0.26   0.800    -.0482815    .0374587
             |
ln_estcoun~o |
         D1. |   .0040757   .0086782     0.47   0.641    -.0134923    .0216438
             |
ln_estcoun~n |
         D1. |  -.0031571    .016462    -0.19   0.849    -.0364827    .0301685
             |
ln_avgwwag~v |
         D1. |   .0010609   .0037733     0.28   0.780    -.0065777    .0086995
             |
ln_avgwwag~o |
         D1. |  -.0003534   .0016834    -0.21   0.835    -.0037614    .0030545
             |
ln_avgwwag~n |
         D1. |  -.0011037   .0015561    -0.71   0.482    -.0042538    .0020465
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        60           0          60     |
-----------------------------------------------------+

 ( 1)  D.mw_res + cD.mw_res#c.std_sh_mw_wkrs_statutory = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1284024    .053618    -2.39   0.022    -.2369463   -.0198584
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_tot_17 + cD.mw_wkp_tot_17#c.std_sh_mw_wkrs_statutory = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .181028   .0647333     2.80   0.008     .0499823    .3120738
------------------------------------------------------------------------------
(151,182 observations deleted)
(1 real change made)
(note: file ../temp/sum_het_mw_shares.dta not found)
file ../temp/sum_het_mw_shares.dta saved
(151,180 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: variable at was byte, now float to accommodate using data's values)
(note: file ../temp/estimates_het_mw_shares.dta not found)
file ../temp/estimates_het_mw_shares.dta saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     77,197
Absorbing 1 HDFE group                            F(  13,     39) =       5.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0211
                                                  Adj R-squared   =     0.0202
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         40       Root MSE        =     0.0295

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0377464   .0253929    -1.49   0.145    -.0891084    .0136157
             |
   cD.mw_res#|
          c. |
std_med~2014 |   .0506329   .0266173     1.90   0.065    -.0032056    .1044714
             |
mw_wkp_to~17 |
         D1. |   .0862158   .0355619     2.42   0.020     .0142851    .1581465
             |
         cD. |
mw_wkp_to~17#|
          c. |
std_med~2014 |  -.0608132   .0344205    -1.77   0.085    -.1304352    .0088088
             |
ln_emp_biz~v |
         D1. |    .015498   .0078586     1.97   0.056    -.0003976    .0313937
             |
 ln_emp_info |
         D1. |   .0022206   .0046063     0.48   0.632    -.0070966    .0115377
             |
  ln_emp_fin |
         D1. |   .0069738   .0074169     0.94   0.353    -.0080283    .0219758
             |
ln_estcoun~v |
         D1. |   .0051278   .0197844     0.26   0.797      -.03489    .0451456
             |
ln_estcoun~o |
         D1. |    .003457   .0078462     0.44   0.662    -.0124135    .0193275
             |
ln_estcoun~n |
         D1. |  -.0043834   .0177561    -0.25   0.806    -.0402986    .0315317
             |
ln_avgwwag~v |
         D1. |   .0032511   .0038419     0.85   0.403    -.0045199     .011022
             |
ln_avgwwag~o |
         D1. |    .000029   .0016993     0.02   0.986    -.0034083    .0034663
             |
ln_avgwwag~n |
         D1. |   -.001909   .0017164    -1.11   0.273    -.0053808    .0015628
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        60           0          60     |
-----------------------------------------------------+

 ( 1)  D.mw_res + cD.mw_res#c.std_med_hhld_inc_acs2014 = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0128865   .0205982     0.63   0.535    -.0287774    .0545504
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_tot_17 + cD.mw_wkp_tot_17#c.std_med_hhld_inc_acs2014 = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0254026   .0266223     0.95   0.346    -.0284461    .0792513
------------------------------------------------------------------------------
(151,182 observations deleted)
(1 real change made)
(note: file ../temp/sum_het_med_inc.dta not found)
file ../temp/sum_het_med_inc.dta saved
(151,180 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: variable at was byte, now float to accommodate using data's values)
(note: file ../temp/estimates_het_med_inc.dta not found)
file ../temp/estimates_het_med_inc.dta saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     79,701
Absorbing 1 HDFE group                            F(  13,     39) =       4.76
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.0213
                                                  Adj R-squared   =     0.0204
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         40       Root MSE        =     0.0295

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0158416   .0149943    -1.06   0.297    -.0461706    .0144873
             |
   cD.mw_res#|
          c. |
std_sh_pub~g |  -.0336422   .0329747    -1.02   0.314    -.1003397    .0330554
             |
mw_wkp_to~17 |
         D1. |   .0644767     .02578     2.50   0.017     .0123317    .1166216
             |
         cD. |
mw_wkp_to~17#|
          c. |
std_sh_pub~g |   .0306369   .0374098     0.82   0.418    -.0450315    .1063053
             |
ln_emp_biz~v |
         D1. |   .0159133   .0078866     2.02   0.051    -.0000389    .0318654
             |
 ln_emp_info |
         D1. |    .002603   .0044016     0.59   0.558    -.0063001    .0115061
             |
  ln_emp_fin |
         D1. |   .0084598   .0073724     1.15   0.258    -.0064523    .0233719
             |
ln_estcoun~v |
         D1. |    .003947   .0203373     0.19   0.847    -.0371891    .0450832
             |
ln_estcoun~o |
         D1. |   .0033139   .0078676     0.42   0.676    -.0125999    .0192276
             |
ln_estcoun~n |
         D1. |  -.0066031   .0188258    -0.35   0.728    -.0446818    .0314757
             |
ln_avgwwag~v |
         D1. |   .0019873   .0036598     0.54   0.590    -.0054153    .0093899
             |
ln_avgwwag~o |
         D1. |  -.0002157   .0016625    -0.13   0.897    -.0035784     .003147
             |
ln_avgwwag~n |
         D1. |  -.0015821   .0015625    -1.01   0.318    -.0047425    .0015783
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        60           0          60     |
-----------------------------------------------------+

 ( 1)  D.mw_res + cD.mw_res#c.std_sh_public_housing = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0494838    .034283    -1.44   0.157    -.1188277    .0198601
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_tot_17 + cD.mw_wkp_tot_17#c.std_sh_public_housing = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0951136   .0456168     2.09   0.044     .0028448    .1873823
------------------------------------------------------------------------------
(151,182 observations deleted)
(1 real change made)
(note: file ../temp/sum_het_public_hous.dta not found)
file ../temp/sum_het_public_hous.dta saved
(151,180 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: variable at was byte, now float to accommodate using data's values)
(note: file ../temp/estimates_het_public_hous.dta not found)
file ../temp/estimates_het_public_hous.dta saved
(note: variable var was str13, now str31 to accommodate using data's values)
(note: variable model was str11, now str13 to accommodate using data's
       values)
(note: variable model was str13, now str15 to accommodate using data's
       values)
(note: file ../output/estimates_het.csv not found)
file ../output/estimates_het.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(data.table)
Warning message:
package 'data.table' was built under R version 4.1.3 
> library(haven)
> 
> main <- function() {
+   instub  <- "../output/"
+   outstub <- "../output/"
+   
+   est <- fread(file.path(instub, "estimates_het.csv"))
+   dt  <- read_dta("../temp/fullbal_sample_with_vars_for_het.dta")
+   setDT(dt)
+   
+   txt <- c("<tab:heterogeneity>")
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 0,]$b,
+                  est[model == "het_med_inc"    & var == "mw_res_std_med_hhld_inc" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 0,]$se,
+                  est[model == "het_med_inc"    & var == "mw_res_std_med_hhld_inc" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_med_inc" & var == "mw_res_std_med_hhld_inc" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_med_inc" & var == "mw_res_std_med_hhld_inc" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$b,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$se,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_med_inc" & var == "mw_wkp_std_med_hhld_inc" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_med_inc" & var == "mw_wkp_std_med_hhld_inc" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+    txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+    
+    txt <- c(txt, 
+             paste(unique(dt$avg_sh_mw_wkrs_statutory),
+                   unique(dt$avg_med_hhld_inc_acs2014),
+                   unique(dt$avg_sh_public_housing),
+                   sep = "\t"))
+    
+    txt <- c(txt, 
+             paste(unique(dt$sd_sh_mw_wkrs_statutory),
+                   unique(dt$sd_med_hhld_inc_acs2014),
+                   unique(dt$sd_sh_public_housing),
+                   sep = "\t"))
+    
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$r2,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$r2,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$r2,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$r2,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$N,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$N,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$N,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$N,
+                  sep = "\t"))
+ 
+   fileConn <- file(file.path(outstub, "heterogeneity.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   3.59    1.10    5.84 


Execute:  StataMP-64 /e do "./make_autofill_values.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./make_autofill_values.do 

. clear all

. version 15

. set more off

. 
. program main
  1.     local in_estimates  "../output"
  2. 
.     import delimited `in_estimates'/estimates_het.csv
  3. 
.     keep if model == "het_mw_shares" & at == 0
  4. 
.     qui sum b if var == "mw_res_std_sh_mw_wkrs_statutory"
  5.     local tilde_gamma_zero = r(mean)
  6.     qui sum se if var == "mw_res_std_sh_mw_wkrs_statutory"
  7.     local tilde_gamma_zero_se = r(mean)
  8. 
.     qui sum b if var == "mw_wkp_std_sh_mw_wkrs_statutory"
  9.     local tilde_beta_zero = r(mean)
 10.     qui sum se if var == "mw_wkp_std_sh_mw_wkrs_statutory"
 11.     local tilde_beta_zero_se = r(mean)
 12. 
.     qui sum b if var == "sum_res"
 13.     local tilde_gamma_zero_plus_one = r(mean)
 14.     qui sum se if var == "sum_res"
 15.     local tilde_gamma_zero_plus_one_se = r(mean)
 16. 
.     qui sum b if var == "sum_wkp"
 17.     local tilde_beta_zero_plus_one = r(mean)
 18.     qui sum se if var == "sum_wkp"
 19.     local tilde_beta_zero_plus_one_se = r(mean)
 20. 
.     cap file close f
 21.     file open   f using "../output/autofill_heterogeneity.tex", write repl
> ace
 22.     file write  f "\newcommand{\TildeGammaZero}{"               %4.3f  (`t
> ilde_gamma_zero')             "}" _n
 23.     file write  f "\newcommand{\TildeGammaZeroSE}{"             %4.3f  (`t
> ilde_gamma_zero_se')          "}" _n
 24.     file write  f "\newcommand{\TildeBetaZero}{"                %4.3f  (`t
> ilde_beta_zero')              "}" _n
 25.     file write  f "\newcommand{\TildeBetaZeroSE}{"              %4.3f  (`t
> ilde_beta_zero_se')           "}" _n
 26.     file write  f "\newcommand{\TildeGammaZeroPlusGammaOne}{"   %4.3f  (`t
> ilde_gamma_zero_plus_one')    "}" _n
 27.     file write  f "\newcommand{\TildeGammaZeroPlusGammaOneSE}{" %4.3f  (`t
> ilde_gamma_zero_plus_one_se') "}" _n
 28.     file write  f "\newcommand{\TildeBetaZeroPlusBetaOne}{"     %4.3f  (`t
> ilde_beta_zero_plus_one')     "}" _n
 29.     file write  f "\newcommand{\TildeBetaZeroPlusBetaOneSE}{"   %4.3f  (`t
> ilde_beta_zero_plus_one_se')  "}" _n
 30.     file close  f
 31. end

. 
. main
(7 vars, 21 obs)
(17 observations deleted)
(note: file ../output/autofill_heterogeneity.tex not found)

. 
end of do-file

 make.py ended: 2023-08-02 17:37:38
