
 make.py started: 2022-05-18 16:33:36 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local incross "../../../drive/derived_large/zipcode"
  3.     local in_hud "../../../drive/base_large/hud_housing_assistance"
  4.     local outstub "../temp"
  5. 
.     use "`in_hud'/zipcode.dta", clear
  6.     keep if program_label == "Public Housing"
  7.     keep if year == 2017
  8.     keep zipcode total_units
  9.     save_data "`outstub'/public_housing_2017.dta", key(zipcode) replace lo
> g(none)
 10. 
.     load_and_clean, instub(`instub') incross(`incross')
 11.     gen high_res_mw  = sh_res_underHS_above_med*sh_res_under1250_above_med
 12.     gen high_work_mw = sh_workers_underHS_above_med*sh_workers_under1250_a
> bove_med
 13. 
.     merge m:1 zipcode using "`outstub'/public_housing_2017.dta",    ///
>         nogen keep(1 3)
 14.     gen public_housing = (total_units > 0) if !missing(total_units)
 15.     replace public_housing = 0 if missing(total_units)
 16. 
.     save_data "`outstub'/fullbal_sample_with_vars_for_het.dta",     ///
>         key(zipcode year_month) replace log(none)
 17. end

. 
. 
. program load_and_clean
  1.     syntax, instub(str) incross(str)
  2. 
.     define_controls
  3.     local controls     "`r(economic_controls)'"
  4. 
.     use zipcode statefips cbsa year_month zipcode_num ln_rents mw_res  ///
>         mw_wkp_tot_17 fullbal_sample_SFCC `controls'                   ///
>         using "`instub'/zipcode_months.dta" if fullbal_sample_SFCC == 1, clea
> r
  5.     drop fullbal_sample_SFCC
  6.     xtset zipcode_num year_month
  7. 
.     merge m:1 zipcode using "`incross'/zipcode_cross.dta", nogen       ///
>         keep(3) keepusing(sh_mw_wkrs_statutory sh_workers_under29_2014 ///
>             sh_residents_under29_2014 sh_residents_underHS_2014        ///
>             sh_residents_under1250_2014 sh_workers_underHS_2014        ///
>             sh_workers_under1250_2014 sh_residents_accomm_food_2014    ///
>             sh_workers_accomm_food_2014)
  8.     rename *_2014 *
  9.     rename *residents* *res*
 10. 
.     foreach var in sh_mw_wkrs_statutory sh_workers_accomm_food           ///
>                    sh_workers_underHS sh_res_accomm_food sh_res_underHS  ///
>                    sh_res_under1250 sh_workers_under1250 {
 11.         bys statefips: egen `var'_med = median(`var')
 12.         gen `var'_above_med = (`var'   > `var'_med)
 13.         drop `var'_med
 14. 
.         gen resint_`var' = mw_res*`var'_above_med
 15.         gen wkpint_`var' = mw_wkp_tot_17*`var'_above_med
 16.     }
 17. end

. 
. 
. main
(310,972 observations deleted)
(24,164 observations deleted)
(data now sorted by zipcode)
  variable total_units was double now int
  (37,974 bytes saved)
===============================================================================
File: ../temp/public_housing_2017.dta
Key: zipcode
===============================================================================
  6329:2(60726):1417201667:2500064492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
 total_units |      6,329    164.4508    388.0311          0      10966




(note: file ../temp/public_housing_2017.dta not found)
file ../temp/public_housing_2017.dta saved
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2015m1 to 2019m12
                delta:  1 month

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            80,700  
    -----------------------------------------
(600 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                        53,880
        from master                    53,880  
        from using                          0  

    matched                            26,820  
    -----------------------------------------
(53,880 missing values generated)
(53,880 real changes made)
(data now sorted by zipcode year_month)
  variable sh_mw_wkrs_statutory_above_med was float now byte
  variable sh_workers_accomm_food_above_med was float now byte
  variable sh_workers_underHS_above_med was float now byte
  variable sh_res_accomm_food_above_med was float now byte
  variable sh_res_underHS_above_med was float now byte
  variable sh_res_under1250_above_med was float now byte
  variable sh_workers_under1250_above_med was float now byte
  variable high_res_mw was float now byte
  variable high_work_mw was float now byte
  variable public_housing was float now byte
  (2,421,000 bytes saved)
===============================================================================
File: ../temp/fullbal_sample_with_vars_for_het.dta
Key: zipcode year_month
===============================================================================
  80700:51(68190):2195929668:1045875458

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |     80,700       689.5    17.31821        660        719
 zipcode_num |     80,700    53665.63    29070.98       2109      99577
   statefips |          0
        cbsa |          0
-------------+---------------------------------------------------------
      mw_res |     80,700    2.132035    .1678545   1.981001   2.772589
mw_wkp_to~17 |     80,700    2.135939    .1631903   1.981412   2.694137
    ln_rents |     80,700    .1368194    .4708669  -.7634219   3.100092
ln_emp_biz~v |     80,700    11.19374    1.376256   6.021023   13.38876
 ln_emp_info |     80,352    9.011645    1.567368   2.397895   12.38988
-------------+---------------------------------------------------------
  ln_emp_fin |     80,688    10.22864    1.434146    4.75359   12.89542
ln_estcoun~v |     80,700    8.713603     1.24719   4.356709   10.96353
ln_estcoun~o |     80,700    6.125135    1.351283   1.609438   9.531191
ln_estcoun~n |     80,700    8.008003    1.208489   3.663562   10.33748
ln_avgwwag~v |     80,700    7.143119    .3080602   5.726848   8.178078
-------------+---------------------------------------------------------
ln_avgwwag~o |     80,352    7.327531    .3554562   5.891644   8.906665
ln_avgwwag~n |     80,688    7.311874    .3682792   6.326149   9.163982
sh_mw_wkrs~y |     75,780    .1496538    .0468091   .0132085   .5346981
sh_res_un~29 |     80,700     .222439     .037931   .1175516   .4469967
sh_res_~1250 |     80,700    .2261313    .0474313   .0777202    .385433
-------------+---------------------------------------------------------
sh_res_und~S |     80,700    .1030454    .0310812   .0454065   .2485696
sh_res_ac~od |     80,700    .1048834    .0419784   .0483592   .3872122
sh_worker~29 |     80,700     .244581    .0490624   .1078271   .4348348
sh_work~1250 |     80,700    .2709894    .0786266    .046502     .53989
sh_workers~S |     80,700    .1115221    .0323393   .0490927   .3340807
-------------+---------------------------------------------------------
sh_worker~od |     80,700    .1234222    .0731471   .0044248   .7661766
sh_mw_wkrs~d |     80,700    .5211896    .4995539          0          1
resint_sh_~y |     80,700    1.109816     1.07016          0    2.74663
wkpint_sh_~y |     80,700    1.111552     1.07171          0   2.680206
sh_workers.. |     80,700    .4996283     .500003          0          1
-------------+---------------------------------------------------------
resint_sh_.. |     80,700    1.065262    1.072601          0   2.772589
wkpint_sh_.. |     80,700    1.066716    1.073703          0   2.689819
sh_workers.. |     80,700    .4988848    .5000019          0          1
r~rs_underHS |     80,700    1.063858    1.072672          0    2.74663
w~rs_underHS |     80,700    1.065685    1.074163          0   2.682079
-------------+---------------------------------------------------------
sh_res_ac~ed |     80,700    .5018587    .4999996          0          1
resint_sh_.. |     80,700    1.069683      1.0721          0   2.772589
wkpint_sh_.. |     80,700     1.07096    1.073098          0   2.694137
sh_res_und.. |     80,700    .5003717     .500003          0          1
r~es_underHS |     80,700    1.066218    1.071732          0    2.74663
-------------+---------------------------------------------------------
w~es_underHS |     80,700    1.067693    1.072938          0   2.680206
sh_res_und.. |     80,700    .4988848    .5000019          0          1
resint_sh_.. |     80,700    1.062945    1.071676          0    2.70805
wkpint_sh_.. |     80,700    1.063883    1.072385          0   2.675503
sh_workers.. |     80,700    .4988848    .5000019          0          1
-------------+---------------------------------------------------------
resint_sh_.. |     80,700    1.062596    1.071255          0    2.74663
wkpint_sh_.. |     80,700    1.064063    1.072521          0   2.682079
 high_res_mw |     80,700    .3568773    .4790811          0          1
high_work_mw |     80,700     .270632     .444289          0          1
 total_units |     26,820     232.047    616.2516          0      10966
-------------+---------------------------------------------------------
public_hou~g |     80,700     .330855    .4705239          0          1




(note: file ../temp/fullbal_sample_with_vars_for_het.dta not found)
file ../temp/fullbal_sample_with_vars_for_het.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.     local instub  "../temp"
  2.     local outstub "../output"
  3. 
.     define_controls
  4.     local controls     "`r(economic_controls)'"
  5.     local cluster_vars "statefips"
  6.     local absorb "year_month"
  7. 
.     use "`instub'/fullbal_sample_with_vars_for_het.dta", clear
  8.     xtset zipcode_num year_month
  9. 
.     estimate_dist_lag_model, depvar(ln_rents)                         ///
>         dyn_var(mw_wkp_tot_17) w(0) stat_var(mw_res)                  ///
>         controls(`controls') absorb(`absorb') cluster(`cluster_vars') ///
>         model_name(static_both)
 10.         
.     reghdfe D.ln_rents c.D.mw_res#ib0.high_work_mw                    ///
>         c.D.mw_wkp_tot_17#ib0.high_res_mw                             ///
>         D.(`controls'), nocons                                        ///
>         absorb(`absorb'##high_work_mw##high_res_mw)                   ///
>         cluster(`cluster_vars')
 11.     
.     process_estimates, res_var(mw_res_high_work_mw)                   ///
>         wkp_var(mw_wkp_high_res_mw) model(het_mw_shares)
 12. 
.     reghdfe D.ln_rents c.D.mw_res#ib0.public_housing                  ///
>         c.D.mw_wkp_tot_17#ib0.public_housing                          ///
>         D.(`controls'), nocons                                        ///
>         absorb(year_month##public_housing) cluster(`cluster_vars')
 13.     
.     process_estimates, res_var(mw_res_high_public_hous)               ///
>         wkp_var(mw_wkp_high_public_hous) model(het_public_hous)
 14. 
.     use "../temp/estimates_static_both.dta", clear
 15.     append using "../temp/estimates_het_mw_shares.dta"
 16.     append using "../temp/estimates_het_public_hous.dta"
 17.     export delimited "../output/estimates_het.csv", replace
 18. end

. 
. program process_estimates
  1.     syntax, res_var(str) wkp_var(str) model(str)
  2. 
.     preserve
  3.         local N = e(N)
  4.         local r2 = e(r2)
  5. 
.         qui coefplot, vertical base gen
  6.         keep __at __b __se
  7.         rename (__at __b __se) (at b se)
  8.         keep if _n <= 4
  9.         keep if !missing(at)
 10. 
.         replace at = 0
 11.         replace at = 1 if inlist(_n, 2, 4)
 12. 
.         gen     var = "`res_var'"  
 13.         replace var = "`wkp_var'" if _n >= 3
 14. 
.         gen N = `N'
 15.         gen r2 = `r2'
 16.         gen model = "`model'"
 17. 
.         save "../temp/estimates_`model'.dta", replace
 18.     restore
 19. end

. 
. main
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2015m1 to 2019m12
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     78,912
Absorbing 1 HDFE group                            F(  11,     40) =       3.54
Statistics robust to heteroskedasticity           Prob > F        =     0.0016
                                                  R-squared       =     0.0216
                                                  Adj R-squared   =     0.0207
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0296

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp_to~17 |
         D1. |   .0682117   .0306343     2.23   0.032     .0062974     .130126
             |
      mw_res |
         D1. |  -.0201341   .0200309    -1.01   0.321     -.060618    .0203498
             |
ln_emp_biz~v |
         D1. |   .0182433   .0087398     2.09   0.043     .0005795    .0359071
             |
 ln_emp_info |
         D1. |   .0023754   .0044165     0.54   0.594    -.0065507    .0113015
             |
  ln_emp_fin |
         D1. |   .0113777   .0078073     1.46   0.153    -.0044015    .0271569
             |
ln_estcoun~v |
         D1. |   .0126512   .0176521     0.72   0.478    -.0230251    .0483274
             |
ln_estcoun~o |
         D1. |     .00356   .0088167     0.40   0.689    -.0142592    .0213792
             |
ln_estcoun~n |
         D1. |  -.0125342   .0194271    -0.65   0.522    -.0517979    .0267295
             |
ln_avgwwag~v |
         D1. |   .0024465   .0041595     0.59   0.560    -.0059602    .0108531
             |
ln_avgwwag~o |
         D1. |  -.0004863   .0016389    -0.30   0.768    -.0037987     .002826
             |
ln_avgwwag~n |
         D1. |  -.0021329   .0015495    -1.38   0.176    -.0052646    .0009988
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        59           0          59     |
-----------------------------------------------------+
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(80,698 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(2 real changes made)
(1 real change made)
(note: file ../temp/estimates_static_both.dta not found)
file ../temp/estimates_static_both.dta saved

 ( 1)  D.mw_wkp_tot_17 + D.mw_res = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0480776   .0165683     2.90   0.006     .0145919    .0815633
------------------------------------------------------------------------------
number of observations will be reset to 1
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 1
(note: file ../temp/estimates_static_both_sumsum_from0.dta not found)
file ../temp/estimates_static_both_sumsum_from0.dta saved
(note: variable at was byte, now float to accommodate using data's values)
file ../temp/estimates_static_both.dta saved
(note: file ../temp/estimates_static_both.csv not found)
file ../temp/estimates_static_both.csv saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     78,912
Absorbing 1 HDFE group                            F(  13,     40) =       5.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0243
                                                  Adj R-squared   =     0.0212
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0296

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
high_work_mw#|
   cD.mw_res |
          0  |  -.0181382    .021738    -0.83   0.409    -.0620724    .0257959
          1  |  -.0204608   .0202849    -1.01   0.319    -.0614581    .0205365
             |
 high_res_mw#|
         cD. |
mw_wkp_to~17 |
          0  |   .0660105    .033256     1.98   0.054    -.0012025    .1332234
          1  |   .0675355   .0303764     2.22   0.032     .0061424    .1289286
             |
ln_emp_biz~v |
         D1. |   .0169698   .0085951     1.97   0.055    -.0004014    .0343411
             |
 ln_emp_info |
         D1. |    .002398   .0044144     0.54   0.590    -.0065238    .0113198
             |
  ln_emp_fin |
         D1. |   .0121703   .0076718     1.59   0.121    -.0033351    .0276757
             |
ln_estcoun~v |
         D1. |   .0129095   .0175405     0.74   0.466    -.0225412    .0483602
             |
ln_estcoun~o |
         D1. |   .0035875   .0087738     0.41   0.685    -.0141451      .02132
             |
ln_estcoun~n |
         D1. |  -.0111802   .0185088    -0.60   0.549    -.0485879    .0262276
             |
ln_avgwwag~v |
         D1. |   .0026951   .0041046     0.66   0.515    -.0056006    .0109908
             |
ln_avgwwag~o |
         D1. |  -.0005138   .0016759    -0.31   0.761    -.0039009    .0028732
             |
ln_avgwwag~n |
         D1. |  -.0021095   .0015668    -1.35   0.186     -.005276    .0010571
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------------------------------
> --+
                             Absorbed FE | Categories  - Redundant  = Num. Coef
> s                                                                            
>   |
-----------------------------------------+-------------------------------------
> --|
     year_month#high_work_mw#high_res_mw |       236           0         236   
>                                                                              
>   |
-------------------------------------------------------------------------------
> --+
(80,696 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: file ../temp/estimates_het_mw_shares.dta not found)
file ../temp/estimates_het_mw_shares.dta saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     78,912
Absorbing 1 HDFE group                            F(  13,     40) =       4.20
Statistics robust to heteroskedasticity           Prob > F        =     0.0002
                                                  R-squared       =     0.0226
                                                  Adj R-squared   =     0.0210
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0296

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
public_hou~g#|
   cD.mw_res |
          0  |   .0061092   .0258634     0.24   0.814    -.0461626     .058381
          1  |   -.067518   .0598448    -1.13   0.266    -.1884689    .0534328
             |
public_hou~g#|
         cD. |
mw_wkp_to~17 |
          0  |     .04505   .0319014     1.41   0.166    -.0194253    .1095252
          1  |   .1101459   .0645116     1.71   0.096    -.0202369    .2405287
             |
ln_emp_biz~v |
         D1. |   .0188183   .0083433     2.26   0.030     .0019558    .0356808
             |
 ln_emp_info |
         D1. |   .0023484    .004353     0.54   0.593    -.0064494    .0111462
             |
  ln_emp_fin |
         D1. |   .0117626   .0077961     1.51   0.139    -.0039938    .0275191
             |
ln_estcoun~v |
         D1. |   .0135699   .0174334     0.78   0.441    -.0216643    .0488041
             |
ln_estcoun~o |
         D1. |   .0031417   .0088644     0.35   0.725    -.0147739    .0210574
             |
ln_estcoun~n |
         D1. |  -.0121796   .0198092    -0.61   0.542    -.0522155    .0278563
             |
ln_avgwwag~v |
         D1. |    .002326   .0040575     0.57   0.570    -.0058745    .0105264
             |
ln_avgwwag~o |
         D1. |  -.0005905    .001684    -0.35   0.728    -.0039939    .0028129
             |
ln_avgwwag~n |
         D1. |  -.0022421   .0015111    -1.48   0.146    -.0052962     .000812
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------------+
                 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------------+---------------------------------------|
   year_month#public_housing |       118           0         118     |
---------------------------------------------------------------------+
(80,696 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: file ../temp/estimates_het_public_hous.dta not found)
file ../temp/estimates_het_public_hous.dta saved
(note: variable var was str13, now str19 to accommodate using data's values)
(note: variable model was str11, now str13 to accommodate using data's
       values)
(note: variable var was str19, now str23 to accommodate using data's values)
(note: variable model was str13, now str15 to accommodate using data's
       values)
(note: file ../output/estimates_het.csv not found)
file ../output/estimates_het.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(data.table)
> 
> main <- function() {
+   instub  <- "../output/"
+   outstub <- "../output/"
+   
+   est <- fread(file.path(instub, "estimates_het.csv"))
+   
+   txt <- c("<tab:heterogeneity>")
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_res_high_work_mw" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_res_high_work_mw" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_res_high_work_mw" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_res_high_work_mw" & at == 1,]$se, 
+                  sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_wkp_high_res_mw" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_wkp_high_res_mw" & at == 1,]$se, 
+                  sep = "\t"))
+   
+    txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$r2,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$r2,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$r2, 
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$N,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$N,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$N, 
+                  sep = "\t"))
+ 
+   fileConn <- file(file.path(outstub, "heterogeneity.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.71    0.12    0.95 

 make.py ended: 2022-05-18 16:33:57
