
 make.py started: 2022-05-04 11:12:45 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local incross "../../../drive/derived_large/zipcode"
  3.     local in_hud "../../../drive/base_large/hud_housing_assistance"
  4.     local outstub "../temp"
  5. 
.     use "`in_hud'/zipcode.dta", clear
  6.     keep if program_label == "Public Housing"
  7.     keep if year == 2017
  8.     keep zipcode total_units
  9.     save_data "`outstub'/public_housing_2017.dta", ///
>         key(zipcode) replace log(none)
 10. 
.     load_and_clean, instub(`instub') incross(`incross')
 11.     gen high_res_mw = sh_res_underHS_above_med*sh_res_under1250_above_med
 12.     gen high_work_mw = sh_workers_underHS_above_med*sh_workers_under1250_a
> bove_med
 13. 
.     merge m:1 zipcode using "`outstub'/public_housing_2017.dta", ///
>         nogen keep(1 3)
 14.     gen public_housing = (total_units > 0) if !missing(total_units)
 15.     replace public_housing = 0 if missing(total_units)
 16. 
.     save_data "`outstub'/fullbal_sample_with_vars_for_het.dta", ///
>         key(zipcode year_month) replace log(none)
 17. end

. 
. 
. program load_and_clean
  1.     syntax, instub(str) incross(str)
  2. 
.     define_controls
  3.     local controls     "`r(economic_controls)'"
  4. 
.     use zipcode statefips cbsa year_month zipcode_num ln_rents mw_res ///
>         mw_wkp_tot_17 fullbal_sample_SFCC `controls' ///
>         using "`instub'/zipcode_months.dta" if fullbal_sample_SFCC, clear
  5.     drop fullbal_sample_SFCC
  6.     xtset zipcode_num year_month
  7. 
.     merge m:1 zipcode using "`incross'/zipcode_cross.dta", nogen ///
>         keep(3) keepusing(sh_mw_wkrs_statutory sh_workers_under29_2013 ///
>         sh_residents_under29_2013 sh_residents_underHS_2013 ///
>         sh_residents_under1250_2013 sh_workers_underHS_2013 ///
>         sh_workers_under1250_2013 sh_residents_accomm_food_2013 ///
>         sh_workers_accomm_food_2013)
  8.     rename *_2013 *
  9.     rename *residents* *res*
 10. 
.     foreach var in sh_mw_wkrs_statutory sh_workers_accomm_food ///
>         sh_workers_underHS sh_res_accomm_food sh_res_underHS ///
>         sh_res_under1250 sh_workers_under1250 {
 11.         bys statefips: egen `var'_med = median(`var')
 12.         gen `var'_above_med = (`var'   > `var'_med)
 13.         drop `var'_med
 14. 
.         gen resint_`var' = mw_res*`var'_above_med
 15.         gen wkpint_`var' = mw_wkp_tot_17*`var'_above_med
 16.     }
 17. end

. 
. 
. main
(310,972 observations deleted)
(24,164 observations deleted)
(data now sorted by zipcode)
  variable total_units was double now int
  (37,974 bytes saved)
===============================================================================
File: ../temp/public_housing_2017.dta
Key: zipcode
===============================================================================
  6329:2(60726):1417201667:2500064492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
 total_units |      6,329    164.4508    388.0311          0      10966




(note: file ../temp/public_housing_2017.dta not found)
file ../temp/public_housing_2017.dta saved
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m1 to 2019m12, but with gaps
                delta:  1 month

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           182,428  
    -----------------------------------------
(1150 missing values generated)
(27 missing values generated)
(27 missing values generated)
(27 missing values generated)
(27 missing values generated)
(27 missing values generated)
(27 missing values generated)
(27 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                       112,672
        from master                   112,672  
        from using                          0  

    matched                            69,756  
    -----------------------------------------
(112,672 missing values generated)
(112,672 real changes made)
(data now sorted by zipcode year_month)
  variable sh_mw_wkrs_statutory_above_med was float now byte
  variable sh_workers_accomm_food_above_med was float now byte
  variable sh_workers_underHS_above_med was float now byte
  variable sh_res_accomm_food_above_med was float now byte
  variable sh_res_underHS_above_med was float now byte
  variable sh_res_under1250_above_med was float now byte
  variable sh_workers_under1250_above_med was float now byte
  variable high_res_mw was float now byte
  variable high_work_mw was float now byte
  variable public_housing was float now byte
  (5,472,840 bytes saved)
===============================================================================
File: ../temp/fullbal_sample_with_vars_for_het.dta
Key: zipcode year_month
===============================================================================
  182428:51(68190):73788463:563904170

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |    182,428    681.2884    26.35435        600        719
 zipcode_num |    182,428    52265.49    30815.82       1060      99705
   statefips |          0
        cbsa |          0
-------------+---------------------------------------------------------
      mw_res |    182,428    2.142492    .1758221   1.981001   2.772589
mw_wkp_to~17 |    182,401     2.14518    .1700982   1.981001   2.694807
    ln_rents |     92,016    .1101661    .4594451  -.8099218   1.906781
ln_emp_biz~v |    182,422    11.12421    1.365795   5.575949   13.38876
 ln_emp_info |    181,479    9.024371    1.576402   2.397895   12.38988
-------------+---------------------------------------------------------
  ln_emp_fin |    182,412     10.1801    1.396109   3.044523   12.89542
ln_estcoun~v |    182,428    8.621631    1.236301   1.098612   10.96353
ln_estcoun~o |    182,422    6.094282    1.371212          0   9.531191
ln_estcoun~n |    182,428    7.927013     1.19941    1.94591   10.33748
ln_avgwwag~v |    182,422    7.157605    .3119569   5.420535   9.135509
-------------+---------------------------------------------------------
ln_avgwwag~o |    181,479    7.338576    .3672027   5.891644   9.584453
ln_avgwwag~n |    182,412    7.318699    .3679793   6.293419   9.163982
sh_mw_wkrs~y |    171,517    .1469325    .0498983          0   .5496104
sh_res_un~29 |    182,401    .2259913    .0403126          0   .4475389
sh_res_~1250 |    182,401    .2302931    .0483253          0   .4304474
-------------+---------------------------------------------------------
sh_res_und~S |    182,401    .0971243    .0340735          0    .267153
sh_res_ac~od |    182,401    .0993788    .0402624          0          1
sh_worker~29 |    182,428    .2388548    .0510354   .0878358   .4709218
sh_work~1250 |    182,428    .2669979     .081478    .029254   .6991277
sh_workers~S |    182,428    .1036151    .0351584   .0319356   .3313758
-------------+---------------------------------------------------------
sh_worker~od |    182,428    .1130704    .0703643          0   .8823267
sh_mw_wkrs~d |    182,428    .5227871    .4994818          0          1
resint_sh_~y |    182,428    1.121505    1.079189          0   2.772589
wkpint_sh_~y |    182,401    1.121837    1.079212          0   2.691215
sh_workers.. |    182,428     .501354    .4999995          0          1
-------------+---------------------------------------------------------
resint_sh_.. |    182,428    1.073647    1.077871          0   2.772589
wkpint_sh_.. |    182,401    1.074861    1.078444          0   2.694137
sh_workers.. |    182,428    .4993751     .500001          0          1
r~rs_underHS |    182,428    1.071514     1.08033          0   2.772589
w~rs_underHS |    182,401    1.072946    1.081071          0   2.691215
-------------+---------------------------------------------------------
sh_res_ac~ed |    182,428     .498816          .5          0          1
resint_sh_.. |    182,428    1.069593    1.079486          0   2.772589
wkpint_sh_.. |    182,401    1.069564     1.07905          0   2.694807
sh_res_und.. |    182,428    .5021652    .4999967          0          1
r~es_underHS |    182,428    1.077153    1.079873          0   2.772589
-------------+---------------------------------------------------------
w~es_underHS |    182,401    1.077905    1.080327          0   2.691215
sh_res_und.. |    182,428    .4971825    .4999934          0          1
resint_sh_.. |    182,428    1.066868    1.080172          0   2.772589
wkpint_sh_.. |    182,401    1.067138    1.080205          0   2.691215
sh_workers.. |    182,428     .500455    .5000012          0          1
-------------+---------------------------------------------------------
resint_sh_.. |    182,428    1.072923     1.07914          0   2.772589
wkpint_sh_.. |    182,401    1.074229    1.079924          0   2.691215
 high_res_mw |    182,428    .3569353    .4790968          0          1
high_work_mw |    182,428    .2914191    .4544174          0          1
 total_units |     69,756     259.208     561.425          0      10966
-------------+---------------------------------------------------------
public_hou~g |    182,428    .3811147     .485662          0          1




(note: file ../temp/fullbal_sample_with_vars_for_het.dta not found)
file ../temp/fullbal_sample_with_vars_for_het.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.     local instub  "../temp"
  2.     local outstub "../output"
  3. 
.     define_controls
  4.     local controls     "`r(economic_controls)'"
  5.     local cluster_vars "statefips"
  6.     local absorb "year_month"
  7. 
.     use "`instub'/fullbal_sample_with_vars_for_het.dta", clear
  8.     xtset zipcode_num year_month
  9. 
.     estimate_dist_lag_model, depvar(ln_rents) ///
>         dyn_var(mw_wkp_tot_17) w(0) stat_var(mw_res) ///
>         controls(`controls') absorb(`absorb') cluster(`cluster_vars') ///
>         model_name(static_both)
 10.         
.     reghdfe D.ln_rents c.D.mw_res#ib0.high_work_mw ///
>         c.D.mw_wkp_tot_17#ib0.high_res_mw ///
>         D.(`controls'), nocons ///
>         absorb(`absorb'##high_work_mw##high_res_mw) ///
>         cluster(`cluster_vars')
 11.     process_estimates, res_var(mw_res_high_work_mw) ///
>         wkp_var(mw_wkp_high_res_mw) model(het_mw_shares)
 12. 
.     reghdfe D.ln_rents c.D.mw_res#ib0.public_housing ///
>         c.D.mw_wkp_tot_17#ib0.public_housing ///
>         D.(`controls'), nocons ///
>         absorb(year_month##public_housing) cluster(`cluster_vars')
 13.     process_estimates, res_var(mw_res_high_public_hous) ///
>         wkp_var(mw_wkp_high_public_hous) model(het_public_hous)
 14. 
.     use "../temp/estimates_static_both.dta", clear
 15.     append using "../temp/estimates_het_mw_shares.dta"
 16.     append using "../temp/estimates_het_public_hous.dta"
 17.     export delimited "../temp/estimates_het.csv", replace
 18. end

. 
. program process_estimates
  1.     syntax, res_var(str) wkp_var(str) model(str)
  2. 
.     preserve
  3.         local N = e(N)
  4.         local r2 = e(r2)
  5. 
.         qui coefplot, vertical base gen
  6.         keep __at __b __se
  7.         rename (__at __b __se) (at b se)
  8.         keep if _n <= 4
  9.         keep if !missing(at)
 10.         replace at = 0
 11.         replace at = 1 if inlist(_n, 2, 4)
 12.         gen var     = "`res_var'"  
 13.         replace var = "`wkp_var'" if _n >= 3
 14.         gen N = `N'
 15.         gen r2 = `r2'
 16.         gen model = "`model'"
 17. 
.         save "../temp/estimates_`model'.dta", replace
 18.     restore
 19. end

. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m1 to 2019m12, but with gaps
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     90,255
Absorbing 1 HDFE group                            F(  11,     38) =       2.78
Statistics robust to heteroskedasticity           Prob > F        =     0.0094
                                                  R-squared       =     0.0245
                                                  Adj R-squared   =     0.0236
                                                  Within R-sq.    =     0.0004
Number of clusters (statefips) =         39       Root MSE        =     0.0284

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp_to~17 |
         D1. |    .058092   .0261967     2.22   0.033     .0050595    .1111245
             |
      mw_res |
         D1. |  -.0158203   .0163931    -0.97   0.341    -.0490063    .0173657
             |
ln_emp_biz~v |
         D1. |    .015572   .0074222     2.10   0.043     .0005465    .0305975
             |
 ln_emp_info |
         D1. |   .0029589   .0045104     0.66   0.516    -.0061719    .0120898
             |
  ln_emp_fin |
         D1. |   .0090024   .0077151     1.17   0.251     -.006616    .0246209
             |
ln_estcoun~v |
         D1. |   .0094999   .0182118     0.52   0.605    -.0273679    .0463677
             |
ln_estcoun~o |
         D1. |   .0007299   .0070651     0.10   0.918    -.0135726    .0150324
             |
ln_estcoun~n |
         D1. |  -.0059173   .0173725    -0.34   0.735    -.0410861    .0292515
             |
ln_avgwwag~v |
         D1. |   .0022411   .0037473     0.60   0.553    -.0053449    .0098271
             |
ln_avgwwag~o |
         D1. |   .0007732   .0014806     0.52   0.605    -.0022242    .0037706
             |
ln_avgwwag~n |
         D1. |   -.002065   .0014013    -1.47   0.149    -.0049018    .0007719
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        70           0          70     |
-----------------------------------------------------+
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(182,426 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(2 real changes made)
(1 real change made)
(note: file ../temp/estimates_static_both.dta not found)
file ../temp/estimates_static_both.dta saved

 ( 1)  D.mw_wkp_tot_17 + D.mw_res = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0422717   .0154788     2.73   0.010     .0109366    .0736068
------------------------------------------------------------------------------
number of observations will be reset to 1
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 1
(note: file ../temp/estimates_static_both_sumsum_from0.dta not found)
file ../temp/estimates_static_both_sumsum_from0.dta saved
(note: variable at was byte, now float to accommodate using data's values)
file ../temp/estimates_static_both.dta saved
(note: file ../temp/estimates_static_both.csv not found)
file ../temp/estimates_static_both.csv saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     90,255
Absorbing 1 HDFE group                            F(  13,     38) =       2.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0097
                                                  R-squared       =     0.0272
                                                  Adj R-squared   =     0.0241
                                                  Within R-sq.    =     0.0004
Number of clusters (statefips) =         39       Root MSE        =     0.0284

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
high_work_mw#|
   cD.mw_res |
          0  |  -.0157968   .0169014    -0.93   0.356    -.0500119    .0184183
          1  |  -.0142927   .0208118    -0.69   0.496    -.0564241    .0278386
             |
 high_res_mw#|
         cD. |
mw_wkp_to~17 |
          0  |   .0578811   .0255927     2.26   0.030     .0060713    .1096909
          1  |   .0552484   .0303119     1.82   0.076    -.0061149    .1166117
             |
ln_emp_biz~v |
         D1. |   .0146476   .0072784     2.01   0.051    -.0000868    .0293819
             |
 ln_emp_info |
         D1. |   .0031367    .004406     0.71   0.481    -.0057827    .0120562
             |
  ln_emp_fin |
         D1. |   .0088085   .0076642     1.15   0.258    -.0067069    .0243238
             |
ln_estcoun~v |
         D1. |   .0096881    .017773     0.55   0.589    -.0262913    .0456676
             |
ln_estcoun~o |
         D1. |   .0013769   .0070691     0.19   0.847    -.0129337    .0156875
             |
ln_estcoun~n |
         D1. |   -.005117   .0165696    -0.31   0.759    -.0386604    .0284263
             |
ln_avgwwag~v |
         D1. |   .0024519   .0037553     0.65   0.518    -.0051502     .010054
             |
ln_avgwwag~o |
         D1. |   .0008487   .0015334     0.55   0.583    -.0022555    .0039529
             |
ln_avgwwag~n |
         D1. |  -.0019769   .0014229    -1.39   0.173    -.0048573    .0009036
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-------------------------------------------------------------------------------
> --+
                             Absorbed FE | Categories  - Redundant  = Num. Coef
> s                                                                            
>   |
-----------------------------------------+-------------------------------------
> --|
     year_month#high_work_mw#high_res_mw |       280           0         280   
>                                                                              
>   |
-------------------------------------------------------------------------------
> --+
(182,424 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: file ../temp/estimates_het_mw_shares.dta not found)
file ../temp/estimates_het_mw_shares.dta saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     90,255
Absorbing 1 HDFE group                            F(  13,     38) =       3.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0009
                                                  R-squared       =     0.0255
                                                  Adj R-squared   =     0.0238
                                                  Within R-sq.    =     0.0004
Number of clusters (statefips) =         39       Root MSE        =     0.0284

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
public_hou~g#|
   cD.mw_res |
          0  |  -.0003633   .0263361    -0.01   0.989    -.0536779    .0529512
          1  |  -.0494547   .0297846    -1.66   0.105    -.1097504    .0108411
             |
public_hou~g#|
         cD. |
mw_wkp_to~17 |
          0  |   .0398181   .0332383     1.20   0.238    -.0274693    .1071054
          1  |   .0965206   .0340056     2.84   0.007     .0276799    .1653613
             |
ln_emp_biz~v |
         D1. |   .0159582   .0070963     2.25   0.030     .0015925    .0303239
             |
 ln_emp_info |
         D1. |   .0028944   .0044713     0.65   0.521    -.0061574    .0119461
             |
  ln_emp_fin |
         D1. |   .0092034   .0077471     1.19   0.242    -.0064798    .0248866
             |
ln_estcoun~v |
         D1. |   .0092491   .0182584     0.51   0.615    -.0277132    .0462114
             |
ln_estcoun~o |
         D1. |   .0003343   .0070833     0.05   0.963    -.0140051    .0146737
             |
ln_estcoun~n |
         D1. |  -.0053502   .0177346    -0.30   0.765     -.041252    .0305516
             |
ln_avgwwag~v |
         D1. |   .0021169   .0037019     0.57   0.571    -.0053772    .0096111
             |
ln_avgwwag~o |
         D1. |   .0007025    .001531     0.46   0.649    -.0023968    .0038019
             |
ln_avgwwag~n |
         D1. |   -.002202   .0013576    -1.62   0.113    -.0049502    .0005463
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------------+
                 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------------+---------------------------------------|
   year_month#public_housing |       140           0         140     |
---------------------------------------------------------------------+
(182,424 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: file ../temp/estimates_het_public_hous.dta not found)
file ../temp/estimates_het_public_hous.dta saved
(note: variable var was str13, now str19 to accommodate using data's values)
(note: variable model was str11, now str13 to accommodate using data's
       values)
(note: variable var was str19, now str23 to accommodate using data's values)
(note: variable model was str13, now str15 to accommodate using data's
       values)
(note: file ../temp/estimates_het.csv not found)
file ../temp/estimates_het.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(data.table)
> 
> main <- function() {
+   instub  <- "../temp/"
+   outstub <- "../output/"
+   
+   est <- fread(file.path(instub, "estimates_het.csv"))
+   
+   txt <- c("<tab:heterogeneity>")
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_res_high_work_mw" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_res_high_work_mw" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_res_high_work_mw" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_res_high_work_mw" & at == 1,]$se, 
+                  sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_wkp_high_res_mw" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_wkp_high_res_mw" & at == 1,]$se, 
+                  sep = "\t"))
+   
+    txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$r2,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$r2,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$r2, 
+                  sep = "\t"))
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$N,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_high_res_mw" & at == 0,]$N,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$N, 
+                  sep = "\t"))
+ 
+   fileConn <- file(file.path(outstub, "heterogeneity.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.60    0.17    0.87 

 make.py ended: 2022-05-04 11:13:13
