
 make.py started: 2022-03-24 06:53:29 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.         
.         local instub  "../../../drive/derived_large/estimation_samples"
  2.         local incross "../../../drive/derived_large/zipcode"
  3.         local outstub "../output"
  4.         
.         define_controls
  5.         local controls     "`r(economic_controls)'"
  6.         local cluster_vars "statefips"
  7. 
.         load_and_clean, instub(`instub') incross(`incross')
  8. 
.         reghdfe D.ln_rents D.mw_res D.mw_wkp_tot_17 i.above_median_sh_mw_wkrs
>  ///
>             c.D.mw_wkp_tot_17#i.above_median_sh_mw_wkrs ///
>             `controls', nocons absorb(year_month) cluster(`cluster_vars')
  9. 
.         reghdfe D.ln_rents D.mw_res D.mw_wkp_tot_17 i.below_median_sh_mw_wkrs
>  ///
>             c.D.mw_wkp_tot_17#i.below_median_sh_mw_wkrs ///
>             `controls', nocons absorb(year_month) cluster(`cluster_vars')    
>    
 10. end

. 
. 
. program load_and_clean
  1.     syntax, instub(str) incross(str)
  2. 
.         use "`instub'/zipcode_months.dta" if baseline_sample == 1, clear
  3.         xtset zipcode_num year_month
  4. 
.         merge m:1 zipcode using "`incross'/zipcode_cross.dta", nogen ///
>             keep(3) keepusing(sh_mw_wkrs_statutory)
  5.         xtset zipcode_num year_month
  6. 
.         sum sh_mw_wkrs_statutory, d
  7.         local median `r(p50)'
  8. 
.         gen above_median_sh_mw_wkrs = (sh_mw_wkrs_statutory >= `median') ///
>             if !missing(sh_mw_wkrs_statutory)
  9.                 
.         gen below_median_sh_mw_wkrs = (sh_mw_wkrs_statutory < `median') ///
>             if !missing(sh_mw_wkrs_statutory)
 10. end

. 
. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           133,600  
    -----------------------------------------
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month

                    sh_mw_wkrs_statutory
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0588185       .0114365
 5%     .0867392       .0114365
10%     .0960774       .0114365       Obs             125,057
25%     .1161432       .0114365       Sum of Wgt.     125,057

50%     .1346972                      Mean           .1401641
                        Largest       Std. Dev.      .0421492
75%     .1582743       .5270913
90%     .1895167       .5270913       Variance       .0017766
95%      .210314       .5270913       Skewness       1.983894
99%     .2778594       .5270913       Kurtosis       14.53711
(8,543 missing values generated)
(8,543 missing values generated)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    123,156
Absorbing 1 HDFE group                            F(  13,     38) =      20.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0211
                                                  Adj R-squared   =     0.0200
                                                  Within R-sq.    =     0.0004
Number of clusters (statefips) =         39       Root MSE        =     0.0290

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0172802   .0139435    -1.24   0.223    -.0455074     .010947
             |
mw_wkp_to~17 |
         D1. |   .0558846   .0191432     2.92   0.006     .0171312    .0946381
             |
1.above_me~s |   .0002998   .0001012     2.96   0.005     .0000949    .0005048
             |
above_medi~s#|
         cD. |
mw_wkp_to~17 |
          1  |  -.0146008   .0185139    -0.79   0.435    -.0520802    .0228786
             |
ln_emp_biz~v |  -.0009497   .0001989    -4.78   0.000    -.0013523   -.0005471
 ln_emp_info |   .0003076   .0002313     1.33   0.192    -.0001607    .0007759
  ln_emp_fin |   .0002688   .0002329     1.15   0.256    -.0002028    .0007403
ln_estcoun~v |   .0004483   .0005185     0.86   0.393    -.0006012    .0014979
ln_estcoun~o |   .0004168   .0004199     0.99   0.327    -.0004333    .0012668
ln_estcoun~n |  -.0002237   .0007079    -0.32   0.754    -.0016568    .0012093
ln_avgwwag~v |  -.0002753   .0007369    -0.37   0.711    -.0017671    .0012166
ln_avgwwag~o |   .0004773   .0005644     0.85   0.403    -.0006653      .00162
ln_avgwwag~n |  -.0011961   .0005052    -2.37   0.023    -.0022188   -.0001734
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    123,156
Absorbing 1 HDFE group                            F(  13,     38) =      20.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0211
                                                  Adj R-squared   =     0.0200
                                                  Within R-sq.    =     0.0004
Number of clusters (statefips) =         39       Root MSE        =     0.0290

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0172802   .0139435    -1.24   0.223    -.0455074     .010947
             |
mw_wkp_to~17 |
         D1. |   .0412838   .0294531     1.40   0.169    -.0183408    .1009084
             |
1.below_me~s |  -.0002998   .0001012    -2.96   0.005    -.0005048   -.0000949
             |
below_medi~s#|
         cD. |
mw_wkp_to~17 |
          1  |   .0146008   .0185139     0.79   0.435    -.0228786    .0520802
             |
ln_emp_biz~v |  -.0009497   .0001989    -4.78   0.000    -.0013523   -.0005471
 ln_emp_info |   .0003076   .0002313     1.33   0.192    -.0001607    .0007759
  ln_emp_fin |   .0002688   .0002329     1.15   0.256    -.0002028    .0007403
ln_estcoun~v |   .0004483   .0005185     0.86   0.393    -.0006012    .0014979
ln_estcoun~o |   .0004168   .0004199     0.99   0.327    -.0004333    .0012668
ln_estcoun~n |  -.0002237   .0007079    -0.32   0.754    -.0016568    .0012093
ln_avgwwag~v |  -.0002753   .0007369    -0.37   0.711    -.0017671    .0012166
ln_avgwwag~o |   .0004773   .0005644     0.85   0.403    -.0006653      .00162
ln_avgwwag~n |  -.0011961   .0005052    -2.37   0.023    -.0022188   -.0001734
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+

. 
end of do-file

 make.py ended: 2022-03-24 06:53:35
