
 make.py started: 2022-07-22 09:32:44 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local incross "../../../drive/derived_large/zipcode"
  3.     local in_hud "../../../drive/base_large/hud_housing_assistance"
  4.     local outstub "../temp"
  5. 
.     use "`in_hud'/zipcode.dta", clear
  6.     keep if program_label == "Public Housing"
  7.     keep if year == 2017
  8.     keep zipcode total_units
  9.     save_data "`outstub'/public_housing_2017.dta", key(zipcode) replace lo
> g(none)
 10. 
.     load_and_clean, instub(`instub') incross(`incross')
 11. 
.     merge m:1 zipcode using "`outstub'/public_housing_2017.dta",    ///
>         nogen keep(1 3)
 12. 
.     prepare_public_housing
 13. 
.     save_data "`outstub'/fullbal_sample_with_vars_for_het.dta",     ///
>         key(zipcode year_month) replace log(none)
 14. end

. 
. 
. program load_and_clean
  1.     syntax, instub(str) incross(str)
  2. 
.     define_controls
  3.     local controls     "`r(economic_controls)'"
  4. 
.     use zipcode statefips cbsa year_month zipcode_num ln_rents mw_res  ///
>         mw_wkp_tot_17 fullbal_sample_SFCC `controls'                   ///
>         using "`instub'/zipcode_months.dta", clear
  5.     xtset zipcode_num year_month
  6. 
.     merge m:1 zipcode using "`incross'/zipcode_cross.dta", nogen       ///
>         keep(1 3) keepusing(sh_mw_wkrs_statutory med_hhld_inc_acs2014 n_hhlds
> _cens2010)
  7. 
.     foreach var in sh_mw_wkrs_statutory med_hhld_inc_acs2014 {
  8.             qui sum `var'
  9.         local avg_`var' = r(mean)
 10.         local sd_`var' = r(sd)
 11.         gen std_`var' = (`var' - `avg_`var'')/`sd_`var''
 12.     }
 13. end

. 
. program prepare_public_housing
  1. 
.     gen     public_housing = (total_units > 0) if !missing(total_units)
  2.     replace public_housing = 0 if missing(total_units)
  3. 
.     gen     sh_public_housing = total_units/n_hhlds_cens2010
  4.     replace sh_public_housing = 0 if missing(total_units)
  5. 
.     qui sum sh_public_housing
  6.     local avg_sh_public_housing = r(mean)
  7.     local sd_sh_public_housing  = r(sd)
  8. 
.     gen std_sh_public_housing   = (sh_public_housing - `avg_sh_public_housing
> ')/`sd_sh_public_housing'
  9. end

. 
. main
(310,972 observations deleted)
(24,164 observations deleted)
(data now sorted by zipcode)
  variable total_units was double now int
  (37,974 bytes saved)
===============================================================================
File: ../temp/public_housing_2017.dta
Key: zipcode
===============================================================================
  6329:2(60726):1417201667:2500064492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
 total_units |      6,329    164.4508    388.0311          0      10966




(note: file ../temp/public_housing_2017.dta not found)
file ../temp/public_housing_2017.dta saved
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m1 to 2020m6
                delta:  1 month

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           316,182  
    -----------------------------------------
(17,293 missing values generated)
(12,482 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                       197,692
        from master                   197,692  
        from using                          0  

    matched                           118,490  
    -----------------------------------------
(197,692 missing values generated)
(197,692 real changes made)
(198,761 missing values generated)
(197,692 real changes made)
(1,069 missing values generated)
(data now sorted by zipcode year_month)
  variable public_housing was float now byte
  (948,546 bytes saved)
===============================================================================
File: ../temp/fullbal_sample_with_vars_for_het.dta
Key: zipcode year_month
===============================================================================
  316182:27(83670):3469209726:2066408175

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |    316,182    683.2201    31.19125        600        725
 zipcode_num |    316,182    53592.11    30406.49       1060      99705
   statefips |          0
        cbsa |          0
-------------+---------------------------------------------------------
      mw_res |    316,182    2.147799    .1909869   1.981001   2.796671
mw_wkp_to~17 |    316,149    2.151023    .1865859   1.981001   2.742209
    ln_rents |    197,978    .1260564    .4678614  -2.215314   3.176775
ln_emp_biz~v |    288,372    11.04266    1.372665   5.575949   13.38876
 ln_emp_info |    286,678    8.937194    1.584959   2.397895   12.38988
-------------+---------------------------------------------------------
  ln_emp_fin |    288,362    10.09158    1.399445   2.944439   12.89542
ln_estcoun~v |    288,390    8.559121     1.24228   1.098612   10.96353
ln_estcoun~o |    288,372    6.025026    1.376251          0   9.531191
ln_estcoun~n |    288,390    7.867793    1.198168    1.94591   10.33748
ln_avgwwag~v |    288,372    7.141608    .3161643   5.420535   9.135509
-------------+---------------------------------------------------------
ln_avgwwag~o |    286,678    7.321838      .37776   5.891644   9.584453
ln_avgwwag~n |    288,362    7.296215    .3649157   6.061457   9.163982
fullbal_sa~C |    197,978     .407621    .4913933          0          1
n_hhlds~2010 |    316,182    14485.05    6087.383          0      48073
med_hhl~2014 |    303,700    57828.68    23307.27       33.5   196272.2
-------------+---------------------------------------------------------
sh_mw_wkrs~y |    298,889    .1573531    .0515758          0   .5346981
std_sh_mw_~y |    298,889    3.27e-10           1  -3.050906   7.316313
std_med~2014 |    303,700    2.35e-10           1  -2.479706   5.939929
 total_units |    118,490    232.5252    480.4963          0      10966
public_hou~g |    316,182    .3736392    .4837703          0          1
-------------+---------------------------------------------------------
sh_public_~g |    315,113    .0058887    .0190173          0   .4383979
std_sh_pub~g |    315,113    7.31e-09           1  -.3096466    22.7429




(note: file ../temp/fullbal_sample_with_vars_for_het.dta not found)
file ../temp/fullbal_sample_with_vars_for_het.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.     local instub  "../temp"
  2.     local outstub "../output"
  3. 
.     define_controls
  4.     local controls     "`r(economic_controls)'"
  5.     local cluster_vars "statefips"
  6.     local absorb "year_month"
  7. 
.     use "`instub'/fullbal_sample_with_vars_for_het.dta", clear
  8.     xtset zipcode_num year_month
  9. 
.     estimate_dist_lag_model if fullbal_sample_SFCC == 1,              ///
>         depvar(ln_rents)                                              ///
>         dyn_var(mw_wkp_tot_17) w(0) stat_var(mw_res)                  ///
>         controls(`controls') absorb(`absorb') cluster(`cluster_vars') ///
>         model_name(static_both)
 10.         
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.std_sh_mw_wkrs_statutory ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.std_sh_mw_wkrs_statutory  ///
>         D.(`controls') if fullbal_sample_SFCC == 1, nocons              ///
>         absorb(`absorb') cluster(`cluster_vars')
 11.     process_sum, het_var(std_sh_mw_wkrs_statutory) model(het_mw_shares)
 12.     process_estimates, res_var(mw_res_std_sh_mw_wkrs_statutory)         //
> /
>         wkp_var(mw_wkp_std_sh_mw_wkrs_statutory) model(het_mw_shares)
 13. 
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.std_med_hhld_inc_acs2014 ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.std_med_hhld_inc_acs2014  ///
>         D.(`controls') if fullbal_sample_SFCC == 1, nocons              ///
>         absorb(`absorb') cluster(`cluster_vars')
 14.     process_sum, het_var(std_med_hhld_inc_acs2014) model(het_med_inc)   
 15.     process_estimates, res_var(mw_res_std_med_hhld_inc)                 //
> /
>         wkp_var(mw_wkp_std_med_hhld_inc) model(het_med_inc)
 16. 
.     reghdfe D.ln_rents c.D.mw_res c.D.mw_res#c.std_sh_public_housing    ///
>         c.D.mw_wkp_tot_17 c.D.mw_wkp_tot_17#c.std_sh_public_housing     ///
>         D.(`controls') if fullbal_sample_SFCC == 1, nocons              ///
>         absorb(year_month) cluster(`cluster_vars')
 17.         process_sum, het_var(std_sh_public_housing) model(het_public_hous)
>     
 18.     process_estimates, res_var(mw_res_high_public_hous)                 //
> /
>         wkp_var(mw_wkp_high_public_hous) model(het_public_hous)
 19. 
.     use "../temp/estimates_static_both.dta", clear
 20.     append using "../temp/estimates_het_mw_shares.dta"
 21.     append using "../temp/estimates_het_public_hous.dta"
 22.     append using "../temp/estimates_het_med_inc.dta"
 23.     export delimited "../output/estimates_het.csv", replace
 24. end

. 
. program process_sum
  1.     syntax, het_var(str) model(str)
  2. 
.     lincom c.D.mw_res + c.D.mw_res#c.`het_var'
  3.     matrix sum_res = (0, r(estimate), r(se))
  4.     lincom c.D.mw_wkp_tot_17 + c.D.mw_wkp_tot_17#c.`het_var'
  5.     matrix sum_wkp = (0, r(estimate), r(se))
  6.     matrix sum = (sum_res \ sum_wkp)
  7.     
.     preserve
  8.         svmat sum
  9.         keep sum1 sum2 sum3
 10.         rename (sum1 sum2 sum3) (at b se)
 11.         drop if missing(at)
 12.         
.         gen     var = "sum_res"  
 13.         replace var = "sum_wkp" if _n == 2
 14.         gen model = "`model'"
 15. 
.         save "../temp/sum_`model'.dta", replace
 16.     restore
 17. end

. 
. program process_estimates
  1.     syntax, res_var(str) wkp_var(str) model(str)
  2. 
.     preserve
  3.         local N = e(N)
  4.         local r2 = e(r2)
  5. 
.         qui coefplot, vertical base gen
  6.         keep __at __b __se
  7.         rename (__at __b __se) (at b se)
  8.         keep if _n <= 4
  9.         keep if !missing(at)
 10. 
.         replace at = 0
 11.         replace at = 1 if inlist(_n, 2, 4)
 12. 
.         gen     var = "`res_var'"  
 13.         replace var = "`wkp_var'" if _n >= 3
 14. 
.         gen N = `N'
 15.         gen r2 = `r2'
 16.         gen model = "`model'"
 17.         
.         append using "../temp/sum_`model'.dta"
 18.         save "../temp/estimates_`model'.dta", replace
 19.     restore
 20. end

. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m1 to 2020m6
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     80,241
Absorbing 1 HDFE group                            F(  11,     40) =       3.78
Statistics robust to heteroskedasticity           Prob > F        =     0.0009
                                                  R-squared       =     0.0213
                                                  Adj R-squared   =     0.0204
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0296

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp_to~17 |
         D1. |   .0685098   .0288229     2.38   0.022     .0102567     .126763
             |
      mw_res |
         D1. |  -.0218668   .0175389    -1.25   0.220    -.0573143    .0135808
             |
ln_emp_biz~v |
         D1. |    .015979   .0078822     2.03   0.049     .0000486    .0319095
             |
 ln_emp_info |
         D1. |   .0025091   .0044261     0.57   0.574    -.0064363    .0114545
             |
  ln_emp_fin |
         D1. |    .008268   .0073263     1.13   0.266     -.006539    .0230751
             |
ln_estcoun~v |
         D1. |   .0019985    .020679     0.10   0.923    -.0397953    .0437923
             |
ln_estcoun~o |
         D1. |   .0032411   .0078392     0.41   0.681    -.0126025    .0190846
             |
ln_estcoun~n |
         D1. |  -.0057908   .0188269    -0.31   0.760    -.0438413    .0322597
             |
ln_avgwwag~v |
         D1. |   .0023012   .0036333     0.63   0.530     -.005042    .0096444
             |
ln_avgwwag~o |
         D1. |  -.0002851   .0016648    -0.17   0.865    -.0036498    .0030797
             |
ln_avgwwag~n |
         D1. |  -.0019555     .00151    -1.29   0.203    -.0050074    .0010964
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        60           0          60     |
-----------------------------------------------------+
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(316,180 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(2 real changes made)
(1 real change made)
(note: file ../temp/estimates_static_both.dta not found)
file ../temp/estimates_static_both.dta saved

 ( 1)  D.mw_wkp_tot_17 + D.mw_res = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0466431   .0158352     2.95   0.005      .014639    .0786472
------------------------------------------------------------------------------
number of observations will be reset to 1
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 1
(note: file ../temp/estimates_static_both_sumsum_from0.dta not found)
file ../temp/estimates_static_both_sumsum_from0.dta saved
(note: variable at was byte, now float to accommodate using data's values)
file ../temp/estimates_static_both.dta saved
(note: file ../temp/estimates_static_both.csv not found)
file ../temp/estimates_static_both.csv saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     75,329
Absorbing 1 HDFE group                            F(  13,     38) =       9.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0212
                                                  Adj R-squared   =     0.0202
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         39       Root MSE        =     0.0296

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0615045   .0241479    -2.55   0.015    -.1103894   -.0126196
             |
   cD.mw_res#|
          c. |
std_sh_mw_~y |    -.08818   .0431409    -2.04   0.048    -.1755143   -.0008458
             |
mw_wkp_to~17 |
         D1. |    .110734    .034212     3.24   0.003     .0414754    .1799926
             |
         cD. |
mw_wkp_to~17#|
          c. |
std_sh_mw_~y |   .0926566   .0490192     1.89   0.066    -.0065775    .1918908
             |
ln_emp_biz~v |
         D1. |   .0160749   .0072194     2.23   0.032       .00146    .0306897
             |
 ln_emp_info |
         D1. |   .0009379   .0040207     0.23   0.817    -.0072016    .0090774
             |
  ln_emp_fin |
         D1. |   .0062643   .0065614     0.95   0.346    -.0070184    .0195471
             |
ln_estcoun~v |
         D1. |  -.0054114   .0211768    -0.26   0.800    -.0482815    .0374587
             |
ln_estcoun~o |
         D1. |   .0040757   .0086782     0.47   0.641    -.0134923    .0216438
             |
ln_estcoun~n |
         D1. |  -.0031571    .016462    -0.19   0.849    -.0364827    .0301685
             |
ln_avgwwag~v |
         D1. |   .0010609   .0037733     0.28   0.780    -.0065777    .0086995
             |
ln_avgwwag~o |
         D1. |  -.0003534   .0016834    -0.21   0.835    -.0037614    .0030545
             |
ln_avgwwag~n |
         D1. |  -.0011037   .0015561    -0.71   0.482    -.0042538    .0020465
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        60           0          60     |
-----------------------------------------------------+

 ( 1)  D.mw_res + cD.mw_res#c.std_sh_mw_wkrs_statutory = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.1496845   .0636644    -2.35   0.024    -.2785663   -.0208028
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_tot_17 + cD.mw_wkp_tot_17#c.std_sh_mw_wkrs_statutory = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2033906   .0757038     2.69   0.011     .0501363     .356645
------------------------------------------------------------------------------
(316,180 observations deleted)
(1 real change made)
(note: file ../temp/sum_het_mw_shares.dta not found)
file ../temp/sum_het_mw_shares.dta saved
(316,178 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: variable at was byte, now float to accommodate using data's values)
(note: file ../temp/estimates_het_mw_shares.dta not found)
file ../temp/estimates_het_mw_shares.dta saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     77,197
Absorbing 1 HDFE group                            F(  13,     39) =       5.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0211
                                                  Adj R-squared   =     0.0202
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         40       Root MSE        =     0.0295

                             (Std. Err. adjusted for 40 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0435517   .0275795    -1.58   0.122    -.0993365    .0122331
             |
   cD.mw_res#|
          c. |
std_med~2014 |    .051482   .0270636     1.90   0.065    -.0032594    .1062234
             |
mw_wkp_to~17 |
         D1. |   .0931884   .0384682     2.42   0.020     .0153791    .1709976
             |
         cD. |
mw_wkp_to~17#|
          c. |
std_med~2014 |   -.061833   .0349977    -1.77   0.085    -.1326226    .0089565
             |
ln_emp_biz~v |
         D1. |    .015498   .0078586     1.97   0.056    -.0003976    .0313937
             |
 ln_emp_info |
         D1. |   .0022206   .0046063     0.48   0.632    -.0070966    .0115377
             |
  ln_emp_fin |
         D1. |   .0069738   .0074169     0.94   0.353    -.0080283    .0219758
             |
ln_estcoun~v |
         D1. |   .0051278   .0197844     0.26   0.797      -.03489    .0451456
             |
ln_estcoun~o |
         D1. |    .003457   .0078462     0.44   0.662    -.0124135    .0193275
             |
ln_estcoun~n |
         D1. |  -.0043834   .0177561    -0.25   0.806    -.0402986    .0315317
             |
ln_avgwwag~v |
         D1. |   .0032511   .0038419     0.85   0.403    -.0045199     .011022
             |
ln_avgwwag~o |
         D1. |    .000029   .0016993     0.02   0.986    -.0034083    .0034663
             |
ln_avgwwag~n |
         D1. |   -.001909   .0017164    -1.11   0.273    -.0053808    .0015628
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        60           0          60     |
-----------------------------------------------------+

 ( 1)  D.mw_res + cD.mw_res#c.std_med_hhld_inc_acs2014 = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0079303   .0195783     0.41   0.688    -.0316706    .0475312
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_tot_17 + cD.mw_wkp_tot_17#c.std_med_hhld_inc_acs2014 = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0313553   .0256621     1.22   0.229    -.0205511    .0832618
------------------------------------------------------------------------------
(316,180 observations deleted)
(1 real change made)
(note: file ../temp/sum_het_med_inc.dta not found)
file ../temp/sum_het_med_inc.dta saved
(316,178 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: variable at was byte, now float to accommodate using data's values)
(note: file ../temp/estimates_het_med_inc.dta not found)
file ../temp/estimates_het_med_inc.dta saved
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     79,941
Absorbing 1 HDFE group                            F(  13,     40) =       4.64
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.0213
                                                  Adj R-squared   =     0.0204
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         41       Root MSE        =     0.0295

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0227027   .0159857    -1.42   0.163    -.0550111    .0096057
             |
   cD.mw_res#|
          c. |
std_sh_pub~g |   -.034788   .0359022    -0.97   0.338     -.107349     .037773
             |
mw_wkp_to~17 |
         D1. |   .0706516   .0271911     2.60   0.013     .0156964    .1256067
             |
         cD. |
mw_wkp_to~17#|
          c. |
std_sh_pub~g |   .0314123   .0407777     0.77   0.446    -.0510026    .1138271
             |
ln_emp_biz~v |
         D1. |   .0161291   .0078935     2.04   0.048     .0001757    .0320824
             |
 ln_emp_info |
         D1. |    .002491   .0044376     0.56   0.578    -.0064777    .0114596
             |
  ln_emp_fin |
         D1. |   .0085069   .0073644     1.16   0.255    -.0063772    .0233909
             |
ln_estcoun~v |
         D1. |   .0031625   .0203632     0.16   0.877    -.0379931    .0443182
             |
ln_estcoun~o |
         D1. |   .0033706   .0078577     0.43   0.670    -.0125105    .0192517
             |
ln_estcoun~n |
         D1. |  -.0064856   .0188616    -0.34   0.733    -.0446063    .0316351
             |
ln_avgwwag~v |
         D1. |   .0019782   .0036511     0.54   0.591    -.0054009    .0093573
             |
ln_avgwwag~o |
         D1. |  -.0001872   .0016669    -0.11   0.911    -.0035563    .0031818
             |
ln_avgwwag~n |
         D1. |   -.001604    .001552    -1.03   0.308    -.0047407    .0015327
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        60           0          60     |
-----------------------------------------------------+

 ( 1)  D.mw_res + cD.mw_res#c.std_sh_public_housing = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0574907   .0404684    -1.42   0.163    -.1392804    .0242991
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_tot_17 + cD.mw_wkp_tot_17#c.std_sh_public_housing = 0

------------------------------------------------------------------------------
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1020638   .0520116     1.96   0.057    -.0030555    .2071832
------------------------------------------------------------------------------
(316,180 observations deleted)
(1 real change made)
(note: file ../temp/sum_het_public_hous.dta not found)
file ../temp/sum_het_public_hous.dta saved
(316,178 observations deleted)
(0 observations deleted)
(4 real changes made)
(2 real changes made)
(2 real changes made)
(note: variable at was byte, now float to accommodate using data's values)
(note: file ../temp/estimates_het_public_hous.dta not found)
file ../temp/estimates_het_public_hous.dta saved
(note: variable var was str13, now str31 to accommodate using data's values)
(note: variable model was str11, now str13 to accommodate using data's
       values)
(note: variable model was str13, now str15 to accommodate using data's
       values)
(note: file ../output/estimates_het.csv not found)
file ../output/estimates_het.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(data.table)
> 
> main <- function() {
+   instub  <- "../output/"
+   outstub <- "../output/"
+   
+   est <- fread(file.path(instub, "estimates_het.csv"))
+   
+   txt <- c("<tab:heterogeneity>")
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 0,]$b,
+                  est[model == "het_med_inc"    & var == "mw_res_std_med_hhld_inc" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_res",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 0,]$se,
+                  est[model == "het_med_inc"    & var == "mw_res_std_med_hhld_inc" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_res_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_res_std_sh_mw_wkrs_statutory" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_med_inc" & var == "mw_res_std_med_hhld_inc" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_med_inc" & var == "mw_res_std_med_hhld_inc" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_res_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$b,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$b,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$b,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$b,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$se,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$se,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$se,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$se,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_mw_shares" & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_mw_shares" & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "het_med_inc" & var == "mw_wkp_std_med_hhld_inc" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_med_inc" & var == "mw_wkp_std_med_hhld_inc" & at == 1,]$se, 
+                  sep = "\t"))
+ 
+    txt <- c(txt, 
+            paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$b, 
+                  sep = "\t"),
+             paste(est[model == "het_public_hous" & var == "mw_wkp_high_public_hous" & at == 1,]$se, 
+                  sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$r2,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$r2,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$r2,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$r2,
+                  sep = "\t"))
+ 
+   txt <- c(txt, 
+            paste(est[model == "static_both"    & var == "mw_wkp_tot_17",]$N,
+                  est[model == "het_mw_shares"  & var == "mw_wkp_std_sh_mw_wkrs_statutory" & at == 0,]$N,
+                  est[model == "het_med_inc"    & var == "mw_wkp_std_med_hhld_inc" & at == 0,]$N,
+                  est[model == "het_public_hous"& var == "mw_wkp_high_public_hous" & at == 0,]$N,
+                  sep = "\t"))
+ 
+   fileConn <- file(file.path(outstub, "heterogeneity.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.79    0.17    0.95 


Execute:  StataMP-64 /e do "./make_autofill_values.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./make_autofill_values.do 

. clear all

. version 15

. set more off

. 
. program main
  1.     local in_estimates  "../output"
  2. 
.     import delimited `in_estimates'/estimates_het.csv
  3. 
.     keep if model == "het_mw_shares" & at == 0
  4. 
.     qui sum b if var == "mw_res_std_sh_mw_wkrs_statutory"
  5.     local tilde_gamma_zero = r(mean)
  6.     qui sum se if var == "mw_res_std_sh_mw_wkrs_statutory"
  7.     local tilde_gamma_zero_se = r(mean)
  8. 
.     qui sum b if var == "mw_wkp_std_sh_mw_wkrs_statutory"
  9.     local tilde_beta_zero = r(mean)
 10.     qui sum se if var == "mw_wkp_std_sh_mw_wkrs_statutory"
 11.     local tilde_beta_zero_se = r(mean)
 12. 
.     qui sum b if var == "sum_res"
 13.     local tilde_gamma_zero_plus_one = r(mean)
 14.     qui sum se if var == "sum_res"
 15.     local tilde_gamma_zero_plus_one_se = r(mean)
 16. 
.     qui sum b if var == "sum_wkp"
 17.     local tilde_beta_zero_plus_one = r(mean)
 18.     qui sum se if var == "sum_wkp"
 19.     local tilde_beta_zero_plus_one_se = r(mean)
 20. 
.     cap file close f
 21.     file open   f using "../output/autofill_heterogeneity.tex", write repl
> ace
 22.     file write  f "\newcommand{\TildeGammaZero}{"               %4.3f  (`t
> ilde_gamma_zero')             "}" _n
 23.     file write  f "\newcommand{\TildeGammaZeroSE}{"             %4.3f  (`t
> ilde_gamma_zero_se')          "}" _n
 24.     file write  f "\newcommand{\TildeBetaZero}{"                %4.3f  (`t
> ilde_beta_zero')              "}" _n
 25.     file write  f "\newcommand{\TildeBetaZeroSE}{"              %4.3f  (`t
> ilde_beta_zero_se')           "}" _n
 26.     file write  f "\newcommand{\TildeGammaZeroPlusGammaOne}{"   %4.3f  (`t
> ilde_gamma_zero_plus_one')    "}" _n
 27.     file write  f "\newcommand{\TildeGammaZeroPlusGammaOneSE}{" %4.3f  (`t
> ilde_gamma_zero_plus_one_se') "}" _n
 28.     file write  f "\newcommand{\TildeBetaZeroPlusBetaOne}{"     %4.3f  (`t
> ilde_beta_zero_plus_one')     "}" _n
 29.     file write  f "\newcommand{\TildeBetaZeroPlusBetaOneSE}{"   %4.3f  (`t
> ilde_beta_zero_plus_one_se')  "}" _n
 30.     file close  f
 31. end

. 
. main
(7 vars, 21 obs)
(17 observations deleted)
(note: file ../output/autofill_heterogeneity.tex not found)

. 
end of do-file

 make.py ended: 2022-07-22 09:33:11
