
 make.py started: 2021-10-02 11:31:43 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local in_baseline "../../../drive/derived_large/estimation_samples
> "
  2.         local in_zip_year "../../../drive/derived_large/zipcode_year"
  3. 
.         local outstub "../output"
  4.         
.         define_controls
  5.         local controls "`r(economic_controls)'"
  6.         local cluster "statefips"
  7.         
.         ** STATIC
.         load_and_clean, in_baseline(`in_baseline') ///
>             in_zip_year(`in_zip_year')
  8. 
.         xtset zipcode_num year_month
  9.         eststo clear
 10.         foreach var in under29 under1250 underHS {
 11.         eststo: reghdfe D.ln_med_rent_var d_ln_mw d_ln_mw_int_wrkpl_`var' 
> ///
>             d_exp_ln_mw_17 d_exp_ln_mw_17_int_res_`var', nocons ///
>                 absorb(year_month) cluster(statefips)   
 12.         }
 13.     esttab *, se r2
 14. end

. 
. 
. program load_and_clean
  1.     syntax, in_baseline(str) in_zip_year(str)
  2. 
.         use "`in_baseline'/baseline_zipcode_months.dta", clear
  3.         merge m:1 zipcode year using "`in_zip_year'/zipcode_year.dta", ///
>             nogen keep(3) keepusing (res_* wrkpl_*)
  4.         
.         xtset zipcode_num year_month
  5.         
.         gen d_ln_mw        = D.ln_mw
  6.         gen d_exp_ln_mw_17 = D.exp_ln_mw_17
  7.         
.         foreach var in under29 under1250 underHS {
  8.             bys statefips: egen sh_res_`var'_med  = median(res_`var')
  9.             bys statefips: egen sh_wrkpl_`var'_med = median(wrkpl_`var')  
>       
 10.             
.                 gen sh_res_`var'_above_med_st    = (res_`var' > sh_res_`var'_
> med)
 11.             gen sh_wrkpl_`var'_above_med_st  = (wrkpl_`var'   > sh_wrkpl_`
> var'_med)
 12.             drop *_med
 13.                 
.             gen d_ln_mw_int_wrkpl_`var'      = d_ln_mw*sh_wrkpl_`var'_above_m
> ed_st
 14.             gen d_exp_ln_mw_17_int_res_`var' = d_ln_mw*sh_res_`var'_above_
> med_st
 15.         }
 16. end

. 
. 
. main

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           161,400  
    -----------------------------------------
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(1,345 missing values generated)
(1,345 missing values generated)
(120 missing values generated)
(120 missing values generated)
(1,345 missing values generated)
(1,345 missing values generated)
(120 missing values generated)
(120 missing values generated)
(1,345 missing values generated)
(1,345 missing values generated)
(120 missing values generated)
(120 missing values generated)
(1,345 missing values generated)
(1,345 missing values generated)
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    132,255
Absorbing 1 HDFE group                            F(   4,     40) =       1.51
Statistics robust to heteroskedasticity           Prob > F        =     0.2171
                                                  R-squared       =     0.0208
                                                  Adj R-squared   =     0.0199
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         41       Root MSE        =     0.0291

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0257374   .0175807    -1.46   0.151    -.0612694    .0097946
d_ln_mw_i~29 |   -.015518   .0172255    -0.90   0.373     -.050332     .019296
d_exp_ln_~17 |   .0653778   .0294254     2.22   0.032      .005907    .1248487
d_exp_ln_~29 |   .0062797   .0103398     0.61   0.547    -.0146179    .0271772
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    132,255
Absorbing 1 HDFE group                            F(   4,     40) =       1.69
Statistics robust to heteroskedasticity           Prob > F        =     0.1718
                                                  R-squared       =     0.0208
                                                  Adj R-squared   =     0.0199
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         41       Root MSE        =     0.0291

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0224333   .0196924    -1.14   0.261    -.0622332    .0173666
d_ln_mw~1250 |  -.0027249   .0197543    -0.14   0.891    -.0426499    .0372001
d_exp_ln_~17 |   .0630765   .0273972     2.30   0.027     .0077047    .1184483
d_exp_l~1250 |  -.0103593   .0119068    -0.87   0.389    -.0344238    .0137052
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    132,255
Absorbing 1 HDFE group                            F(   4,     40) =       1.60
Statistics robust to heteroskedasticity           Prob > F        =     0.1941
                                                  R-squared       =     0.0208
                                                  Adj R-squared   =     0.0199
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         41       Root MSE        =     0.0291

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
ln_med_ren~r |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0324034   .0186927    -1.73   0.091    -.0701827    .0053758
d_ln_mw_in~S |   .0022587   .0165422     0.14   0.892    -.0311743    .0356917
d_exp_ln_~17 |   .0633955   .0275948     2.30   0.027     .0076243    .1191667
d_exp_ln_m~S |   .0031503   .0174242     0.18   0.857    -.0320654    .0383659
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(est3 stored)

------------------------------------------------------------
                      (1)             (2)             (3)   
             D.ln_med_r~r    D.ln_med_r~r    D.ln_med_r~r   
------------------------------------------------------------
d_ln_mw           -0.0257         -0.0224         -0.0324   
                 (0.0176)        (0.0197)        (0.0187)   

d_ln_mw_i~29      -0.0155                                   
                 (0.0172)                                   

d_exp_ln_~17       0.0654*         0.0631*         0.0634*  
                 (0.0294)        (0.0274)        (0.0276)   

d_exp_ln_~29      0.00628                                   
                 (0.0103)                                   

d_ln_mw~1250                     -0.00272                   
                                 (0.0198)                   

d_exp_l~1250                      -0.0104                   
                                 (0.0119)                   

d_ln_mw_in~S                                      0.00226   
                                                 (0.0165)   

d_exp_ln_m~S                                      0.00315   
                                                 (0.0174)   
------------------------------------------------------------
N                  132255          132255          132255   
R-sq                0.021           0.021           0.021   
------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
end of do-file

 make.py ended: 2021-10-02 11:31:56
