
 make.py started: 2022-03-24 06:59:18 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_heterogeneity\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


.         
. program main
  1.         
.         local instub  "../../../drive/derived_large/estimation_samples"
  2.         local incross "../../../drive/derived_large/zipcode"
  3.         local outstub "../output"
  4.         
.         define_controls
  5.         local controls     "`r(economic_controls)'"
  6.         local cluster_vars "statefips"
  7. 
.         load_and_clean, instub(`instub') incross(`incross')
  8. 
.         reghdfe D.ln_rents D.mw_res D.mw_wkp_tot_17 i.above_median_sh_mw_wkrs
>  ///
>             c.D.mw_wkp_tot_17#i.above_median_sh_mw_wkrs ///
>             D.(`controls'), nocons absorb(year_month) cluster(`cluster_vars')
  9. 
.         reghdfe D.ln_rents D.mw_res D.mw_wkp_tot_17 i.below_median_sh_mw_wkrs
>  ///
>             c.D.mw_wkp_tot_17#i.below_median_sh_mw_wkrs ///
>             D.(`controls'), nocons absorb(year_month) cluster(`cluster_vars')
>    
 10. end

. 
. 
. program load_and_clean
  1.     syntax, instub(str) incross(str)
  2. 
.         use "`instub'/zipcode_months.dta" if baseline_sample == 1, clear
  3.         xtset zipcode_num year_month
  4. 
.         merge m:1 zipcode using "`incross'/zipcode_cross.dta", nogen ///
>             keep(3) keepusing(sh_mw_wkrs_statutory)
  5.         xtset zipcode_num year_month
  6. 
.         sum sh_mw_wkrs_statutory, d
  7.         local median `r(p50)'
  8. 
.         gen above_median_sh_mw_wkrs = (sh_mw_wkrs_statutory >= `median') ///
>             if !missing(sh_mw_wkrs_statutory)
  9.                 
.         gen below_median_sh_mw_wkrs = (sh_mw_wkrs_statutory < `median') ///
>             if !missing(sh_mw_wkrs_statutory)
 10. end

. 
. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           133,600  
    -----------------------------------------
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month

                    sh_mw_wkrs_statutory
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0588185       .0114365
 5%     .0867392       .0114365
10%     .0960774       .0114365       Obs             125,057
25%     .1161432       .0114365       Sum of Wgt.     125,057

50%     .1346972                      Mean           .1401641
                        Largest       Std. Dev.      .0421492
75%     .1582743       .5270913
90%     .1895167       .5270913       Variance       .0017766
95%      .210314       .5270913       Skewness       1.983894
99%     .2778594       .5270913       Kurtosis       14.53711
(8,543 missing values generated)
(8,543 missing values generated)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    122,984
Absorbing 1 HDFE group                            F(  13,     38) =      10.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0208
                                                  Adj R-squared   =     0.0198
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         39       Root MSE        =     0.0291

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0156231   .0145655    -1.07   0.290    -.0451095    .0138633
             |
mw_wkp_to~17 |
         D1. |   .0566391    .020357     2.78   0.008     .0154286    .0978497
             |
1.above_me~s |   .0002827   .0001302     2.17   0.036     .0000192    .0005462
             |
above_medi~s#|
         cD. |
mw_wkp_to~17 |
          1  |  -.0150364    .019549    -0.77   0.447    -.0546113    .0245386
             |
ln_emp_biz~v |
         D1. |    .010658   .0048154     2.21   0.033     .0009097    .0204064
             |
 ln_emp_info |
         D1. |   .0002576    .003184     0.08   0.936    -.0061881    .0067032
             |
  ln_emp_fin |
         D1. |    .009835   .0054975     1.79   0.082    -.0012941    .0209641
             |
ln_estcoun~v |
         D1. |  -.0006961   .0162254    -0.04   0.966    -.0335427    .0321505
             |
ln_estcoun~o |
         D1. |   .0012399   .0058346     0.21   0.833    -.0105717    .0130516
             |
ln_estcoun~n |
         D1. |   .0071029   .0075727     0.94   0.354    -.0082272     .022433
             |
ln_avgwwag~v |
         D1. |   .0022838   .0030667     0.74   0.461    -.0039245    .0084921
             |
ln_avgwwag~o |
         D1. |   .0001075   .0018015     0.06   0.953    -.0035394    .0037544
             |
ln_avgwwag~n |
         D1. |  -.0016956   .0011349    -1.49   0.143    -.0039931    .0006018
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    122,984
Absorbing 1 HDFE group                            F(  13,     38) =      10.30
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0208
                                                  Adj R-squared   =     0.0198
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         39       Root MSE        =     0.0291

                             (Std. Err. adjusted for 39 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  D.ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      mw_res |
         D1. |  -.0156231   .0145655    -1.07   0.290    -.0451095    .0138633
             |
mw_wkp_to~17 |
         D1. |   .0416027    .029986     1.39   0.173    -.0191008    .1023062
             |
1.below_me~s |  -.0002827   .0001302    -2.17   0.036    -.0005462   -.0000192
             |
below_medi~s#|
         cD. |
mw_wkp_to~17 |
          1  |   .0150364    .019549     0.77   0.447    -.0245386    .0546113
             |
ln_emp_biz~v |
         D1. |    .010658   .0048154     2.21   0.033     .0009097    .0204064
             |
 ln_emp_info |
         D1. |   .0002576    .003184     0.08   0.936    -.0061881    .0067032
             |
  ln_emp_fin |
         D1. |    .009835   .0054975     1.79   0.082    -.0012941    .0209641
             |
ln_estcoun~v |
         D1. |  -.0006961   .0162254    -0.04   0.966    -.0335427    .0321505
             |
ln_estcoun~o |
         D1. |   .0012399   .0058346     0.21   0.833    -.0105717    .0130516
             |
ln_estcoun~n |
         D1. |   .0071029   .0075727     0.94   0.354    -.0082272     .022433
             |
ln_avgwwag~v |
         D1. |   .0022838   .0030667     0.74   0.461    -.0039245    .0084921
             |
ln_avgwwag~o |
         D1. |   .0001075   .0018015     0.06   0.953    -.0035394    .0037544
             |
ln_avgwwag~n |
         D1. |  -.0016956   .0011349    -1.49   0.143    -.0039931    .0006018
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+

. 
end of do-file

 make.py ended: 2022-03-24 06:59:27
