
 make.py started: 2021-09-30 15:36:59 C:\Users\diegog\Desktop\Diego\min_wage_rent\derived\zipcode_month\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/mental_coupons/ado"

. 
. program main
  1.     local in_derived_large "../../../drive/derived_large"
  2.     local in_geo           "../../../base/geo_master/output"
  3.     local in_base_large    "../../../drive/base_large"
  4.     local in_qcew          "../../../base/qcew/output"
  5.     local outstub          "../../../drive/derived_large/zipcode_month"
  6.     local logfile          "../output/data_file_manifest.log"
  7. 
.     use zipcode place_code countyfips cbsa10 zcta statefips rural            
>      ///
>         using "`in_geo'/zip_county_place_usps_master.dta", clear
  8. 
.     merge 1:m zipcode using "`in_derived_large'/min_wage/zip_statutory_mw.dta
> ",   ///
>        nogen assert(3) keepusing(year month actual* binding*)
  9.     
.     merge_zillow, instub("`in_base_large'/zillow")
 10.     
.     merge_exp_mw, instub("`in_derived_large'/min_wage")
 11. 
.     merge_acs_pop, instub("`in_base_large'/demographics")
 12.     
.     make_date_variables
 13. 
.     merge m:1 statefips countyfips year month                                
>      ///
>         using "`in_qcew'/ind_emp_wage_countymonth.dta", nogen keep(1 3)
 14.         drop qmon end_month
 15. 
.     strcompress
 16.     save_data "`outstub'/zipcode_month_panel.dta", replace ///
>         key(zipcode year month) log(`logfile')
 17.         export delimited "`outstub'/zipcode_month_panel.csv", replace
 18. end

. 
. program merge_zillow
  1.     syntax, instub(str)
  2.     
.     merge 1:1 zipcode year month using "`instub'/zillow_zipcode_clean.dta"
  3. 
.     qui sum medrentpricepsqft_SFCC if _merge == 2 & inrange(year, 2010, 2019)
>     
  4.     assert r(N) == 0
  5.     keep if inlist(_merge, 1, 3)
  6.     drop _merge
  7. end

. 
. program merge_exp_mw
  1.     syntax, instub(str)
  2. 
.     merge 1:1 zipcode year month using "`instub'/zipcode_experienced_mw_2010.
> dta", ///
>         nogen keep(1 3) keepusing(exp*)
  3.     merge 1:1 zipcode year month using "`instub'/zipcode_experienced_mw_20
> 14.dta", ///
>         nogen keep(1 3) keepusing(exp*)
  4.     merge 1:1 zipcode year month using "`instub'/zipcode_experienced_mw_20
> 18.dta", ///
>         nogen keep(1 3) keepusing(exp*)
  5.                 
.     qui sum medrentpricepsqft_SFCC if !missing(medrentpricepsqft_SFCC)
  6.     local observations_with_rents = r(N)
  7. 
.     sum exp_ln_mw_tot if !missing(medrentpricepsqft_SFCC)
  8.     assert r(N) == `observations_with_rents'
  9. end

. 
. program merge_acs_pop
  1.     syntax, instub(str)
  2. 
.     merge m:1 zipcode year using "`instub'/acs_population_zipyear.dta", ///
>         nogen keep(1 3)
  3. 
.     qui sum medrentpricepsqft_SFCC if !missing(medrentpricepsqft_SFCC)
  4.     local observations_with_rents = r(N)
  5. 
.     qui sum acs_pop if !missing(medrentpricepsqft_SFCC)
  6.     assert r(N) == `observations_with_rents'
  7. end

. 
. program make_date_variables
  1.     gen day = 1
  2.     gen date = mdy(month, day, year)
  3. 
.     gen    year_month = mofd(date)
  4.     format year_month %tm
  5. 
.     gen    quarter      = quarter(dofm(year_month))
  6.     gen    year_quarter = qofd(date)
  7.     format year_quarter %tq
  8. 
.     drop day date
  9. end

. 
. main

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         4,858,560  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                     6,406,967
        from master                 1,000,440  (_merge==1)
        from using                  5,406,527  (_merge==2)

    matched                         3,858,120  (_merge==3)
    -----------------------------------------
(5,406,527 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                       206,639
        from master                   206,639  
        from using                          0  

    matched                         4,651,921  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                       205,919
        from master                   205,919  
        from using                          0  

    matched                         4,652,641  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                       205,919
        from master                   205,919  
        from using                          0  

    matched                         4,652,641  
    -----------------------------------------

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
exp_ln_mw_~t |    197,978    2.120866    .1701831   1.849591   2.688164

    Result                           # of obs.
    -----------------------------------------
    not matched                       207,828
        from master                   207,828  
        from using                          0  

    matched                         4,650,732  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           912
        from master                       912  
        from using                          0  

    matched                         4,857,648  
    -----------------------------------------
  Converting str to strL: zipcode place_code countyfips cbsa10 zcta statefips
    strcompress grew data 49% so far, but I'm not done yet!
  variable medDailylistings_NSA_SFCC was long now int
  variable Monthlylistings_NSA_SFCC was long now int
  variable NewMonthlylistings_NSA_SFCC was long now int
  variable Sale_Counts was long now int
  variable zri_MF was long now int
  variable year_month was float now int
  variable quarter was float now byte
  variable year_quarter was float now int
  variable year was double now int
  variable month was double now byte
  variable binding_mw was double now byte
  variable binding_mw_ignore_local was double now byte
  variable zipcode was strL now str5
  variable place_code was strL now str5
  variable countyfips was strL now str5
  variable cbsa10 was strL now str5
  variable zcta was strL now str5
  variable statefips was strL now str2
  (2,076,696,917 bytes saved)
       compress shrank data 37%
    strcompress shrank data  7% overall
(data now sorted by zipcode year month)
  (0 bytes saved)
===============================================================================
File: ../../../drive/derived_large/zipcode_month/zipcode_month_panel.dta
Key: zipcode year month
===============================================================================
  4858560:116(97548):2501920903:2681442405

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
        year |  4,858,560      2014.5    2.872282       2010       2019
       month |  4,858,560         6.5    3.452053          1         12
  place_code |          0
  countyfips |          0
-------------+---------------------------------------------------------
      cbsa10 |          0
        zcta |          0
   statefips |          0
       rural |  4,858,560     .444675    .4969298          0          1
   actual_mw |  4,858,560    7.933845    1.134234       7.25       16.3
-------------+---------------------------------------------------------
actual_mw_~l |  4,858,560    7.903267    1.042805       7.25         14
actua~w_mean |  4,858,560    7.931211    1.127842       7.25      16.09
actua~l_mean |  4,858,560     7.90244    1.042109       7.25         14
  binding_mw |  4,858,560    1.478447    .5596171          1          4
binding_mw~l |  4,858,560    1.454432    .4979193          1          2
-------------+---------------------------------------------------------
medDailyli~C |    872,235    107.2474    96.89177         11       2234
medli~e_SFCC |    919,398    296524.5    256996.8      12000    6995000
m~e_low_tier |    237,537    151736.7    94283.89      11750     939935
m~e_top_tier |    481,521    463979.4    350800.1     112450    7295000
medli~t_SFCC |  1,083,813    165.6305    135.7581   11.57113   2802.347
-------------+---------------------------------------------------------
m~t_low_tier |    296,286    121.5329    83.33472   11.50727   1672.388
m~t_top_tier |    516,368    206.6456    177.9822   31.52173   2799.423
medpctpric~C |    828,016    3.957614    1.949874   .0002196   48.27586
medren~e_1BR |     69,440    1607.937     670.499        350       5195
medren~e_2BR |    106,799    1766.741    879.0102        475      19500
-------------+---------------------------------------------------------
medren~e_3BR |     76,539    1928.871     1459.31        455      40000
medren~e_4BR |     10,310    3116.339    5197.041        435      50000
medren~e_5BR |        868     5715.09    7571.906       1250      50000
medre~e_SFCC |    192,932    1768.679    1527.426        500      50000
medrent~e_CC |     34,676     2105.65    938.7924        700       8975
-------------+---------------------------------------------------------
med~e_MFdxtx |     26,880    1979.011    832.9655        375       6646
m~e_Mfr5Plus |    175,096     1554.04    697.8883        375      20000
medrent~e_SF |    142,386    1778.371    1931.017        500      50000
med~e_Studio |     28,999    1670.905    1365.808        300      50000
medren~t_1BR |     55,424    2.191226    .9194792   .6388889   7.164352
-------------+---------------------------------------------------------
medren~t_2BR |     92,792    1.682865     .803698   .5015198   12.55461
medren~t_3BR |     67,139    1.233209    .8117302   .5060225       17.5
medren~t_4BR |      8,370     1.49865    2.559936   .5492424   21.85141
medren~t_5BR |        537    7.753782    7.031498   .3727683         22
medre~t_SFCC |    197,978    1.303812    1.033133   .1091193   23.96932
-------------+---------------------------------------------------------
medrent~t_CC |     30,608    2.170225    1.168605   .5835432   12.92755
med~t_MFdxtx |     11,949    2.451649    1.286775   .3627695   6.936796
m~t_Mfr5Plus |    146,858    1.736677     .849114   .3150482   12.55435
medrent~t_SF |    144,593       1.145    1.002039   .1039069   24.48466
med~t_Studio |     23,491    1.954625    1.574804   .4288971   7.347833
-------------+---------------------------------------------------------
Monthlylis~C |    946,793    127.9681    115.9901         11       2540
NewMonthly~C |    106,535     52.3928    31.51132         11        609
pctlisting~C |  1,108,016    13.15715     5.34997          0   47.94521
 Sale_Counts |  3,682,580    11.14501    19.84515          0        493
SalesPrevF~e |  2,623,186    .0326417    .1018719          0          1
-------------+---------------------------------------------------------
    zhvi_2BR |  3,011,088    148986.8    146056.2       7879    3893638
   zhvi_SFCC |  3,470,146    188959.5    191397.2       8565    6478929
      zhvi_C |  1,207,185    210632.7      177676      13759    3815192
     zhvi_SF |  3,466,100    197499.4    234385.7       8565    8737684
  zri_SFCCMF |  1,335,839        1355    876.0783        368      83894
-------------+---------------------------------------------------------
      zri_MF |    138,428    1516.469    639.5635        420      18349
exp_ln_mw_~t |  4,651,921    1.838236    .6482923          0   2.717869
exp_ln_mw~29 |  4,651,921     1.83833    .6482512          0   2.717998
exp_ln_mw~54 |  4,651,921    1.838148    .6483072          0   2.716045
exp_ln_mw~55 |  4,651,921    1.838352    .6484008          0   2.728399
-------------+---------------------------------------------------------
exp_ln_~1250 |  4,651,921     1.83863    .6483275          0   2.727933
exp_ln~_3333 |  4,651,921    1.838174    .6481771          0   2.712242
exp_ln~e3333 |  4,651,921    1.837933    .6483498          0   2.717088
exp_ln_mw~od |  4,651,921    1.838541    .6482052          0   2.682709
exp_ln_mw_~l |  4,651,921    1.837174    .6478489          0   2.716125
-------------+---------------------------------------------------------
exp_ln_mw~nd |  4,651,921    1.838335    .6484997          0   2.722974
exp_l~t_mean |  4,651,921    1.837911    .6480902          0   2.715743
exp_l~9_mean |  4,651,921    1.838009    .6480552          0   2.716658
exp_l~4_mean |  4,651,921    1.837822    .6481038          0   2.713424
exp_l~5_mean |  4,651,921    1.838023    .6481957          0    2.72756
-------------+---------------------------------------------------------
exp_l~0_mean |  4,651,921    1.838307    .6481328          0   2.726757
e~_3333_mean |  4,651,921    1.837849    .6479794          0   2.711327
e~e3333_mean |  4,651,921    1.837609    .6481408          0   2.714314
exp_~od_mean |  4,651,921    1.838184    .6479831          0   2.676806
exp_l~l_mean |  4,651,921    1.836802    .6476154          0   2.714507
-------------+---------------------------------------------------------
exp_~nd_mean |  4,651,921    1.838029    .6483094          0   2.720749
     acs_pop |  4,650,732    8108.076    13091.87          0   117602.2
  year_month |  4,858,560       659.5    34.63982        600        719
     quarter |  4,858,560         2.5    1.118034          1          4
year_quarter |  4,858,560       219.5     11.5434        200        239
-------------+---------------------------------------------------------
estcount_b~v |  4,854,978    2828.817    6806.733          1      57730
avgwwage_b~v |  4,854,978    948.0523    439.6909          0      26956
 emp_bizserv |  4,854,978    37474.11    93420.18          0     652629
estcount_c~t |  4,855,017    1050.926    2125.612          1      17241
avgwwage_c~t |  4,855,017    910.5774    324.5404          0       8024
-------------+---------------------------------------------------------
   emp_const |  4,855,017    10036.28    22364.88          0     174156
estcount_e~e |  4,853,259    3755.622    20496.05          1     247503
avgwwage_e~e |  4,853,259    768.9467    214.3253          0       2749
   emp_eduhe |  4,853,259     37565.1    92864.95          0     848521
estcount_f~v |  4,857,462    52.87869    68.72256          1        456
-------------+---------------------------------------------------------
avgwwage_f~v |  4,857,462    1191.605    297.2383          0       3704
  emp_fedgov |  4,857,462    5185.323    17235.78          0     215436
estcount_fin |  4,854,741    1439.249     3546.85          1      30868
avgwwage_fin |  4,854,741    1065.026    574.8995          0      12775
     emp_fin |  4,854,741    15100.98    39271.63          0     398481
-------------+---------------------------------------------------------
estcount_i~o |  4,813,272    308.2711    1151.362          1      13783
avgwwage_i~o |  4,813,272     994.954    637.4897          0      16227
    emp_info |  4,813,272    6736.924    24994.31          0     240358
estcount_l~s |  4,855,572     1400.56    3864.192          1      40355
avgwwage_l~s |  4,855,572    331.4314    125.5857          0       2473
-------------+---------------------------------------------------------
    emp_leis |  4,855,572    26512.77    65950.12          0     555057
estcount_l~v |  4,857,648    178.8059    449.8659          1       4167
avgwwage_l~v |  4,857,648    760.6394    295.6251          0       2104
  emp_locgov |  4,857,648    22126.57    58021.82          0     463785
estcount_m~u |  4,835,646    560.0872    1564.831          1      13469
-------------+---------------------------------------------------------
avgwwage_m~u |  4,835,646    1015.376    427.5311          0       7592
    emp_manu |  4,835,646    18152.39    47141.51          0     376653
estcount_n~s |  4,829,325    96.85565    198.2931          1       1859
avgwwage_n~s |  4,829,325    876.2701    569.2812          0      23770
  emp_natres |  4,829,325    1913.947    7515.101          0      97846
-------------+---------------------------------------------------------
estcount_s~v |  4,790,640    82.05751    355.9896          1       5969
avgwwage_s~v |  4,790,640     886.496    339.4341          0       4279
   emp_stgov |  4,790,640    6192.353    13383.41          0     114555
estcount_t~p |  4,857,573    2887.226    7098.591          1      59640
avgwwage_t~p |  4,857,573    715.4796    187.6325          0      11257
-------------+---------------------------------------------------------
  emp_transp |  4,857,573    44348.59    108596.8          0     875412




(note: file ../../../drive/derived_large/zipcode_month/zipcode_month_panel.dta 
> not found)
file ../../../drive/derived_large/zipcode_month/zipcode_month_panel.dta saved
(note: file ../../../drive/derived_large/zipcode_month/zipcode_month_panel.csv 
> not found)
file ../../../drive/derived_large/zipcode_month/zipcode_month_panel.csv saved

. 
end of do-file

 make.py ended: 2021-09-30 16:09:09
