
 make.py started: 2022-02-25 14:13:00 C:\Users\shermo\Documents\GitHub\min_wage_rent\derived\zipcode_month\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local in_geo      "../../../drive/derived_large/zipcode"
  2.     local in_mw_meas  "../../../drive/derived_large/min_wage_measures"
  3.     local in_zillow   "../../../drive/base_large/zillow"
  4.     local in_qcew     "../../../base/qcew/output"
  5.     local outstub     "../../../drive/derived_large/zipcode_month"
  6.     local logfile     "../output/data_file_manifest.log"
  7. 
.     use zipcode statefips countyfips cbsa10 using `in_geo'/zipcode_cross.dta,
>  clear
  8. 
.     merge 1:m zipcode using "`in_mw_meas'/zipcode_mw_res.dta",   ///
>        nogen assert(1 3)
  9. 
.     merge_exp_mw, instub(`in_mw_meas')
 10. 
.     merge_zillow, instub(`in_zillow')    
 11.     
.     make_date_variables
 12. 
.     merge m:1 statefips countyfips year month                                
> ///
>         using "`in_qcew'/ind_emp_wage_countymonth.dta", nogen keep(1 3)
 13.     drop qmon end_month
 14.         drop if (missing(zipcode) | missing(year_month))
 15. 
.     strcompress
 16.     save_data "`outstub'/zipcode_month_panel.dta", replace ///
>         key(zipcode year month) log(`logfile')
 17.     export delimited "`outstub'/zipcode_month_panel.csv", replace
 18. end

. 
. program merge_zillow
  1.     syntax, instub(str)
  2.     
.     merge 1:1 zipcode year month using "`instub'/zillow_zipcode_clean.dta"
  3. 
.     qui sum medrentpricepsqft_SFCC if _merge == 2 & inrange(year, 2010, 2019)
>     
  4.     assert r(N) == 0
  5.     keep if inlist(_merge, 1, 3)
  6.     drop _merge
  7. end

. 
. program merge_exp_mw
  1.     syntax, instub(str)
  2. 
.     merge 1:1 zipcode year month using "`instub'/zipcode_mw_wkp_2009.dta", //
> /
>         nogen keep(1 3)
  3.     foreach var of varlist mw_wkp* {
  4.         rename `var' `var'_`yy'
  5. 
.         local mw_vars "`varlist' `var'"
  6.     }
  7.     
.     forvalues yy = 10(1)18 {
  8.         merge 1:1 zipcode year month using "`instub'/zipcode_mw_wkp_20`yy'
> .dta", ///
>             nogen keep(1 3)
  9. 
.         foreach var of local mw_vars {
 10.             rename `var' `var'_`yy'
 11.         }
 12.     }
 13. 
.     foreach var of local mw_vars {
 14.         gen `var'_timevary = `var'_09 if year == 2009
 15.         forvalues yy = 10(1)18 {
 16.             replace `var'_timevary = `var'_`yy' if year == 2000 + `yy'
 17.         }
 18.     }
 19. end

. 
. program make_date_variables
  1.     gen day = 1
  2.     gen date = mdy(month, day, year)
  3. 
.     gen    year_month = mofd(date)
  4.     format year_month %tm
  5. 
.     gen    quarter      = quarter(dofm(year_month))
  6.     gen    year_quarter = qofd(date)
  7.     format year_quarter %tq
  8. 
.     drop day date
  9. end

. 
. 
. main

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         4,041,521  
    -----------------------------------------
(note: variable year was long, now double to accommodate using data's values)
(note: variable month was long, now double to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        26,924
        from master                    26,924  
        from using                          0  

    matched                         4,014,597  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        24,765
        from master                    24,765  
        from using                          0  

    matched                         4,016,756  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        27,178
        from master                    27,178  
        from using                          0  

    matched                         4,014,343  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        26,797
        from master                    26,797  
        from using                          0  

    matched                         4,014,724  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        28,067
        from master                    28,067  
        from using                          0  

    matched                         4,013,454  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        27,940
        from master                    27,940  
        from using                          0  

    matched                         4,013,581  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        27,686
        from master                    27,686  
        from using                          0  

    matched                         4,013,835  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        27,686
        from master                    27,686  
        from using                          0  

    matched                         4,013,835  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        26,797
        from master                    26,797  
        from using                          0  

    matched                         4,014,724  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        27,051
        from master                    27,051  
        from using                          0  

    matched                         4,014,470  
    -----------------------------------------
mw_wkp_other_serv_ind_09 not found
r(111);

end of do-file
r(111);

 make.py ended: 2022-02-25 14:15:25
