
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 120-user network perpetual
Serial number: 401606201670
  Licensed to: Brown University
               Brown University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.


Running c:\ado\personal\profile.do ...

. do ".\build.do" 

. clear all

. set more off

. 
. program main
  1.     load_data
  2.     create_vars
  3. 
.     xtset zipcode_num year
  4.     save ../output/panel.dta, replace
  5. 
.     estimate_SAFMR
  6.     esttab * using "../output/test.txt", se
  7. end

. 
. 
. program load_data
  1. 
.     use  ../../base/safmr/output/safmr_2017_2019_by_zipcode_cbsa.dta
  2. 
.     collapse (mean) safmr*, by(zipcode year)
  3. 
.     save ../output/safmr_2017_2019.dta, replace
  4. 
. 
.     use  ../../base/safmr/output/safmr_2012_2016_by_zipcode_county_cbsa.dta, 
> clear
  5. 
.     collapse (mean) safmr*, by(zipcode year)
  6. 
.     append using ../output/safmr_2017_2019.dta
  7. 
.     save ../output/safmr.dta, replace
  8. 
. 
.     use zipcode year zipcode_num countyfips statefips cbsa ///
>         mw_wkp_tot_* mw_res /// 
>         using ../../drive/derived_large/zipcode_year/zipcode_year.dta
  9. 
.     merge 1:1 zipcode year using ../output/safmr.dta, keep(3) nogen 
 10. end

. 
. program create_vars
  1.     destring cbsa, gen(cbsa_num)
  2. 
.     forval i = 0(1)4 {
  3.         gen ln_rents_`i'br = log(safmr`i'br)
  4.     }
  5. 
.     replace mw_wkp_tot_tvar_avg = mw_wkp_tot_18_avg if year == 2019
  6. end

. 
. program estimate_SAFMR
  1. 
.     forval i = 0(1)4 {
  2.         reghdfe ln_rents_`i'br mw_wkp_tot_16_avg mw_res, ///
>             absorb(zipcode cbsa_num##year) cluster(cbsa_num) nocons
  3.         est store safrm`i'br
  4.     }
  5. end

. 
. 
. main
file ../output/safmr_2017_2019.dta saved
file ../output/safmr.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           149,586  
    -----------------------------------------
cbsa: all characters numeric; cbsa_num generated as long
(19,267 real changes made)
       panel variable:  zipcode_num (unbalanced)
        time variable:  year, 2012 to 2019, but with gaps
                delta:  1 unit
file ../output/panel.dta saved
(dropped 996 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =    148,131
Absorbing 2 HDFE groups                           F(   2,    618) =       3.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0325
                                                  R-squared       =     0.9586
                                                  Adj R-squared   =     0.9506
                                                  Within R-sq.    =     0.0146
Number of clusters (cbsa_num) =        619        Root MSE        =     0.0774

                             (Std. Err. adjusted for 619 clusters in cbsa_num)
------------------------------------------------------------------------------
             |               Robust
ln_rents_0br |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp~6_avg |   .5072944   .1968029     2.58   0.010     .1208109    .8937778
      mw_res |  -.0947608   .0830036    -1.14   0.254    -.2577641    .0682425
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
         zipcode |     19355       19355           0    *|
   cbsa_num#year |      4656        4656           0    *|
---------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(dropped 996 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =    148,131
Absorbing 2 HDFE groups                           F(   2,    618) =       4.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0122
                                                  R-squared       =     0.9593
                                                  Adj R-squared   =     0.9514
                                                  Within R-sq.    =     0.0123
Number of clusters (cbsa_num) =        619        Root MSE        =     0.0750

                             (Std. Err. adjusted for 619 clusters in cbsa_num)
------------------------------------------------------------------------------
             |               Robust
ln_rents_1br |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp~6_avg |   .4722485   .1697403     2.78   0.006     .1389107    .8055862
      mw_res |  -.1035181   .0714968    -1.45   0.148    -.2439243    .0368881
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
         zipcode |     19355       19355           0    *|
   cbsa_num#year |      4656        4656           0    *|
---------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(dropped 996 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =    148,131
Absorbing 2 HDFE groups                           F(   2,    618) =       4.82
Statistics robust to heteroskedasticity           Prob > F        =     0.0084
                                                  R-squared       =     0.9585
                                                  Adj R-squared   =     0.9505
                                                  Within R-sq.    =     0.0074
Number of clusters (cbsa_num) =        619        Root MSE        =     0.0733

                             (Std. Err. adjusted for 619 clusters in cbsa_num)
------------------------------------------------------------------------------
             |               Robust
ln_rents_2br |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp~6_avg |   .3430942   .1279768     2.68   0.008      .091772    .5944164
      mw_res |   -.066206   .0629533    -1.05   0.293    -.1898344    .0574223
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
         zipcode |     19355       19355           0    *|
   cbsa_num#year |      4656        4656           0    *|
---------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(dropped 996 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =    148,131
Absorbing 2 HDFE groups                           F(   2,    618) =       4.87
Statistics robust to heteroskedasticity           Prob > F        =     0.0080
                                                  R-squared       =     0.9589
                                                  Adj R-squared   =     0.9510
                                                  Within R-sq.    =     0.0055
Number of clusters (cbsa_num) =        619        Root MSE        =     0.0735

                             (Std. Err. adjusted for 619 clusters in cbsa_num)
------------------------------------------------------------------------------
             |               Robust
ln_rents_3br |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp~6_avg |   .3178039   .1106753     2.87   0.004     .1004586    .5351491
      mw_res |  -.0760705   .0541882    -1.40   0.161    -.1824858    .0303447
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
         zipcode |     19355       19355           0    *|
   cbsa_num#year |      4656        4656           0    *|
---------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(dropped 996 singleton observations)
(MWFE estimator converged in 11 iterations)

HDFE Linear regression                            Number of obs   =    148,131
Absorbing 2 HDFE groups                           F(   2,    618) =       4.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0172
                                                  R-squared       =     0.9609
                                                  Adj R-squared   =     0.9533
                                                  Within R-sq.    =     0.0018
Number of clusters (cbsa_num) =        619        Root MSE        =     0.0752

                             (Std. Err. adjusted for 619 clusters in cbsa_num)
------------------------------------------------------------------------------
             |               Robust
ln_rents_4br |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
mw_wkp~6_avg |   .1454697    .117657     1.24   0.217    -.0855864    .3765257
      mw_res |  -.0114239   .0556951    -0.21   0.838    -.1207986    .0979508
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------+
     Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------+---------------------------------------|
         zipcode |     19355       19355           0    *|
   cbsa_num#year |      4656        4656           0    *|
---------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(output written to ../output/test.txt)

. 
end of do-file
