
 make.py started: 2020-03-05 10:39:11 C:\Users\dgentil1\Desktop\min_wage\min_wage_rent\base\code 




Execute:  R CMD BATCH --no-save "./RenameZillowVars_zipLevel.R" RenameZillowVars_zipLevel.Rout
ERROR! Command R CMD BATCH --no-save "./RenameZillowVars_zipLevel.R" RenameZillowVars_zipLevel.Rout executed with errors 
Command 'R CMD BATCH --no-save "./RenameZillowVars_zipLevel.R" RenameZillowVars_zipLevel.Rout' returned non-zero exit status 1

R version 3.4.3 (2017-11-30) -- "Kite-Eating Tree"
Copyright (C) 2017 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> source('../../lib/R/fwrite_key.R')
> source('../../lib/R/setkey_unique.R')
> source('../../lib/R/load_packages.R')
> load_packages(c('tidyverse', 'data.table'))
Installing package into 'C:/Users/dgentil1/Documents/R/win-library/3.4'
(as 'lib' is unspecified)
also installing the dependencies 'ellipsis', 'vctrs', 'lifecycle', 'broom', 'dbplyr', 'dplyr', 'ggplot2', 'haven', 'hms', 'modelr', 'purrr', 'rlang', 'tibble', 'tidyr', 'xml2'


  There are binary versions available but the source versions are later:
           binary source needs_compilation
ellipsis    0.1.0  0.3.0              TRUE
vctrs       0.1.0  0.2.3              TRUE
broom       0.5.2  0.5.5             FALSE
dbplyr      1.4.0  1.4.2             FALSE
dplyr     0.8.0.1  0.8.4              TRUE
ggplot2     3.1.1  3.2.1             FALSE
haven       2.1.0  2.2.0              TRUE
hms         0.4.2  0.5.3             FALSE
modelr      0.1.4  0.1.6             FALSE
purrr       0.3.2  0.3.3              TRUE
rlang       0.3.4  0.4.5              TRUE
tibble      2.1.1  2.1.3              TRUE
tidyr       0.8.3  1.0.2              TRUE
xml2        1.2.0  1.2.2              TRUE
tidyverse   1.2.1  1.3.0             FALSE

  Binaries will be installed
trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/ellipsis_0.1.0.zip'
Content type 'application/zip' length 30847 bytes (30 KB)
==================================================
downloaded 30 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/vctrs_0.1.0.zip'
Content type 'application/zip' length 499748 bytes (488 KB)
==================================================
downloaded 488 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/dplyr_0.8.0.1.zip'
Content type 'application/zip' length 3029353 bytes (2.9 MB)
==================================================
downloaded 2.9 MB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/haven_2.1.0.zip'
Content type 'application/zip' length 988500 bytes (965 KB)
==================================================
downloaded 965 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/purrr_0.3.2.zip'
Content type 'application/zip' length 327437 bytes (319 KB)
==================================================
downloaded 319 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/rlang_0.3.4.zip'
Content type 'application/zip' length 1080437 bytes (1.0 MB)
==================================================
downloaded 1.0 MB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/tibble_2.1.1.zip'
Content type 'application/zip' length 238931 bytes (233 KB)
==================================================
downloaded 233 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/tidyr_0.8.3.zip'
Content type 'application/zip' length 907112 bytes (885 KB)
==================================================
downloaded 885 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/xml2_1.2.0.zip'
Content type 'application/zip' length 3543977 bytes (3.4 MB)
==================================================
downloaded 3.4 MB

package 'ellipsis' successfully unpacked and MD5 sums checked
package 'vctrs' successfully unpacked and MD5 sums checked
package 'dplyr' successfully unpacked and MD5 sums checked
package 'haven' successfully unpacked and MD5 sums checked
package 'purrr' successfully unpacked and MD5 sums checked
package 'rlang' successfully unpacked and MD5 sums checked
package 'tibble' successfully unpacked and MD5 sums checked
package 'tidyr' successfully unpacked and MD5 sums checked
package 'xml2' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\dgentil1\AppData\Local\Temp\RtmpSmyoZp\downloaded_packages
installing the source packages 'lifecycle', 'broom', 'dbplyr', 'ggplot2', 'hms', 'modelr', 'tidyverse'

trying URL 'http://cran.rstudio.com/src/contrib/lifecycle_0.1.0.tar.gz'
Content type 'application/x-gzip' length 150752 bytes (147 KB)
==================================================
downloaded 147 KB

trying URL 'http://cran.rstudio.com/src/contrib/broom_0.5.5.tar.gz'
Content type 'application/x-gzip' length 1223871 bytes (1.2 MB)
==================================================
downloaded 1.2 MB

trying URL 'http://cran.rstudio.com/src/contrib/dbplyr_1.4.2.tar.gz'
Content type 'application/x-gzip' length 303397 bytes (296 KB)
==================================================
downloaded 296 KB

trying URL 'http://cran.rstudio.com/src/contrib/ggplot2_3.2.1.tar.gz'
Content type 'application/x-gzip' length 3204655 bytes (3.1 MB)
==================================================
downloaded 3.1 MB

trying URL 'http://cran.rstudio.com/src/contrib/hms_0.5.3.tar.gz'
Content type 'application/x-gzip' length 134669 bytes (131 KB)
==================================================
downloaded 131 KB

trying URL 'http://cran.rstudio.com/src/contrib/modelr_0.1.6.tar.gz'
Content type 'application/x-gzip' length 121295 bytes (118 KB)
==================================================
downloaded 118 KB

trying URL 'http://cran.rstudio.com/src/contrib/tidyverse_1.3.0.tar.gz'
Content type 'application/x-gzip' length 712837 bytes (696 KB)
==================================================
downloaded 696 KB

* installing *source* package 'lifecycle' ...
** package 'lifecycle' successfully unpacked and MD5 sums checked
** R
** inst
** preparing package for lazy loading
Error in loadNamespace(i, c(lib.loc, .libPaths()), versionCheck = vI[[i]]) : 
  namespace 'rlang' 0.3.4 is being loaded, but >= 0.4.0 is required
ERROR: lazy loading failed for package 'lifecycle'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/lifecycle'
In R CMD INSTALL
* installing *source* package 'broom' ...
** package 'broom' successfully unpacked and MD5 sums checked
** R
** data
*** moving datasets to lazyload DB
** inst
** preparing package for lazy loading
Error in loadNamespace(j <- i[[1L]], c(lib.loc, .libPaths()), versionCheck = vI[[j]]) : 
  namespace 'pkgconfig' 2.0.1 is already loaded, but >= 2.0.2 is required
ERROR: lazy loading failed for package 'broom'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/broom'
In R CMD INSTALL
* installing *source* package 'dbplyr' ...
** package 'dbplyr' successfully unpacked and MD5 sums checked
** R
** inst
** preparing package for lazy loading
Error in loadNamespace(j <- i[[1L]], c(lib.loc, .libPaths()), versionCheck = vI[[j]]) : 
  namespace 'pkgconfig' 2.0.1 is already loaded, but >= 2.0.2 is required
ERROR: lazy loading failed for package 'dbplyr'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/dbplyr'
In R CMD INSTALL
* installing *source* package 'ggplot2' ...
** package 'ggplot2' successfully unpacked and MD5 sums checked
** R
** data
*** moving datasets to lazyload DB
** inst
** preparing package for lazy loading
Error in loadNamespace(j <- i[[1L]], c(lib.loc, .libPaths()), versionCheck = vI[[j]]) : 
  namespace 'pkgconfig' 2.0.1 is being loaded, but >= 2.0.2 is required
ERROR: lazy loading failed for package 'ggplot2'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/ggplot2'
* restoring previous 'C:/Users/dgentil1/Documents/R/win-library/3.4/ggplot2'
In R CMD INSTALL
* installing *source* package 'hms' ...
** package 'hms' successfully unpacked and MD5 sums checked
** R
** preparing package for lazy loading
Error in loadNamespace(i, c(lib.loc, .libPaths()), versionCheck = vI[[i]]) : 
  namespace 'vctrs' 0.1.0 is being loaded, but >= 0.2.1 is required
ERROR: lazy loading failed for package 'hms'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/hms'
* restoring previous 'C:/Users/dgentil1/Documents/R/win-library/3.4/hms'
In R CMD INSTALL
ERROR: dependency 'broom' is not available for package 'modelr'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/modelr'
In R CMD INSTALL
ERROR: dependencies 'broom', 'dbplyr', 'modelr' are not available for package 'tidyverse'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/tidyverse'
In R CMD INSTALL

The downloaded source packages are in
	'C:\Users\dgentil1\AppData\Local\Temp\RtmpSmyoZp\downloaded_packages'
Error in library(name, character.only = TRUE) : 
  there is no package called 'tidyverse'
Calls: load_packages -> library
In addition: There were 14 warnings (use warnings() to see them)
Execution halted


Execute:  R CMD BATCH --no-save "./cleanGeoRelationshipFiles.R" cleanGeoRelationshipFiles.Rout
ERROR! Command R CMD BATCH --no-save "./cleanGeoRelationshipFiles.R" cleanGeoRelationshipFiles.Rout executed with errors 
Command 'R CMD BATCH --no-save "./cleanGeoRelationshipFiles.R" cleanGeoRelationshipFiles.Rout' returned non-zero exit status 1

R version 3.4.3 (2017-11-30) -- "Kite-Eating Tree"
Copyright (C) 2017 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> source('../../lib/R/fwrite_key.R')
> source('../../lib/R/setkey_unique.R')
> source('../../lib/R/load_packages.R')
> load_packages(c('tidyverse', 'data.table', 'tidycensus'))
Installing package into 'C:/Users/dgentil1/Documents/R/win-library/3.4'
(as 'lib' is unspecified)
also installing the dependencies 'ellipsis', 'vctrs', 'lifecycle', 'broom', 'dbplyr', 'dplyr', 'ggplot2', 'haven', 'hms', 'modelr', 'purrr', 'rlang', 'tibble', 'tidyr', 'xml2'


  There are binary versions available but the source versions are later:
           binary source needs_compilation
ellipsis    0.1.0  0.3.0              TRUE
vctrs       0.1.0  0.2.3              TRUE
broom       0.5.2  0.5.5             FALSE
dbplyr      1.4.0  1.4.2             FALSE
dplyr     0.8.0.1  0.8.4              TRUE
ggplot2     3.1.1  3.2.1             FALSE
haven       2.1.0  2.2.0              TRUE
hms         0.4.2  0.5.3             FALSE
modelr      0.1.4  0.1.6             FALSE
purrr       0.3.2  0.3.3              TRUE
rlang       0.3.4  0.4.5              TRUE
tibble      2.1.1  2.1.3              TRUE
tidyr       0.8.3  1.0.2              TRUE
xml2        1.2.0  1.2.2              TRUE
tidyverse   1.2.1  1.3.0             FALSE

  Binaries will be installed
trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/ellipsis_0.1.0.zip'
Content type 'application/zip' length 30847 bytes (30 KB)
==================================================
downloaded 30 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/vctrs_0.1.0.zip'
Content type 'application/zip' length 499748 bytes (488 KB)
==================================================
downloaded 488 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/dplyr_0.8.0.1.zip'
Content type 'application/zip' length 3029353 bytes (2.9 MB)
==================================================
downloaded 2.9 MB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/haven_2.1.0.zip'
Content type 'application/zip' length 988500 bytes (965 KB)
==================================================
downloaded 965 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/purrr_0.3.2.zip'
Content type 'application/zip' length 327437 bytes (319 KB)
==================================================
downloaded 319 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/rlang_0.3.4.zip'
Content type 'application/zip' length 1080437 bytes (1.0 MB)
==================================================
downloaded 1.0 MB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/tibble_2.1.1.zip'
Content type 'application/zip' length 238931 bytes (233 KB)
==================================================
downloaded 233 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/tidyr_0.8.3.zip'
Content type 'application/zip' length 907112 bytes (885 KB)
==================================================
downloaded 885 KB

trying URL 'http://cran.rstudio.com/bin/windows/contrib/3.4/xml2_1.2.0.zip'
Content type 'application/zip' length 3543977 bytes (3.4 MB)
==================================================
downloaded 3.4 MB

package 'ellipsis' successfully unpacked and MD5 sums checked
package 'vctrs' successfully unpacked and MD5 sums checked
package 'dplyr' successfully unpacked and MD5 sums checked
package 'haven' successfully unpacked and MD5 sums checked
package 'purrr' successfully unpacked and MD5 sums checked
package 'rlang' successfully unpacked and MD5 sums checked
package 'tibble' successfully unpacked and MD5 sums checked
package 'tidyr' successfully unpacked and MD5 sums checked
package 'xml2' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\dgentil1\AppData\Local\Temp\RtmpctS1X2\downloaded_packages
installing the source packages 'lifecycle', 'broom', 'dbplyr', 'ggplot2', 'hms', 'modelr', 'tidyverse'

trying URL 'http://cran.rstudio.com/src/contrib/lifecycle_0.1.0.tar.gz'
Content type 'application/x-gzip' length 150752 bytes (147 KB)
==================================================
downloaded 147 KB

trying URL 'http://cran.rstudio.com/src/contrib/broom_0.5.5.tar.gz'
Content type 'application/x-gzip' length 1223871 bytes (1.2 MB)
==================================================
downloaded 1.2 MB

trying URL 'http://cran.rstudio.com/src/contrib/dbplyr_1.4.2.tar.gz'
Content type 'application/x-gzip' length 303397 bytes (296 KB)
==================================================
downloaded 296 KB

trying URL 'http://cran.rstudio.com/src/contrib/ggplot2_3.2.1.tar.gz'
Content type 'application/x-gzip' length 3204655 bytes (3.1 MB)
==================================================
downloaded 3.1 MB

trying URL 'http://cran.rstudio.com/src/contrib/hms_0.5.3.tar.gz'
Content type 'application/x-gzip' length 134669 bytes (131 KB)
==================================================
downloaded 131 KB

trying URL 'http://cran.rstudio.com/src/contrib/modelr_0.1.6.tar.gz'
Content type 'application/x-gzip' length 121295 bytes (118 KB)
==================================================
downloaded 118 KB

trying URL 'http://cran.rstudio.com/src/contrib/tidyverse_1.3.0.tar.gz'
Content type 'application/x-gzip' length 712837 bytes (696 KB)
==================================================
downloaded 696 KB

* installing *source* package 'lifecycle' ...
** package 'lifecycle' successfully unpacked and MD5 sums checked
** R
** inst
** preparing package for lazy loading
Error in loadNamespace(i, c(lib.loc, .libPaths()), versionCheck = vI[[i]]) : 
  namespace 'rlang' 0.3.4 is being loaded, but >= 0.4.0 is required
ERROR: lazy loading failed for package 'lifecycle'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/lifecycle'
In R CMD INSTALL
* installing *source* package 'broom' ...
** package 'broom' successfully unpacked and MD5 sums checked
** R
** data
*** moving datasets to lazyload DB
** inst
** preparing package for lazy loading
Error in loadNamespace(j <- i[[1L]], c(lib.loc, .libPaths()), versionCheck = vI[[j]]) : 
  namespace 'pkgconfig' 2.0.1 is already loaded, but >= 2.0.2 is required
ERROR: lazy loading failed for package 'broom'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/broom'
In R CMD INSTALL
* installing *source* package 'dbplyr' ...
** package 'dbplyr' successfully unpacked and MD5 sums checked
** R
** inst
** preparing package for lazy loading
Error in loadNamespace(j <- i[[1L]], c(lib.loc, .libPaths()), versionCheck = vI[[j]]) : 
  namespace 'pkgconfig' 2.0.1 is already loaded, but >= 2.0.2 is required
ERROR: lazy loading failed for package 'dbplyr'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/dbplyr'
In R CMD INSTALL
* installing *source* package 'ggplot2' ...
** package 'ggplot2' successfully unpacked and MD5 sums checked
** R
** data
*** moving datasets to lazyload DB
** inst
** preparing package for lazy loading
Error in loadNamespace(j <- i[[1L]], c(lib.loc, .libPaths()), versionCheck = vI[[j]]) : 
  namespace 'pkgconfig' 2.0.1 is being loaded, but >= 2.0.2 is required
ERROR: lazy loading failed for package 'ggplot2'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/ggplot2'
* restoring previous 'C:/Users/dgentil1/Documents/R/win-library/3.4/ggplot2'
In R CMD INSTALL
* installing *source* package 'hms' ...
** package 'hms' successfully unpacked and MD5 sums checked
** R
** preparing package for lazy loading
Error in loadNamespace(i, c(lib.loc, .libPaths()), versionCheck = vI[[i]]) : 
  namespace 'vctrs' 0.1.0 is being loaded, but >= 0.2.1 is required
ERROR: lazy loading failed for package 'hms'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/hms'
* restoring previous 'C:/Users/dgentil1/Documents/R/win-library/3.4/hms'
In R CMD INSTALL
ERROR: dependency 'broom' is not available for package 'modelr'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/modelr'
In R CMD INSTALL
ERROR: dependencies 'broom', 'dbplyr', 'modelr' are not available for package 'tidyverse'
* removing 'C:/Users/dgentil1/Documents/R/win-library/3.4/tidyverse'
In R CMD INSTALL

The downloaded source packages are in
	'C:\Users\dgentil1\AppData\Local\Temp\RtmpctS1X2\downloaded_packages'
Error in library(name, character.only = TRUE) : 
  there is no package called 'tidyverse'
Calls: load_packages -> library
In addition: There were 14 warnings (use warnings() to see them)
Execution halted


Execute:  "C:\Program Files (x86)\Stata14\StataSE-64.exe" /e do "./state_mw.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401406206058
         Licensed to:  CIS Department
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./state_mw.do 

. set more off

. clear all

. adopath + ../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata14\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata14\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/gslab_misc/ado"

. 
. program main
  1.         local raw "../../raw_data/min_wage/"
  2.         local exports "../output/"
  3.         local temp "../temp/"
  4. 
.         import_crosswalk, instub(`raw') outstub(`temp')
  5.         local fips = r(fips)
  6. 
.         fed_min_wage_change, instub(`raw') outstub(`exports') 
  7.         add_state_to_fedmw,  fips("`fips'") outstub(`temp')
  8.         state_min_wage_change, instub(`raw') outstub(`exports') temp(`temp
> ')
  9.         
.         prepare_finaldata, begindate(01may1974) finaldate(01jul2016)         
>   ///
>                                            outstub(`temp') temp(`temp')
 10.         
.         export_state_daily,     instub(`temp') outstub(`exports')
 11.         export_state_monthly,   instub(`temp') outstub(`exports')
 12.         export_state_quarterly, instub(`temp') outstub(`exports')
 13.         export_state_annually,  instub(`temp') outstub(`exports')
 14. end

. 
. program import_crosswalk, rclass
  1.         syntax, instub(str) outstub(str)
  2. 
.         import excel using `instub'FIPS_crosswalk.xlsx, clear firstrow
  3.         rename (Name       FIPSStateNumericCode  OfficialUSPSCode)        
>    ///
>                    (statename  statefips             stateabb)
  4.         drop sname
  5. 
.         replace stateabb = upper(stateabb)
  6.         label var stateabb "State Abbreviation"
  7.         
.         save_data `outstub'crosswalk.dta, replace key(statename) log(none)
  8. 
.         levelsof statefips, local(fips)
  9.         return local fips "`fips'"
 10. end

. 
. program fed_min_wage_change
  1.         syntax, instub(str) outstub(str)
  2. 
.         import excel using `instub'VZ_FederalMinimumWage_Changes.xlsx, clear 
> firstrow
  3.         rename Fed_mw fed_mw
  4.         keep year month day fed_mw source
  5. 
.         gen date = mdy(month, day, year)
  6.         format date %td
  7. 
.         replace fed_mw = round(fed_mw, .01)
  8.         label var fed_mw "Federal Minimum Wage"
  9. 
.         order year month day date fed_mw source
 10. 
.         isid date, sort
 11.         export delim using `outstub'VZ_federal_changes.csv, replace
 12. end

. 
. program add_state_to_fedmw
  1.         syntax, fips(str) outstub(str)
  2.         
.         tsset date
  3.         tsfill
  4. 
.         carryforward year month day fed_mw, replace
  5. 
.         keep date fed_mw
  6. 
.         tempfile temp
  7.         save `temp'
  8.         
.         foreach i in `fips' {
  9.                 use `temp', clear
 10.                 gen statefips = `i'
 11.                 tempfile state`i'
 12.                 save `state`i''
 13.         }
 14.         foreach i in `fips' {
 15.                 if `i' == 1 use `state`i'', clear
 16.                 else quietly append using `state`i''
 17.         }
 18. 
.         compress
 19.         save `outstub'fedmw.dta, replace
 20. end

. 
. program state_min_wage_change 
  1.         syntax, instub(str) outstub(str) temp(str)
  2. 
.         import excel using `instub'VZ_StateMinimumWage_Changes.xlsx, clear fi
> rstrow
  3. 
.         gen date = mdy(month,day,year)
  4.         format date %td
  5. 
.         gen double mw = round(VZ_mw, .01)
  6.         gen double mw_healthinsurance = round(VZ_mw_healthinsurance, .01)
  7.         gen double mw_smallbusiness   = round(VZ_mw_smallbusiness, .01)
  8.         drop VZ_mw*
  9. 
.         merge m:1 statefips using `temp'crosswalk.dta, nogen assert(3)
 10. 
.         order statefips statename stateabb year month day date mw* source sou
> rce_2 source_notes
 11.         label var statefips "State FIPS Code"
 12.         label var statename "State"
 13. 
.         sort stateabb date
 14.         
.         isid statefips date, sort
 15.         export delim using `outstub'VZ_state_changes.csv, replace 
 16. 
.         tsset statefips date
 17.         tsfill
 18. 
.         keep statefips date mw* source_notes
 19. 
.         foreach x of varlist source_notes {
 20.                 bysort statefips (date): replace `x' = `x'[_n-1] if `x' ==
>  ""
 21.         }
 22.         foreach x of varlist mw* {
 23.                 bysort statefips (date): replace `x' = `x'[_n-1] if `x' ==
>  .
 24.         }
 25. end 

. 
. program prepare_finaldata       
  1.         syntax, begindate(str) finaldate(str) outstub(str) temp(str)
  2. 
.         merge 1:1 statefips date using `temp'fedmw.dta, nogenerate
  3.         merge m:1 statefips using `temp'crosswalk.dta, nogen assert(3)
  4. 
.         gen mw_adj = mw
  5.         replace mw_adj = fed_mw if fed_mw >= mw & fed_mw ~= .
  6.         replace mw_adj = fed_mw if mw == . & fed_mw ~= .
  7.         drop mw
  8.         rename mw_adj mw
  9. 
.         keep if date >= td(`begindate') & date <= td(`finaldate')
 10. 
.         order statefips statename stateabb date fed_mw mw
 11.         label var mw "State Minimum Wage"
 12.         notes mw: The mw variable represents the higher rate between the s
> tate and federal minimum wage
 13. 
.         save_data `outstub'data.dta, replace key(statefips date) log(none)
 14. end

. 
. program export_state_daily
  1.         syntax, instub(str) outstub(str)
  2. 
.         use `instub'data.dta, clear
  3. 
.         isid stateabb date, sort
  4.         export delim using `outstub'VZ_state_daily.csv, replace 
  5. end

. 
. program export_state_monthly
  1.         syntax, instub(str) outstub(str)
  2. 
.         use `instub'data.dta, clear
  3. 
.         gen monthly_date = mofd(date)
  4.         format monthly_date %tm
  5. 
.         collapse (min) min_fed_mw = fed_mw min_mw = mw           ///
>                  (mean) mean_fed_mw = fed_mw mean_mw = mw        ///
>                  (max) max_fed_mw = fed_mw max_mw = mw,          ///
>                  by(statefips statename stateabb monthly_date)
  6. 
.         label var monthly_date "Monthly Date"
  7.         label_mw_vars, time_level("Monthly")
  8. 
.         isid stateabb monthly_date, sort
  9.         export delim using `outstub'VZ_state_monthly.csv, replace
 10. end

. 
. program export_state_quarterly
  1.         syntax, instub(str) outstub(str)
  2. 
.         use `instub'data.dta, clear
  3. 
.         gen quarterly_date = qofd(date)
  4.         format quarterly_date %tq
  5. 
.         collapse (min) min_fed_mw = fed_mw min_mw = mw           ///
>                  (mean) mean_fed_mw = fed_mw mean_mw = mw        ///
>                  (max) max_fed_mw = fed_mw max_mw = mw,          ///
>                  by(statefips statename stateabb quarterly_date)
  6. 
.         label var quarterly_date "Quarterly Date"
  7.         label_mw_vars, time_level("Quarterly")
  8. 
.         sort stateabb quarterly_date
  9. 
.         export delim using `outstub'VZ_state_quarterly.csv, replace 
 10. end

. 
. program export_state_annually
  1.         syntax, instub(str) outstub(str)
  2. 
.         use `instub'data.dta, clear
  3. 
.         gen year = yofd(date)
  4.         format year %ty
  5. 
.         collapse (min) min_fed_mw = fed_mw min_mw = mw           ///
>                  (mean) mean_fed_mw = fed_mw mean_mw = mw        ///
>                  (max) max_fed_mw = fed_mw max_mw = mw,          ///
>                  by(statefips statename stateabb year)
  6. 
.         label var year "Year"
  7.         label_mw_vars, time_level("Annual")
  8. 
.         sort stateabb year
  9. 
.         export delim using `outstub'VZ_state_annual.csv, replace 
 10. end

. 
. program label_mw_vars
  1.         syntax, time_level(str)
  2. 
.         label var min_fed_mw  "`time_level' Federal Minimum"
  3.         label var min_mw      "`time_level' State Minimum"
  4. 
.         label var mean_fed_mw "`time_level' Federal Average"
  5.         label var mean_mw     "`time_level' State Average"
  6. 
.         label var max_fed_mw  "`time_level' Federal Maximum"
  7.         label var max_mw      "`time_level' State Maximum"      
  8. end

. 
. *EXECUTE
. main 
(0 real changes made)
(data now sorted by statename)
  (0 bytes saved)
===============================================================================
> ===================
File: ../temp/crosswalk.dta
Key: statename
===============================================================================
> ===================
  51:3(112010):1169891571:1356275751

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statename |          0
   statefips |         51    28.96078    15.83283          1         56
    stateabb |          0




(note: file ../temp/crosswalk.dta not found)
file ../temp/crosswalk.dta saved
1 2 4 5 6 8 9 10 11 12 13 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32
>  33 34 35 36 37 38 39 40 41 42 44 45 46 47 48 49 50 51 53 54 55 56
(3 real changes made)
(data now sorted by date)
(note: file ../output/VZ_federal_changes.csv not found)
file ../output/VZ_federal_changes.csv saved
        time variable:  date, 01may1974 to 01jul2016, but with gaps
                delta:  1 day
year:  (15,388 real changes made)
month:  (15,388 real changes made)
day:  (15,388 real changes made)
fed_mw:  (15,388 real changes made)
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000001.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000002.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000003.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000004.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000005.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000006.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000007.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000008.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000009.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000a.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000b.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000c.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000d.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000e.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000f.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000g.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000h.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000i.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000j.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000k.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000l.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000m.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000n.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000o.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000p.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000q.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000r.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000s.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000t.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000u.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000v.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000w.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100000x.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000010.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000011.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000012.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000013.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000014.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000015.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000016.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000017.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000018.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_01000019.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100001a.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100001b.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100001c.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100001d.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100001e.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100001f.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100001g.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100001h.tmp saved
file C:\Users\dgentil1\AppData\Local\Temp\ST_0100001i.tmp saved
  variable date was float now int
  variable statefips was float now byte
  (3,927,765 bytes saved)
(note: file ../temp/fedmw.dta not found)
file ../temp/fedmw.dta saved
(596 missing values generated)
(578 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               602  
    -----------------------------------------
(data now sorted by statefips date)
(note: file ../output/VZ_state_changes.csv not found)
file ../output/VZ_state_changes.csv saved
       panel variable:  statefips (unbalanced)
        time variable:  date, 08feb1943 to 31dec2020, but with gaps
                delta:  1 day
(75,247 real changes made)
(510,767 real changes made)
(3,498 real changes made)
(22,867 real changes made)

    Result                           # of obs.
    -----------------------------------------
    not matched                       415,958
        from master                    70,887  
        from using                    345,071  

    matched                           440,482  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           856,440  
    -----------------------------------------
(345,071 missing values generated)
(85,166 real changes made)
(345,071 real changes made)
(70,887 observations deleted)
(data now sorted by statefips date)
  variable date was float now int
  (1,571,106 bytes saved)
===============================================================================
> ===================
File: ../temp/data.dta
Key: statefips date
===============================================================================
> ===================
  785553:9(106708):954589161:295318411

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statefips |    785,553    28.96078    15.67685          1         56
        date |    785,553       12935    4446.466       5234      20636
   statename |          0
    stateabb |          0
      fed_mw |    785,553    4.573745    1.564033          2       7.25
-------------+---------------------------------------------------------
          mw |    785,553    4.765857    1.762111          2       11.5
mw_healthi~e |      3,504    6.698716    .7869183       5.15       7.25
mw_smallbu~s |     22,860    5.017288    1.101783          4       7.25
source_notes |          0




(note: file ../temp/data.dta not found)
file ../temp/data.dta saved
(data now sorted by stateabb date)
(note: file ../output/VZ_state_daily.csv not found)
file ../output/VZ_state_daily.csv saved
(data now sorted by stateabb monthly_date)
(note: file ../output/VZ_state_monthly.csv not found)
file ../output/VZ_state_monthly.csv saved
(note: file ../output/VZ_state_quarterly.csv not found)
file ../output/VZ_state_quarterly.csv saved
(note: file ../output/VZ_state_annual.csv not found)
file ../output/VZ_state_annual.csv saved

. 
end of do-file


Execute:  "C:\Program Files (x86)\Stata14\StataSE-64.exe" /e do "./substate_mw.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.2   Copyright 1985-2015 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401406206058
         Licensed to:  CIS Department
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./substate_mw.do 

. set more off

. clear all

. adopath + ../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata14\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata14\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/gslab_misc/ado"

. 
. program main 
  1.         import_crosswalk
  2.         substate_min_wage_change "VZ_SubstateMinimumWage_Changes"
  3.         prepare_local
  4.         prepare_state 01Jul2016
  5.         prepare_finaldata 01Jul2016
  6. 
.         export_substate_daily
  7.         export_substate_monthly
  8.         export_substate_quarterly
  9.         export_substate_annually
 10. end 

. 
. program import_crosswalk
  1.         import excel using "../../raw_data/min_wage/FIPS_crosswalk.xlsx", 
> clear firstrow 
  2.         
.         rename Name statename
  3.         rename FIPSStateNumericCode statefips
  4.         rename OfficialUSPSCode stateabb
  5.         replace stateabb = upper(stateabb)
  6.         keep statename statefips stateabb
  7. 
.         save ${temp}crosswalk.dta, replace
  8. end

. 
. program substate_min_wage_change
  1.         args substate
  2.         import excel using "../../raw_data/min_wage/`substate'.xlsx", clea
> r firstrow
  3. 
.         gen date = mdy(month,day,year)
  4.         format date %td
  5. 
.         gen double mw = round(VZ_mw, .01)
  6.         gen double mw_tipped = round(VZ_mw_tipped, .01)
  7.         gen double mw_healthinsurance = round(VZ_mw_healthinsurance, .01)
  8.         gen double mw_smallbusiness = round(VZ_mw_smallbusiness, .01)
  9.         gen double mw_smallbusiness_mincomp = round(VZ_mw_smallbusiness_mi
> ncompensat, .01)
 10.         gen double mw_hotel = round(VZ_mw_hotel, .01)
 11.         drop VZ_mw*
 12. 
.         merge m:1 statefips using "../temp/crosswalk.dta", nogen keep(3)
 13.         label var statefips "State FIPS Code"
 14.         label var statename "State"
 15.         label var stateabb "State Abbreviation"
 16.         label var locality "City/County"
 17.         label var mw "Minimum Wage"
 18.         order statefips statename stateabb locality year month day date mw
>  mw_* source source_2 source_notes
 19. 
.         sort locality date
 20.         export delim using "../output/VZ_substate_changes.csv", replace 
 21. end

. 
. program prepare_local
  1.         preserve
  2.         egen tag = tag(statefips locality)
  3.         keep if tag == 1
  4.         keep statefips locality
  5. 
.         save "../temp/localities.dta", replace
  6.         restore
  7. end

. 
. program prepare_state
  1.         args finaldate
  2.         sum year
  3.         local minyear = r(min)
  4.         preserve
  5.         // use ${exports}VZ_state_daily.dta, clear
.         import delim ${exports}VZ_state_daily.csv, clear 
  6.         g date2 = date(date, "DMY")
  7.         format date2 %td
  8.         order date2, after(date)
  9.         drop date 
 10.         rename date2 date
 11.         keep if year(date) >= `minyear' & date <= td(`finaldate')
 12.         joinby statefips using ${temp}localities.dta
 13.         keep statefips statename stateabb locality date mw
 14.         rename mw state_mw
 15.         save ${temp}statemw.dta, replace
 16.         restore
 17. end

. 
. program prepare_finaldata
  1.         args finaldate
  2.         
.         encode locality, gen(locality_temp)
  3. 
.         tsset locality_temp date
  4.         tsfill
  5. 
.         foreach x of varlist statename stateabb locality source_notes {
  6.           bysort locality_temp (date): replace `x' = `x'[_n-1] if `x' == "
> "
  7.         }
  8.         foreach x of varlist statefips mw* {
  9.           bysort locality_temp (date): replace `x' = `x'[_n-1] if `x' == .
 10.         }
 11. 
.         keep if date <= td(`finaldate')
 12. 
.         merge 1:m statefips locality date using ${temp}statemw.dta, assert(2 
> 3) nogenerate
 13.         replace mw = state_mw if mw == .
 14.         replace mw = round(mw,0.01)
 15.         gen abovestate = mw > state_mw
 16.         label var abovestate "Local > State min wage"
 17. 
.         keep statefips statename stateabb date locality mw mw_* abovestate so
> urce_notes
 18.         order statefips statename stateabb date locality mw mw_* abovestat
> e source_notes
 19.         notes mw: The mw variable represents the most applicable minimum w
> age across the locality.
 20. 
.         save "../temp/data.dta", replace
 21.         
. end

. 
. program export_substate_daily   
  1.                 use "../temp/data.dta", clear
  2.                 sort locality date
  3.                 export delim using "../output/VZ_substate_daily.csv", repl
> ace
  4. end

. 
. program export_substate_monthly
  1.         use "../temp/data.dta", clear
  2. 
.         gen monthly_date = mofd(date)
  3.         format monthly_date %tm
  4. 
.         collapse (min) min_mw = mw (mean) mean_mw = mw (max) max_mw = mw abov
> estate, by(statefips statename stateabb locality monthly_date)
  5. 
.         label var monthly_date "Monthly Date"
  6.         label var min_mw "Monthly Minimum"
  7.         label var mean_mw "Monthly Average"
  8.         label var max_mw "Monthly Maximum"
  9.         label var abovestate "Local > State min wage"
 10. 
.         sort locality monthly_date
 11. 
.         export delim using "../output/VZ_substate_monthly.csv", replace 
 12. end 

. 
. program export_substate_quarterly
  1.         use "../temp/data.dta", clear
  2. 
.         gen quarterly_date = qofd(date)
  3.         format quarterly_date %tq
  4. 
.         collapse (min) min_mw = mw (mean) mean_mw = mw (max) max_mw = mw abov
> estate, by(statefips statename stateabb locality quarterly_date)
  5. 
.         label var quarterly_date "Quarterly Date"
  6.         label var min_mw "Quarterly Minimum"
  7.         label var mean_mw "Quarterly Average"
  8.         label var max_mw "Quarterly Maximum"
  9.         label var abovestate "Local > State min wage"
 10. 
.         sort locality quarterly_date
 11. 
.         export delim using "../output/VZ_substate_quarterly.csv", replace
 12. end 

. 
. program export_substate_annually
  1.         use "../temp/data.dta", clear
  2. 
.         gen year = yofd(date)
  3.         format year %ty
  4. 
.         collapse (min) min_mw = mw (mean) mean_mw = mw (max) max_mw = mw abov
> estate, by(statefips statename stateabb locality year)
  5. 
.         label var year "Year"
  6.         label var min_mw "Annual Minimum"
  7.         label var mean_mw "Annual Average"
  8.         label var max_mw "Annual Maximum"
  9.         label var abovestate "Local > State min wage"
 10. 
.         sort locality year
 11. 
.         export delim using "../output/VZ_substate_annual.csv", replace 
 12. end

. 
. * EXECUTE
. main 
(0 real changes made)
file crosswalk.dta saved
(13 missing values generated)
(139 missing values generated)
(156 missing values generated)
(137 missing values generated)
(164 missing values generated)
(170 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               171  
    -----------------------------------------
(note: file ../output/VZ_substate_changes.csv not found)
file ../output/VZ_substate_changes.csv saved
(137 observations deleted)
(note: file ../temp/localities.dta not found)
file ../temp/localities.dta saved

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |        171    2015.632    3.480863       2004       2024
file VZ_state_daily.csv not found
r(601);

end of do-file
r(601);

 make.py ended: 2020-03-05 10:41:53
