
 make.py started: 2021-10-28 15:19:49 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_baseline_predictions\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/estimation_samples"
  2.         local in_cf_mw    "../../../drive/derived_large/min_wage"
  3.         
.         define_controls
  4.         local controls "`r(economic_controls)'"
  5.         local cluster = "statefips"
  6.         local absorb  = "year_month"
  7.         
.     process_counterfactual_data, in_cf_mw(`in_cf_mw') ///
>             instub(`instub') controls(`controls')
  8.         
.         local exp_ln_mw_var "exp_ln_mw_17"
  9.         
.         use zipcode zipcode_num statefips year_month year month ///
>             ln_rents ln_mw `exp_ln_mw_var' `controls' ///
>                 using "`instub'/baseline_zipcode_months.dta", clear
 10.         xtset zipcode_num `absorb'
 11. 
.         gen d_ln_rents = ln_rents[_n] - ln_rents[_n-1]
 12.         gen d_ln_mw = ln_mw[_n] - ln_mw[_n-1]
 13.         gen d_`exp_ln_mw_var' = `exp_ln_mw_var'[_n] - `exp_ln_mw_var'[_n-1
> ]
 14.         
.         reghdfe d_ln_rents d_`exp_ln_mw_var' d_ln_mw ///
>             `controls', absorb(`absorb', savefe) ///
>             vce(cluster `cluster') nocons residuals(residuals)
 15.         keep if e(sample)
 16.         append using "../temp/counterfactual_fed_9usd.dta"
 17.     predict p_d_ln_rents if year == 2020, xb
 18.         
.         keep zipcode year month ln_rents p_d_ln_rents residuals __hdfe1__
 19.         save_data "../output/fd_baseline_predictions.dta", ///
>             key(zipcode year month) replace
 20. end

. 
. program process_counterfactual_data
  1.     syntax, in_cf_mw(str) instub(str) controls(str)
  2.         
.         use zipcode year month counterfactual exp_ln_mw_tot using ///
>             "`in_cf_mw'/zipcode_experienced_mw_cfs.dta", clear
  3.     keep if (year == 2020 & month == 1)
  4.         rename exp_ln_mw_tot exp_ln_mw_tot_18_cf
  5.         gen fed_mw_cf = 7.25*1.1 if counterfactual == "fed_10pc"
  6.         replace fed_mw_cf = 15 if counterfactual == "fed_15usd"
  7.         replace fed_mw_cf = 9 if counterfactual == "fed_9usd"
  8.         save "../temp/counterfactual.dta", replace
  9.         
.         use "`instub'/baseline_zipcode_months.dta", clear
 10.     xtset zipcode_num `absorb'
 11.         keep if (year == 2019 & month == 12)
 12.         keep zipcode ln_mw exp_ln_mw_17 `controls'
 13.         expand 3
 14.         bysort zipcode: gen counterfactual = "fed_10pc" if _n == 1
 15.         bysort zipcode: replace counterfactual = "fed_15usd" if _n == 2
 16.         bysort zipcode: replace counterfactual = "fed_9usd" if _n == 3
 17.         merge 1:1 zipcode counterfactual using "../temp/counterfactual.dta
> ", ///
>                 nogen keep(3)
 18.         gen d_ln_mw = ln_mw - log(fed_mw_cf)
 19.         gen d_exp_ln_mw_17 = exp_ln_mw_tot_18_cf - exp_ln_mw_17
 20.         drop fed_mw_cf exp_ln_mw_tot_18_cf ln_mw exp_ln_mw_17
 21.         preserve
 22.             keep if counterfactual == "fed_10pc"
 23.                 drop counterfactual
 24.                 save "../temp/counterfactual_fed_10pc.dta", replace
 25.         restore
 26.         preserve
 27.             keep if counterfactual == "fed_15usd"
 28.                 drop counterfactual
 29.                 save "../temp/counterfactual_fed_15usd.dta", replace
 30.         restore
 31.         preserve
 32.             keep if counterfactual == "fed_9usd"
 33.                 drop counterfactual
 34.                 save "../temp/counterfactual_fed_9usd.dta", replace
 35.         restore
 36. end

. 
. main
(117,423 observations deleted)
(78,282 missing values generated)
(39,141 real changes made)
(39,141 real changes made)
(note: file ../temp/counterfactual.dta not found)
file ../temp/counterfactual.dta saved
       panel variable:  zipcode_num (balanced)
(160,055 observations deleted)
(2,690 observations created)
(2,690 missing values generated)
(1,345 real changes made)
(1,345 real changes made)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             4,035  
    -----------------------------------------
(2,690 observations deleted)
(note: file ../temp/counterfactual_fed_10pc.dta not found)
file ../temp/counterfactual_fed_10pc.dta saved
(2,690 observations deleted)
(note: file ../temp/counterfactual_fed_15usd.dta not found)
file ../temp/counterfactual_fed_15usd.dta saved
(2,690 observations deleted)
(note: file ../temp/counterfactual_fed_9usd.dta not found)
file ../temp/counterfactual_fed_9usd.dta saved
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(29,145 missing values generated)
(1 missing value generated)
(1 missing value generated)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    131,576
Absorbing 1 HDFE group                            F(  11,     40) =      15.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0211
                                                  Adj R-squared   =     0.0202
                                                  Within R-sq.    =     0.0004
Number of clusters (statefips) =         41       Root MSE        =     0.0290

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
d_exp_ln_~17 |   .0568913   .0281278     2.02   0.050     .0000428    .1137397
     d_ln_mw |  -.0245086   .0170506    -1.44   0.158    -.0589692    .0099519
ln_emp_biz~v |  -.0009217   .0001897    -4.86   0.000    -.0013051   -.0005384
 ln_emp_info |   .0003052   .0002362     1.29   0.204    -.0001722    .0007826
  ln_emp_fin |    .000344   .0002537     1.36   0.183    -.0001688    .0008568
ln_estcoun~v |   .0004819   .0005117     0.94   0.352    -.0005522    .0015161
ln_estcoun~o |   .0003475   .0003998     0.87   0.390    -.0004605    .0011556
ln_estcoun~n |  -.0002975   .0007302    -0.41   0.686    -.0017733    .0011783
ln_avgwwag~v |  -.0002057   .0007276    -0.28   0.779    -.0016764    .0012649
ln_avgwwag~o |   .0003911   .0005463     0.72   0.478     -.000713    .0014952
ln_avgwwag~n |  -.0013205   .0005618    -2.35   0.024    -.0024559   -.0001852
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(29,824 observations deleted)
(note: variable year was int, now double to accommodate using data's values)
(note: variable month was byte, now double to accommodate using data's
       values)
(131,590 missing values generated)
(data now sorted by zipcode year month)
  variable year was double now int
  variable month was double now byte
  (1,727,973 bytes saved)
===============================================================================
File: ../output/fd_baseline_predictions.dta
Key: zipcode year month
===============================================================================
  132921:7(28034):3763631149:2058566294

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
        year |    132,921    2015.379    2.489502       2010       2020
       month |    132,921    6.550846    3.465987          1         12
    ln_rents |    131,576    .0788818    .4613773  -.8722227   3.100092
   residuals |    131,576    1.58e-17    .0290232  -.2035419   .1690638
-------------+---------------------------------------------------------
   __hdfe1__ |    131,576    .0104427    .0042318  -.0236236   .0255982
p_d_ln_rents |      1,331   -.0029805    .0101691  -.0227121   .0096804




(note: file ../output/fd_baseline_predictions.dta not found)
file ../output/fd_baseline_predictions.dta saved

. 
end of do-file

 make.py ended: 2021-10-28 15:19:56
