
 make.py started: 2022-03-15 08:05:16 C:\Users\diegog\Desktop\Diego\min_wage_rent\descriptive\shares\code 




Execute:  StataMP-64 /e do "./figures.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./figures.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     local instub "../../../drive/derived_large/od_shares"
  2. 
.     foreach geo in county zipcode {
  3.         import delimited "`instub'/`geo'_shares.csv", clear
  4.         
.         plot_density, var(`geo')
  5. 
.         graph export "../output/shares_`geo'.png"
  6.         graph export "../output/shares_`geo'.eps"
  7.     }
  8. end

. 
. 
. program plot_density
  1.     syntax, var(str) 
  2. 
.     if "`var'" == "countyfips"  local var_title "County"
  3.     if "`var'" == "zipcode" local var_title "ZIP code"
  4. 
.     twoway (kdensity sh_work_samegeo)                       ///
>            (kdensity sh_work_samegeo_lowinc),               ///
>         xtitle("Share who work in same `var_title'")           ///
>         legend(order(1 "Total workers" 2 "Low-wage workers"))  ///
>         graphregion(color(white)) bgcolor(white)
  5. end

. 
. 
. main
(18 vars, 31,430 obs)
(file ../output/shares_county.png written in PNG format)
(file ../output/shares_county.eps written in EPS format)
(18 vars, 307,523 obs)
(file ../output/shares_zipcode.png written in PNG format)
(file ../output/shares_zipcode.eps written in EPS format)

. 
end of do-file

 make.py ended: 2022-03-15 08:05:37
