
 make.py started: 2023-08-03 13:03:06 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\code 




Execute:  StataMP-64 /e do "./compute.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./compute.do 

. clear all

. set more off

. set maxvar 32000


. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local in_cf_mw     "../../../drive/derived_large/min_wage_measures"
  2.     local in_baseline  "../../fd_baseline/output"
  3.     local in_wages     "../../twfe_wages/output"
  4.     local in_exp_share "../../../drive/analysis_large/expenditure_shares"
  5.     local in_zip       "../../../drive/derived_large/zipcode"
  6.     local out_large    "../../../drive/analysis_large/counterfactuals"
  7. 
.     load_parameters, in_baseline(`in_baseline') in_wages(`in_wages')
  8.     local beta    = r(beta)
  9.     local gamma   = r(gamma)
 10.     *local epsilon = r(epsilon)
.     local epsilon = 0.1
 11. 
.     di "Beta, Gamma, and Epsilon: `beta', `gamma', `epsilon'"
 12. 
.     load_counterfactuals,  instub(`in_cf_mw')
 13.     select_urban_zipcodes, instub(`in_zip')
 14.     merge m:1 zipcode using "`in_exp_share'/s_by_zip.dta", ///
>         nogen keep(1 3)
 15.     
.     compute_vars,         beta(`beta') gamma(`gamma') epsilon(`epsilon')
 16.     flag_unaffected_cbsas
 17.     flag_treatment_status
 18. 
.     foreach cf in fed_10pc fed_9usd fed_15usd chi14 {
 19. 
.         qui unique cbsa if counterfactual == "`cf'"
 20.         local n_cbsas           = `r(unique)'
 21.         qui unique cbsa if cbsa_low_inc_increase == 0 & counterfactual == 
> "`cf'"
 22.         local n_cbsas_affected = `r(unique)'
 23. 
.         di "{bf: Counterfactual: `cf'}"
 24.         di "    Unique CBAs: `n_cbsas'"
 25.         di "    Unique CBAs strongly affected: `n_cbsas_affected'"
 26. 
.         di "    Distribution of rho"
 27.         sum rho if counterfactual == "`cf'" & year == 2020, d
 28.         di "    Distribution of rho for strongly affected CBAs"
 29.         sum rho if counterfactual == "`cf'" & year == 2020 & cbsa_low_inc_
> increase == 0, d
 30.     }
 31. 
.     save_data  "`out_large'/data_counterfactuals.dta", key(zipcode counterfac
> tual year) ///
>         log("../output/data_file_manifest.log") replace
 32.     export delimited "`out_large'/data_counterfactuals.csv", replace
 33. 
.     preserve
 34.         compute_tot_incidence
 35. 
.         qui sum tot_incidence if counterfactual == "fed_9usd"
 36.         local tot_inc = r(mean)
 37. 
.         export delimited "../output/tot_incidence.csv", replace
 38.     restore
 39. 
. end

. 
. program load_parameters, rclass
  1.     syntax, in_baseline(str) in_wages(str)
  2. 
.     use `in_baseline'/estimates_static.dta, clear
  3.     keep if model == "static_both"
  4. 
.     qui sum b if var == "mw_res"
  5.     return local gamma = r(mean)
  6.     qui sum b if var == "mw_wkp_tot_17"
  7.     return local beta = r(mean)
  8. 
.     use `in_wages'/estimates_all.dta if model == "cbsa_time", clear
  9.     qui sum b
 10.     return local epsilon = r(mean)
 11. end

. 
. program load_counterfactuals
  1.     syntax, instub(str)
  2. 
.     clear
  3.     use zipcode year month counterfactual mw_wkp_tot mw_res statutory_mw /
> //
>         using "`instub'/zipcode_wkp_mw_cfs.dta"
  4. 
.     bysort zipcode counterfactual (year month): ///
>         gen d_mw_wkp = mw_wkp_tot[_n] - mw_wkp_tot[_n - 1]
  5.     bysort zipcode counterfactual (year month): ///
>         gen d_mw_res = mw_res[_n] - mw_res[_n - 1]
  6.     
.     gen        diff_mw  = d_mw_wkp - d_mw_res
  7.     gquantiles diff_qts = diff_mw, xtile nquantiles(10) by(counterfactual)
  8. end

. 
. program select_urban_zipcodes
  1.     syntax, instub(str)
  2. 
.     merge m:1 zipcode using `instub'/zipcode_cross.dta,  ///
>         assert(2 3) keep(3) nogen keepusing(cbsa urban_cbsa)
  3. 
.     keep if urban_cbsa
  4. end

. 
. program compute_vars
  1.     syntax, beta(str) gamma(str) epsilon(str)
  2. 
.     gen change_ln_rents    = `beta'*d_mw_wkp + `gamma'*d_mw_res
  3.     gen change_ln_wagebill = `epsilon'*d_mw_wkp
  4. 
.     gen perc_incr_rent     = exp(change_ln_rents)    - 1
  5.     gen perc_incr_wagebill = exp(change_ln_wagebill) - 1
  6.     gen ratio_increases    = perc_incr_rent/perc_incr_wagebill
  7. 
.     gen rho              = s*ratio_increases
  8.     gen rho_with_imputed = s_imputed*ratio_increases
  9. 
.     foreach var in change_ln_rents change_ln_wagebill perc_incr_rent perc_inc
> r_wagebill ///
>                    ratio_increases rho rho_with_imputed {
 10.         
.         replace `var' = . if missing(d_mw_res)
 11.     }
 12. end

. 
. program flag_unaffected_cbsas
  1.     syntax, [thresh(real 0.001)]
  2. 
.     preserve
  3.         collapse (mean) perc_incr_wagebill perc_incr_rent,       ///
>             by(cbsa counterfactual)
  4. 
.         gen cbsa_low_inc_increase = perc_incr_wagebill < `thresh'
  5.         tempfile cbsa_averages
  6.         save    `cbsa_averages', replace
  7.     restore
  8. 
.     merge m:1 cbsa counterfactual using `cbsa_averages', ///
>         assert(3) nogen
  9. end

. 
. program flag_treatment_status
  1. 
.     preserve
  2.         keep if year == 2020 & !missing(s_imputed) & !missing(perc_incr_re
> nt)  ///
>                              & !missing(perc_incr_wagebill)
  3. 
.         gen no_direct_treatment = (d_mw_res == 0)            if cbsa_low_inc_
> increase == 0
  4.         gen fully_affected      = (no_direct_treatment == 0) if !missing(n
> o_direct_treatment)
  5. 
.         keep zipcode counterfactual no_direct_treatment fully_affected
  6.         
.         tempfile treatment_status
  7.         save    `treatment_status', replace
  8.     restore
  9. 
.     merge m:1 zipcode counterfactual using `treatment_status', assert(1 3) no
> gen
 10. end

. 
. program compute_tot_incidence
  1.     keep if !missing(s_imputed) & !missing(perc_incr_rent) &    ///
>             !missing(perc_incr_wagebill) & cbsa_low_inc_increase == 0
  2.     keep if (year == 2020 & month == 1)
  3.     keep zipcode counterfactual change_ln_rents perc_incr_rent ///
>         change_ln_wagebill perc_incr_wagebill                  ///
>         safmr2br_imputed wage_per_whhld_monthly_imputed
  4. 
.     gen num_terms_ti   = safmr2br_imputed               * perc_incr_rent
  5.     gen denom_terms_ti = wage_per_whhld_monthly_imputed * perc_incr_wagebi
> ll
  6. 
.     collapse (sum)   num_tot_incidence   = num_terms_ti    ///
>                      denom_tot_incidence = denom_terms_ti  ///
>              (count) N                   = num_terms_ti,   ///
>         by(counterfactual)
  7. 
.     gen tot_incidence = num_tot_incidence/denom_tot_incidence
  8. end

. 
. main
(6 observations deleted)
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .1
(126,452 missing values generated)
(126,876 missing values generated)
(126,876 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           252,904  
    -----------------------------------------
(162,872 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_4bf0_000003.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_4bf0_000003.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(21,001 missing values generated)
(21,001 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_4bf0_000003.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_4bf0_000003.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_10pc
    Unique CBAs: 176
    Unique CBAs strongly affected: 79
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0438508      -.0203654
 5%     .0657134        -.01111
10%     .0778771      -.0091403       Obs              10,187
25%     .1014565      -.0063008       Sum of Wgt.      10,187

50%     .1391995                      Mean           .1513273
                        Largest       Std. Dev.      .0675472
75%     .1868844       .4922486
90%      .242375       .5717387       Variance       .0045626
95%     .2813675       .6579152       Skewness       1.075858
99%     .3552612       .7255545       Kurtosis       4.931223
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0371523      -.0203654
 5%     .0573071        -.01111
10%     .0674431      -.0091403       Obs               4,553
25%     .0833772      -.0063008       Sum of Wgt.       4,553

50%     .1055551                      Mean           .1165602
                        Largest       Std. Dev.      .0495859
75%     .1397018       .3723122
90%     .1796842       .3740429       Variance       .0024588
95%     .2096041       .3978823       Skewness       1.495649
99%     .2911796       .5717387       Kurtosis       7.297102
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 115
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0414003      -.0237887
 5%      .062263      -.0119997
10%     .0733662       -.010081       Obs              10,239
25%     .0920778      -.0070467       Sum of Wgt.      10,239

50%     .1262041                      Mean           .1417339
                        Largest       Std. Dev.      .0671055
75%     .1772276       .4858083
90%      .232964       .4922404       Variance       .0045032
95%     .2720363       .6579108       Skewness       1.234538
99%     .3541284       .7255244       Kurtosis          5.313
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .037005      -.0237887
 5%     .0571987      -.0119997
10%     .0671034       -.010081       Obs               6,352
25%     .0826267      -.0070467       Sum of Wgt.       6,352

50%     .1026367                      Mean           .1128861
                        Largest       Std. Dev.      .0467626
75%     .1338349       .3722266
90%     .1725946       .3978761       Variance       .0021867
95%     .1994197       .4858083       Skewness       1.756847
99%       .27004       .7255244       Kurtosis       11.18363
 Counterfactual: fed_15usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 176
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0375479       .0036531
 5%     .0577665       .0083268
10%     .0682867       .0104912       Obs              10,271
25%     .0839914       .0113351       Sum of Wgt.      10,271

50%     .1045181                      Mean            .114312
                        Largest       Std. Dev.       .048016
75%     .1340513       .4700268
90%     .1708207       .4917598       Variance       .0023055
95%     .2022673       .5768411       Skewness       1.914336
99%     .2816917       .6572647       Kurtosis       10.68223
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0375479       .0036531
 5%     .0577665       .0083268
10%     .0682867       .0104912       Obs              10,271
25%     .0839914       .0113351       Sum of Wgt.      10,271

50%     .1045181                      Mean            .114312
                        Largest       Std. Dev.       .048016
75%     .1340513       .4700268
90%     .1708207       .4917598       Variance       .0023055
95%     .2022673       .5768411       Skewness       1.914336
99%     .2816917       .6572647       Kurtosis       10.68223
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0543419       .0191152
 5%      .086134       .0219898
10%     .1004008       .0274122       Obs               5,304
25%     .1233199       .0305386       Sum of Wgt.       5,304

50%     .1550896                      Mean           .1666884
                        Largest       Std. Dev.      .0617089
75%     .2002178       .4445948
90%     .2493142       .4460832       Variance        .003808
95%     .2821245       .4708352       Skewness         1.0191
99%     .3532748       .7255742       Kurtosis       5.271307
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0416274       .0191152
 5%     .0620636       .0219898
10%     .0772111       .0329542       Obs                 369
25%     .1155406       .0416274       Sum of Wgt.         369

50%     .1509533                      Mean           .1524483
                        Largest       Std. Dev.      .0571598
75%     .1872977       .2980692
90%     .2213114        .313616       Variance       .0032672
95%     .2539265       .3452192       Skewness       .4486145
99%     .2980692       .3739364       Kurtosis       3.574197
(data now sorted by zipcode counterfactual year)
  variable cbsa_low_inc_increase was float now byte
  variable no_direct_treatment was float now byte
  variable fully_affected was float now byte
  variable year was double now int
  variable month was double now byte
  (1,980,704 bytes saved)
===============================================================================
File: ../../../drive/analysis_large/counterfactuals/data_counterfactuals.dta
Key: zipcode counterfactual year
===============================================================================
  90032:29(72020):874902688:4250543804

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
counterfac~l |          0
        year |     90,032      2019.5    .5000028       2019       2020
       month |     90,032         6.5    5.500031          1         12
  mw_wkp_tot |     90,032    2.302862    .2462724    1.60842   2.750013
-------------+---------------------------------------------------------
statutory_mw |     89,576    10.33884    2.689903       7.25         17
      mw_res |     89,576    2.303301    .2532923   1.981001   2.833213
    d_mw_wkp |     45,016    .1458903    .2235173          0   .7270488
    d_mw_res |     44,788    .1493795    .2301897          0   .7270488
     diff_mw |     44,788   -.0034421    .0246483  -.6357015   .3103828
-------------+---------------------------------------------------------
    diff_qts |     44,788    5.266098    3.098421          1         10
        cbsa |          0
  urban_cbsa |     90,032           1           0          1          1
    safmr2br |     88,520    1258.366    501.1314        640       4680
wage_per_w~y |     82,624    5742.226    3620.925   1018.056   83906.45
-------------+---------------------------------------------------------
           s |     82,184    .2469149    .0897624   .0229275   1.059083
safmr2br_i~d |     89,536    1249.916    471.6714    619.341       2810
wage_per_w~d |     88,176    5580.228    2892.665    1247.48   17753.74
   s_imputed |     88,152    .2471932    .0855633   .0913048   .5074598
change_ln_~s |     44,788    .0067317    .0103228    -.00964   .0339118
-------------+---------------------------------------------------------
change_ln_~l |     44,788    .0145937    .0223549          0   .0727049
perc_incr_~t |     44,788    .0068083    .0104781  -.0095937   .0344934
perc_incr_~l |     44,788    .0149573    .0230896          0   .0754131
ratio_incr~s |     38,495    .5585913    .2287927  -28.04013    .685102
         rho |     36,001    .1403016    .0641915  -.0237887   .7255742
-------------+---------------------------------------------------------
rho_with_i~d |     38,045    .1396592     .061837  -.1475732   .3476602
cbsa_low_i~e |     90,032    .4765195    .4994511          0          1
no_direct_~t |     46,134    .1233364    .3288265          0          1
fully_affe~d |     46,134    .8766636    .3288265          0          1




file ../../../drive/analysis_large/counterfactuals/data_counterfactuals.dta sav
> ed
file ../../../drive/analysis_large/counterfactuals/data_counterfactuals.csv sav
> ed
(66,965 observations deleted)
(0 observations deleted)
(note: file ../output/tot_incidence.csv not found)
file ../output/tot_incidence.csv saved

. 
end of do-file


Execute:  StataMP-64 /e do "./figures.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./figures.do 

. clear all

. set more off

. set maxvar 32000


. set scheme s2color, permanently
(set scheme preference recorded)

. 
. program main
  1.     local in_large "../../../drive/analysis_large/counterfactuals"
  2.     local in_wages "../../twfe_wages/output"
  3.     local in_zip   "../../../drive/derived_large/zipcode"
  4. 
.     foreach cf in fed_9usd chi14 {
  5. 
.         use "`in_large'/data_counterfactuals.dta" ///
>             if counterfactual == "`cf'" & year == 2020, clear
  6. 
.         keep if !cbsa_low_inc_increase
  7. 
.         local vars "rho_with_imputed"
  8.         if "`cf'" == "fed_9usd" {
  9.             local vars "d_mw_res d_mw_wkp rho rho_with_imputed"
 10.             local vars "`vars' change_ln_rents change_ln_wagebill s_impute
> d"
 11.         }
 12. 
.         foreach var of local vars {
 13.             
.             get_xlabel, var(`var')
 14.             local x_lab = r(x_lab)
 15.             
.             local scale_opts ""
 16.             local lab_opts   ""
 17.             local bin_opt    ""
 18.             if inlist("`var'", "d_mw_res", "d_mw_wkp") {
 19.                 local scale_opts "yscale(r(0 60)) xscale(r(0 0.23))"
 20.                 local lab_opts   "ylab(0(15)60) xlab(0(0.05)0.2)"
 21.                 local bin_opt    "bin(25)"
 22.             }
 23.             if inlist("`var'", "rho", "rho_with_imputed", "change_ln_rents
> ", "change_ln_wagebill") {
 24.                 local bin_opt    "bin(30)"
 25.                 if !inlist("`var'", "rho", "rho_with_imputed") {
 26.                     local scale_opts "yscale(r(0 40))"
 27.                 }
 28.             }
 29.             if inlist("`var'", "s_imputed") {
 30.                 local bin_opt    "bin(30)"
 31.                 local scale_opts "yscale(r(0 8))"
 32.             }
 33. 
.             hist `var', percent `bin_opt'                                    
>   ///
>                 xtitle("`x_lab'") ytitle("Percentage") `scale_opts' `lab_opts
> ' ///
>                 graphregion(color(white)) bgcolor(white)                     
>   ///
>                 plotregion(margin(b = 1.5))
 34.             
.             local filename "../output/hist_`var'_`cf'"
 35.             if inlist("`var'", "s_imputed") {
 36.                 local filename "../output/hist_`var'"
 37.             }
 38.             
.             graph export "`filename'_png.png", replace width(2221) height(161
> 5)
 39.             graph export "`filename'.eps", replace
 40.         }
 41. 
.         collapse (mean) rho_with_imputed, by(diff_qts)
 42. 
.         twoway (line     rho_with_imputed  diff_qts, lcol(navy))             
>           ///
>                (scatter  rho_with_imputed  diff_qts, mcol(navy)),            
>           ///
>             xtitle("Difference between ch. in wkp. MW and ch. in res. MW (dec
> iles)")   ///
>             ytitle("Mean share pocketed by landlords")                       
>           ///
>             xlabel(1(1)10) ylabel(0.06(0.04)0.18)                            
>           ///
>             graphregion(color(white)) bgcolor(white) legend(off)
 43.             
.         graph export "../output/deciles_diff_`cf'_png.png", width(2221) heigh
> t(1615) replace
 44.         graph export "../output/deciles_diff_`cf'.eps", replace
 45.     }
 46. end

. 
. program get_xlabel, rclass
  1.     syntax, var(str)
  2. 
.     if inlist("`var'", "p_d_ln_rents", "p_d_ln_rents_with_fe", ///
>               "p_d_ln_rents_zillow", "p_d_ln_rents_with_fe_zillow") {
  3.         return local x_lab "Change in log rents"
  4.     }
  5. 
.     if "`var'"=="d_mw_res"           return local x_lab "Change in residence 
> MW"
  6.     if "`var'"=="d_mw_wkp"           return local x_lab "Change in workpla
> ce MW"
  7. 
.     if "`var'"=="change_ln_rents"    return local x_lab "Change in log rents 
> per sq. foot"
  8.     if "`var'"=="change_ln_wagebill" return local x_lab "Change in log tot
> al wages"
  9. 
.     if "`var'"=="rho"                return local x_lab "Share pocketed by la
> ndlords"
 10.     if "`var'"=="rho_with_imputed"   return local x_lab "Share pocketed by
>  landlords"
 11. 
.     if "`var'"=="s_imputed"          return local x_lab "Housing expenditure 
> share"
 12. end

. 
. 
. main
(4,317 observations deleted)
(bin=25, start=0, width=.00864892)
(note: file ../output/hist_d_mw_res_fed_9usd_png.png not found)
(file ../output/hist_d_mw_res_fed_9usd_png.png written in PNG format)
(note: file ../output/hist_d_mw_res_fed_9usd.eps not found)
(file ../output/hist_d_mw_res_fed_9usd.eps written in EPS format)
(bin=25, start=0, width=.00864892)
(note: file ../output/hist_d_mw_wkp_fed_9usd_png.png not found)
(file ../output/hist_d_mw_wkp_fed_9usd_png.png written in PNG format)
(note: file ../output/hist_d_mw_wkp_fed_9usd.eps not found)
(file ../output/hist_d_mw_wkp_fed_9usd.eps written in EPS format)
(bin=30, start=-.0237887, width=.0249771)
(note: file ../output/hist_rho_fed_9usd_png.png not found)
(file ../output/hist_rho_fed_9usd_png.png written in PNG format)
(note: file ../output/hist_rho_fed_9usd.eps not found)
(file ../output/hist_rho_fed_9usd.eps written in EPS format)
(bin=30, start=-.14757325, width=.01650764)
(note: file ../output/hist_rho_with_imputed_fed_9usd_png.png not found)
(file ../output/hist_rho_with_imputed_fed_9usd_png.png written in PNG format)
(note: file ../output/hist_rho_with_imputed_fed_9usd.eps not found)
(file ../output/hist_rho_with_imputed_fed_9usd.eps written in EPS format)
(bin=30, start=-.0047281, width=.00049378)
(note: file ../output/hist_change_ln_rents_fed_9usd_png.png not found)
(file ../output/hist_change_ln_rents_fed_9usd_png.png written in PNG format)
(note: file ../output/hist_change_ln_rents_fed_9usd.eps not found)
(file ../output/hist_change_ln_rents_fed_9usd.eps written in EPS format)
(bin=30, start=0, width=.00072074)
(note: file ../output/hist_change_ln_wagebill_fed_9usd_png.png not found)
(file ../output/hist_change_ln_wagebill_fed_9usd_png.png written in PNG format)
(note: file ../output/hist_change_ln_wagebill_fed_9usd.eps not found)
(file ../output/hist_change_ln_wagebill_fed_9usd.eps written in EPS format)
(bin=30, start=.09130484, width=.01387183)
(note: file ../output/hist_s_imputed_png.png not found)
(file ../output/hist_s_imputed_png.png written in PNG format)
(note: file ../output/hist_s_imputed.eps not found)
(file ../output/hist_s_imputed.eps written in EPS format)
(note: file ../output/deciles_diff_fed_9usd_png.png not found)
(file ../output/deciles_diff_fed_9usd_png.png written in PNG format)
(note: file ../output/deciles_diff_fed_9usd.eps not found)
(file ../output/deciles_diff_fed_9usd.eps written in EPS format)
(10,866 observations deleted)
(bin=30, start=.0352774, width=.01040814)
(note: file ../output/hist_rho_with_imputed_chi14_png.png not found)
(file ../output/hist_rho_with_imputed_chi14_png.png written in PNG format)
(note: file ../output/hist_rho_with_imputed_chi14.eps not found)
(file ../output/hist_rho_with_imputed_chi14.eps written in EPS format)
(note: file ../output/deciles_diff_chi14_png.png not found)
(file ../output/deciles_diff_chi14_png.png written in PNG format)
(note: file ../output/deciles_diff_chi14.eps not found)
(file ../output/deciles_diff_chi14.eps written in EPS format)

. 
end of do-file


Execute:  StataMP-64 /e do "./compute_varepsilon.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./compute_varepsilon.do 

. clear all

. set more off

. set maxvar 32000


. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local in_cf_mw     "../../../drive/derived_large/min_wage_measures"
  2.     local in_baseline  "../../fd_baseline/output"
  3.     local in_wages     "../../twfe_wages/output"
  4.     local in_exp_share "../../../drive/analysis_large/expenditure_shares"
  5.     local in_zip       "../../../drive/derived_large/zipcode"
  6.     local out_large    "../../../drive/analysis_large/counterfactuals"
  7. 
.     load_parameters, in_baseline(`in_baseline') in_wages(`in_wages')
  8.     local beta    = r(beta)
  9.     local gamma   = r(gamma)
 10.     
.     clear
 11.     load_counterfactuals,  instub(`in_cf_mw')
 12.     select_urban_zipcodes, instub(`in_zip')
 13.     merge m:1 zipcode using "`in_exp_share'/s_by_zip.dta", ///
>         nogen keep(1 3)
 14. 
.     tempfile zip_data
 15.     save    `zip_data', replace
 16. 
.     local i = 1
 17.     forval epsilon = 0.06(0.005)0.141 {
 18.         di "Beta, Gamma, and Epsilon: `beta', `gamma', `epsilon'"
 19. 
.         use `zip_data', clear
 20.         
.         compute_vars,         beta(`beta') gamma(`gamma') epsilon(`epsilon')
 21.         flag_unaffected_cbsas
 22.         flag_treatment_status
 23. 
.         foreach cf in fed_9usd chi14 {
 24. 
.             qui unique cbsa if counterfactual == "`cf'"
 25.             local n_cbsas           = `r(unique)'
 26.             qui unique cbsa if cbsa_low_inc_increase == 0 & counterfactual
>  == "`cf'"
 27.             local n_cbsas_affected = `r(unique)'
 28. 
.             di "{bf: Counterfactual: `cf'}"
 29.             di "    Unique CBAs: `n_cbsas'"
 30.             di "    Unique CBAs strongly affected: `n_cbsas_affected'"
 31. 
.             di "    Distribution of rho"
 32.             sum rho if counterfactual == "`cf'" & year == 2020, d
 33.             di "    Distribution of rho for strongly affected CBAs"
 34.             sum rho if counterfactual == "`cf'" & year == 2020 & cbsa_low_
> inc_increase == 0, d
 35.         }
 36. 
.         compute_tot_incidence
 37.         gen epsilon = `epsilon'
 38. 
.         save "../temp/tot_incidence_`i'.csv", replace
 39.         local i = `i' + 1
 40.     }
 41. 
.     local n = `i' - 1
 42.     clear
 43.     forval i = 1/`n' {
 44.         append using "../temp/tot_incidence_`i'.csv"
 45.     }
 46.     export delimited "../output/tot_incidence_var_epsilon.csv", replace
 47. end

. 
. program load_parameters, rclass
  1.     syntax, in_baseline(str) in_wages(str)
  2. 
.     use `in_baseline'/estimates_static.dta, clear
  3.     keep if model == "static_both"
  4. 
.     qui sum b if var == "mw_res"
  5.     return local gamma = r(mean)
  6.     qui sum b if var == "mw_wkp_tot_17"
  7.     return local beta = r(mean)
  8. 
.     use `in_wages'/estimates_all.dta if model == "cbsa_time", clear
  9.     qui sum b
 10.     return local epsilon = r(mean)
 11. end

. 
. program load_counterfactuals
  1.     syntax, instub(str)
  2. 
.     clear
  3.     use zipcode year month counterfactual mw_wkp_tot mw_res statutory_mw /
> //
>         using "`instub'/zipcode_wkp_mw_cfs.dta"
  4. 
.     bysort zipcode counterfactual (year month): ///
>         gen d_mw_wkp = mw_wkp_tot[_n] - mw_wkp_tot[_n - 1]
  5.     bysort zipcode counterfactual (year month): ///
>         gen d_mw_res = mw_res[_n] - mw_res[_n - 1]
  6.     
.     gen        diff_mw  = d_mw_wkp - d_mw_res
  7.     gquantiles diff_qts = diff_mw, xtile nquantiles(10) by(counterfactual)
  8. end

. 
. program select_urban_zipcodes
  1.     syntax, instub(str)
  2. 
.     merge m:1 zipcode using `instub'/zipcode_cross.dta,  ///
>         assert(2 3) keep(3) nogen keepusing(cbsa urban_cbsa)
  3. 
.     keep if urban_cbsa
  4. end

. 
. program compute_vars
  1.     syntax, beta(str) gamma(str) epsilon(str)
  2. 
.     gen change_ln_rents    = `beta'*d_mw_wkp + `gamma'*d_mw_res
  3.     gen change_ln_wagebill = `epsilon'*d_mw_wkp
  4. 
.     gen perc_incr_rent     = exp(change_ln_rents)    - 1
  5.     gen perc_incr_wagebill = exp(change_ln_wagebill) - 1
  6.     gen ratio_increases    = perc_incr_rent/perc_incr_wagebill
  7. 
.     gen rho              = s*ratio_increases
  8.     gen rho_with_imputed = s_imputed*ratio_increases
  9. 
.     foreach var in change_ln_rents change_ln_wagebill perc_incr_rent perc_inc
> r_wagebill ///
>                    ratio_increases rho rho_with_imputed {
 10.         
.         replace `var' = . if missing(d_mw_res)
 11.     }
 12. end

. 
. program flag_unaffected_cbsas
  1.     syntax, [thresh(real 0.001)]
  2. 
.     preserve
  3.         collapse (mean) perc_incr_wagebill perc_incr_rent,       ///
>             by(cbsa counterfactual)
  4. 
.         gen cbsa_low_inc_increase = perc_incr_wagebill < `thresh'
  5.         tempfile cbsa_averages
  6.         save    `cbsa_averages', replace
  7.     restore
  8. 
.     merge m:1 cbsa counterfactual using `cbsa_averages', ///
>         assert(3) nogen
  9. end

. 
. program flag_treatment_status
  1. 
.     preserve
  2.         keep if year == 2020 & !missing(s_imputed) & !missing(perc_incr_re
> nt)  ///
>                              & !missing(perc_incr_wagebill)
  3. 
.         gen no_direct_treatment = (d_mw_res == 0)            if cbsa_low_inc_
> increase == 0
  4.         gen fully_affected      = (no_direct_treatment == 0) if !missing(n
> o_direct_treatment)
  5. 
.         keep zipcode counterfactual no_direct_treatment fully_affected
  6.         
.         tempfile treatment_status
  7.         save    `treatment_status', replace
  8.     restore
  9. 
.     merge m:1 zipcode counterfactual using `treatment_status', assert(1 3) no
> gen
 10. end

. 
. program compute_tot_incidence
  1.     keep if !missing(s_imputed) & !missing(perc_incr_rent) &    ///
>             !missing(perc_incr_wagebill) & cbsa_low_inc_increase == 0
  2.     keep if (year == 2020 & month == 1)
  3.     keep zipcode counterfactual change_ln_rents perc_incr_rent ///
>         change_ln_wagebill perc_incr_wagebill                  ///
>         safmr2br_imputed wage_per_whhld_monthly_imputed
  4. 
.     gen num_terms_ti   = safmr2br_imputed               * perc_incr_rent
  5.     gen denom_terms_ti = wage_per_whhld_monthly_imputed * perc_incr_wagebi
> ll
  6. 
.     collapse (sum)   num_tot_incidence   = num_terms_ti    ///
>                      denom_tot_incidence = denom_terms_ti  ///
>              (count) N                   = num_terms_ti,   ///
>         by(counterfactual)
  7. 
.     gen tot_incidence = num_tot_incidence/denom_tot_incidence
  8. end

. 
. main
(6 observations deleted)
(126,452 missing values generated)
(126,876 missing values generated)
(126,876 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           252,904  
    -----------------------------------------
(162,872 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000002.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000002.tmp saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .06
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(21,920 missing values generated)
(21,920 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 113
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0691139      -.0396807
 5%     .1039989      -.0200195
10%     .1225604      -.0168199       Obs              10,239
25%     .1538915      -.0117576       Sum of Wgt.      10,239

50%     .2106635                      Mean           .2365087
                        Largest       Std. Dev.      .1117332
75%     .2956432       .8112615
90%     .3882936       .8204309       Variance       .0124843
95%     .4536833       1.096532       Skewness       1.234618
99%     .5902209       1.209316       Kurtosis        5.32054
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0618138      -.0396807
 5%      .095575      -.0200195
10%     .1118739      -.0168199       Obs               6,107
25%     .1372461      -.0117576       Sum of Wgt.       6,107

50%     .1696418                      Mean           .1868435
                        Largest       Std. Dev.      .0762404
75%     .2202873         .61604
90%     .2867056       .6207013       Variance       .0058126
95%     .3310062       .6631495       Skewness       1.492507
99%     .4461013       .8112615       Kurtosis       7.033911
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0906658       .0318937
 5%     .1435566        .036674
10%      .167335        .045687       Obs               5,304
25%     .2055333       .0508977       Sum of Wgt.       5,304

50%     .2584848                      Mean           .2778199
                        Largest       Std. Dev.       .102848
75%     .3336964       .7409914
90%     .4155239       .7434722       Variance       .0105777
95%     .4702075       .7847257       Skewness       1.019145
99%     .5887914       1.209294       Kurtosis       5.271289
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0694378       .0318937
 5%     .1034748        .036674
10%     .1287174       .0549834       Obs                 369
25%     .1925814       .0694378       Sum of Wgt.         369

50%     .2516392                      Mean           .2541572
                        Largest       Std. Dev.      .0952824
75%     .3122206       .4968739
90%     .3688904       .5229384       Variance       .0090787
95%      .423362       .5756213       Skewness       .4496107
99%     .4968739       .6235421       Kurtosis       3.576443
(67,884 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_1.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .065
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(21,687 missing values generated)
(21,687 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 114
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0637633      -.0366246
 5%     .0959834      -.0184772
10%     .1131036      -.0155239       Obs              10,239
25%     .1419778      -.0108516       Sum of Wgt.      10,239

50%     .1944274                      Mean           .2182827
                        Largest       Std. Dev.      .1031509
75%      .272855       .7486743
90%      .358424       .7573173       Variance       .0106401
95%     .4187512       1.012182       Skewness        1.23461
99%     .5448185       1.116279       Kurtosis       5.319601
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0570429      -.0366246
 5%     .0881887      -.0184772
10%     .1034057      -.0155239       Obs               6,331
25%     .1273421      -.0108516       Sum of Wgt.       6,331

50%     .1582059                      Mean             .17368
                        Largest       Std. Dev.      .0714007
75%     .2060987       .5729176
90%     .2655372       .6121354       Variance       .0050981
95%     .3058527       .7486743       Skewness       1.736273
99%     .4117846       1.116279       Kurtosis       11.23627
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0836805       .0294363
 5%     .1325138       .0338502
10%      .154463       .0421726       Obs               5,304
25%      .189723       .0469825       Sum of Wgt.       5,304

50%     .2386011                      Mean           .2564485
                        Largest       Std. Dev.      .0949366
75%     .3080274       .6839921
90%     .3835605        .686282       Variance        .009013
95%     .4340377       .7243621       Skewness       1.019139
99%     .5434997       1.116271       Kurtosis       5.271292
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0640897       .0294363
 5%     .0955111       .0338502
10%     .1188123        .050747       Obs                 369
25%     .1777658       .0640897       Sum of Wgt.         369

50%     .2322766                      Mean           .2345978
                        Largest       Std. Dev.      .0879511
75%      .288197       .4586422
90%     .3405098        .482684       Variance       .0077354
95%     .3907783       .5313132       Skewness       .4494862
99%     .4586422        .575541       Kurtosis       3.576162
(67,651 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_2.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .07
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(21,408 missing values generated)
(21,408 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 114
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0591771       -.034005
 5%     .0891016      -.0171552
10%     .1050069      -.0144131       Obs              10,239
25%     .1317858      -.0100751       Sum of Wgt.      10,239

50%     .1805001                      Mean           .2026605
                        Largest       Std. Dev.      .0957947
75%     .2533436       .6950281
90%     .3328215         .70322       Variance       .0091766
95%     .3888094       .9398816       Skewness       1.234601
99%     .5059022       1.036533       Kurtosis       5.318661
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0529535       -.034005
 5%     .0818642      -.0171552
10%     .0959994      -.0144131       Obs               6,331
25%     .1182055      -.0100751       Sum of Wgt.       6,331

50%     .1468353                      Mean           .1612256
                        Largest       Std. Dev.      .0662983
75%     .1913278       .5319603
90%     .2465261        .568409       Variance       .0043955
95%      .283962       .6950281       Skewness       1.737012
99%     .3823703       1.036533       Kurtosis       11.23947
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .077693         .02733
 5%     .1230485       .0314297
10%     .1434299       .0391603       Obs               5,304
25%     .1761714       .0436266       Sum of Wgt.       5,304

50%     .2215579                      Mean           .2381301
                        Largest       Std. Dev.      .0881555
75%     .2860255       .6351355
90%     .3561633       .6372618       Variance       .0077714
95%      .403035        .672622       Skewness       1.019133
99%     .5046783       1.036537       Kurtosis       5.271293
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0595055         .02733
 5%     .0886851       .0314297
10%     .1103223       .0471158       Obs                 369
25%     .1650668       .0595055       Sum of Wgt.         369

50%       .21568                      Mean           .2178326
                        Largest       Std. Dev.      .0816672
75%     .2676053       .4258722
90%     .3161836       .4481803       Variance       .0066695
95%     .3628494       .4933348       Skewness       .4493617
99%     .4258722       .5343972       Kurtosis       3.575882
(67,372 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_3.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .075
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(21,408 missing values generated)
(21,408 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 114
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0552024      -.0317347
 5%     .0831375      -.0160096
10%     .0979742      -.0134504       Obs              10,239
25%     .1229385      -.0094021       Sum of Wgt.      10,239

50%      .168422                      Mean           .1891212
                        Largest       Std. Dev.      .0894193
75%     .2364285       .6485347
90%     .3106327       .6563356       Variance       .0079958
95%     .3628598       .8772213       Skewness       1.234591
99%     .4721747       .9674202       Kurtosis        5.31772
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0494094      -.0317347
 5%     .0763692      -.0160096
10%     .0895786      -.0134504       Obs               6,331
25%     .1103151      -.0094021       Sum of Wgt.       6,331

50%     .1369915                      Mean           .1504317
                        Largest       Std. Dev.      .0618763
75%     .1785191        .496464
90%     .2299674       .5305128       Variance       .0038287
95%     .2648977       .6485347       Skewness        1.73775
99%     .3568779       .9674202       Kurtosis       11.24266
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0725039       .0255045
 5%     .1148453       .0293319
10%     .1338679       .0365496       Obs               5,304
25%     .1644266       .0407182       Sum of Wgt.       5,304

50%     .2067872                      Mean           .2222542
                        Largest       Std. Dev.      .0822785
75%     .2669571       .5927931
90%     .3324191       .5947778       Variance       .0067697
95%      .376166       .6277805       Skewness       1.019128
99%     .4710331        .967434       Kurtosis       5.271296
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0555326       .0255045
 5%     .0827692       .0293319
10%     .1029643       .0439688       Obs                 369
25%      .154061       .0555326       Sum of Wgt.         369

50%     .2012963                      Mean           .2033027
                        Largest       Std. Dev.      .0762211
75%     .2497591       .3974715
90%     .2951009       .4182771       Variance       .0058097
95%     .3386443       .4604202       Skewness       .4492371
99%     .3974715       .4987393       Kurtosis         3.5756
(67,372 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_4.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .08
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(21,001 missing values generated)
(21,001 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 115
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0517515      -.0297482
 5%     .0779188      -.0150071
10%      .091806      -.0126081       Obs              10,239
25%      .115254      -.0088133       Sum of Wgt.      10,239

50%     .1578338                      Mean           .1772744
                        Largest       Std. Dev.      .0838409
75%     .2216506       .6078531
90%     .2912175       .6153119       Variance       .0070293
95%      .340154       .8223937       Skewness       1.234582
99%     .4426631       .9069463       Kurtosis       5.316779
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0463083      -.0297482
 5%     .0715869      -.0150071
10%     .0839691      -.0126081       Obs               6,352
25%     .1034712      -.0088133       Sum of Wgt.       6,352

50%     .1285053                      Mean           .1412775
                        Largest       Std. Dev.      .0584605
75%     .1675755       .4654046
90%     .2157884       .4973537       Variance       .0034176
95%     .2493183       .6078531       Skewness       1.753937
99%     .3376093       .9069463       Kurtosis       11.17133
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0679634       .0239072
 5%     .1076674       .0274964
10%     .1255011       .0342652       Obs               5,304
25%     .1541499       .0381733       Sum of Wgt.       5,304

50%     .1938628                      Mean           .2083628
                        Largest       Std. Dev.      .0771361
75%     .2502723       .5557436
90%     .3116429       .5576041       Variance         .00595
95%     .3526556       .5885442       Skewness       1.019122
99%     .4415935        .906969       Kurtosis       5.271298
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0520563       .0239072
 5%     .0775928       .0274964
10%      .096526       .0412152       Obs                 369
25%     .1444309       .0520563       Sum of Wgt.         369

50%     .1887105                      Mean           .1905891
                        Largest       Std. Dev.      .0714558
75%     .2341438       .3726209
90%     .2766536       .3921118       Variance       .0051059
95%     .3174648       .4316199       Skewness       .4491126
99%     .3726209       .4675386       Kurtosis        3.57532
(66,965 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_5.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .085
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(21,001 missing values generated)
(21,001 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 115
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .048707      -.0279954
 5%     .0733142      -.0141225
10%     .0863954      -.0118648       Obs              10,239
25%     .1084256      -.0082937       Sum of Wgt.      10,239

50%     .1485413                      Mean           .1668213
                        Largest       Std. Dev.      .0789187
75%     .2086005       .5719575
90%     .2740864       .5791143       Variance       .0062282
95%     .3201194       .7740164       Skewness       1.234571
99%     .4166234       .8535869       Kurtosis       5.315835
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .043572      -.0279954
 5%     .0673551      -.0141225
10%     .0790185      -.0118648       Obs               6,352
25%     .0973324      -.0082937       Sum of Wgt.       6,352

50%     .1208986                      Mean           .1329271
                        Largest       Std. Dev.      .0550199
75%     .1576345       .4379993
90%     .2030934       .4680956       Variance       .0030272
95%     .2346423       .5719575       Skewness       1.754665
99%      .317736       .8535869       Kurtosis       11.17442
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0639571       .0224978
 5%     .1013341       .0258768
10%     .1181187       .0322496       Obs               5,304
25%     .1450823       .0359278       Sum of Wgt.       5,304

50%     .1824589                      Mean           .1961056
                        Largest       Std. Dev.      .0725987
75%     .2355504       .5230528
90%     .2933109       .5248038       Variance       .0052706
95%     .3319112        .553924       Skewness       1.019117
99%     .4156174       .8536175       Kurtosis       5.271301
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .048989       .0224978
 5%     .0730254       .0258768
10%     .0908451       .0387855       Obs                 369
25%     .1359337        .048989       Sum of Wgt.         369

50%     .1776055                      Mean           .1793712
                        Largest       Std. Dev.      .0672511
75%     .2203656        .350694
90%     .2603765       .3690248       Variance       .0045227
95%     .2987771       .4062079       Skewness       .4489881
99%      .350694       .4400085       Kurtosis       3.575039
(66,965 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_6.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .09
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(21,001 missing values generated)
(21,001 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 115
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0460008      -.0264374
 5%     .0692211      -.0133363
10%     .0815795      -.0112042       Obs              10,239
25%     .1023684      -.0078318       Sum of Wgt.      10,239

50%     .1402884                      Mean           .1575297
                        Largest       Std. Dev.      .0745434
75%     .1969809       .5400504
90%     .2588563       .5469388       Variance       .0055567
95%     .3023108       .7310143       Skewness       1.234561
99%     .3934771       .8061563       Kurtosis       5.314891
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0411398      -.0264374
 5%     .0635935      -.0133363
10%     .0746034      -.0112042       Obs               6,352
25%     .0918881      -.0078318       Sum of Wgt.       6,352

50%     .1141509                      Mean           .1255045
                        Largest       Std. Dev.      .0519617
75%      .148829        .413639
90%     .1918097       .4420884       Variance          .0027
95%     .2215969       .5400504       Skewness       1.755394
99%     .3000708       .8061563       Kurtosis        11.1775
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0603959        .021245
 5%     .0957044       .0244372
10%     .1115565        .030458       Obs               5,304
25%     .1370221       .0339318       Sum of Wgt.       5,304

50%     .1723221                      Mean           .1852104
                        Largest       Std. Dev.      .0685654
75%     .2224642       .4939942
90%     .2770159       .4956481       Variance       .0047012
95%     .3134716       .5231503       Skewness       1.019111
99%     .3925276       .8061941       Kurtosis       5.271303
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0462625        .021245
 5%     .0689655       .0244372
10%     .0857955       .0366257       Obs                 369
25%     .1283807       .0462625       Sum of Wgt.         369

50%     .1677343                      Mean           .1693997
                        Largest       Std. Dev.      .0635135
75%     .2081182       .3312033
90%     .2459079        .348503       Variance        .004034
95%     .2821658       .3836195       Skewness       .4488635
99%     .3312033       .4155374       Kurtosis       3.574758
(66,965 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_7.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .095
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(21,001 missing values generated)
(21,001 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 115
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0435795      -.0250433
 5%     .0655589      -.0126328
10%     .0772625       -.010613       Obs              10,239
25%     .0969487      -.0074186       Sum of Wgt.      10,239

50%     .1328913                      Mean           .1492161
                        Largest       Std. Dev.      .0706287
75%     .1865844       .5115018
90%     .2452288       .5181502       Variance       .0049884
95%     .2863769       .6925389       Skewness       1.234549
99%     .3727673       .7637185       Kurtosis       5.313946
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0389636      -.0250433
 5%     .0602278      -.0126328
10%      .070662       -.010613       Obs               6,352
25%     .0870153      -.0074186       Sum of Wgt.       6,352

50%     .1080886                      Mean           .1188632
                        Largest       Std. Dev.      .0492253
75%     .1409393        .391843
90%     .1817067       .4188187       Variance       .0024231
95%     .2099247       .5115018       Skewness       1.756121
99%     .2842651       .7637185       Kurtosis       11.18057
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0572096        .020124
 5%     .0906673       .0231491
10%     .1056851       .0288549       Obs               5,304
25%     .1298104       .0321459       Sum of Wgt.       5,304

50%     .1632524                      Mean            .175462
                        Largest       Std. Dev.      .0649568
75%     .2107556       .4679946
90%      .262436       .4695614       Variance       .0042194
95%     .2969731       .4956161       Skewness       1.019105
99%     .3718682       .7637625       Kurtosis       5.271305
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .043823        .020124
 5%     .0653329       .0231491
10%     .0812774       .0346933       Obs                 369
25%     .1216228        .043823       Sum of Wgt.         369

50%     .1589022                      Mean           .1604779
                        Largest       Std. Dev.      .0601695
75%     .1971601       .3137643
90%     .2329624       .3301414       Variance       .0036204
95%      .267303       .3634088       Skewness       .4487391
99%     .3137643       .3936421       Kurtosis       3.574477
(66,965 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_8.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .1
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(21,001 missing values generated)
(21,001 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 115
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0414003      -.0237887
 5%      .062263      -.0119997
10%     .0733662       -.010081       Obs              10,239
25%     .0920778      -.0070467       Sum of Wgt.      10,239

50%     .1262041                      Mean           .1417339
                        Largest       Std. Dev.      .0671055
75%     .1772276       .4858083
90%      .232964       .4922404       Variance       .0045032
95%     .2720363       .6579108       Skewness       1.234538
99%     .3541284       .7255244       Kurtosis          5.313
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .037005      -.0237887
 5%     .0571987      -.0119997
10%     .0671034       -.010081       Obs               6,352
25%     .0826267      -.0070467       Sum of Wgt.       6,352

50%     .1026367                      Mean           .1128861
                        Largest       Std. Dev.      .0467626
75%     .1338349       .3722266
90%     .1725946       .3978761       Variance       .0021867
95%     .1994197       .4858083       Skewness       1.756847
99%       .27004       .7255244       Kurtosis       11.18363
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0543419       .0191152
 5%      .086134       .0219898
10%     .1004008       .0274122       Obs               5,304
25%     .1233199       .0305386       Sum of Wgt.       5,304

50%     .1550896                      Mean           .1666884
                        Largest       Std. Dev.      .0617089
75%     .2002178       .4445948
90%     .2493142       .4460832       Variance        .003808
95%     .2821245       .4708352       Skewness         1.0191
99%     .3532748       .7255742       Kurtosis       5.271307
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0416274       .0191152
 5%     .0620636       .0219898
10%     .0772111       .0329542       Obs                 369
25%     .1155406       .0416274       Sum of Wgt.         369

50%     .1509533                      Mean           .1524483
                        Largest       Std. Dev.      .0571598
75%     .1872977       .2980692
90%     .2213114        .313616       Variance       .0032672
95%     .2539265       .3452192       Skewness       .4486145
99%     .2980692       .3739364       Kurtosis       3.574197
(66,965 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_9.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .105
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(20,987 missing values generated)
(20,987 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 116
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0394286      -.0226536
 5%     .0592793      -.0114268
10%     .0698598      -.0095997       Obs              10,239
25%     .0876608      -.0067102       Sum of Wgt.      10,239

50%     .1201439                      Mean           .1349643
                        Largest       Std. Dev.      .0639178
75%     .1687657       .4625617
90%     .2218673       .4687982       Variance       .0040855
95%     .2590615       .6265808       Skewness       1.234525
99%     .3372646       .6909678       Kurtosis       5.312052
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0352329      -.0226536
 5%     .0545143      -.0114268
10%     .0638929      -.0095997       Obs               6,364
25%     .0786715      -.0067102       Sum of Wgt.       6,364

50%     .0977461                      Mean           .1075942
                        Largest       Std. Dev.      .0446472
75%     .1275435       .3544784
90%     .1644355        .378928       Variance       .0019934
95%     .1899748       .4625617       Skewness       1.753538
99%     .2578936       .6909678       Kurtosis        11.1005
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0517474       .0182024
 5%     .0820323       .0209409
10%     .0956198       .0261068       Obs               5,304
25%     .1174475       .0290844       Sum of Wgt.       5,304

50%     .1477043                      Mean           .1587505
                        Largest       Std. Dev.      .0587704
75%     .1906836       .4234236
90%     .2374421       .4248412       Variance        .003454
95%       .26869       .4484145       Skewness       1.019094
99%     .3364522       .6910228       Kurtosis        5.27131
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .039641       .0182024
 5%     .0591057       .0209409
10%     .0735321       .0313807       Obs                 369
25%     .1100374        .039641       Sum of Wgt.         369

50%     .1437614                      Mean           .1451833
                        Largest       Std. Dev.      .0544367
75%     .1783747       .2838689
90%     .2107701       .2986644       Variance       .0029634
95%      .241824       .3287619       Skewness       .4484901
99%     .2838689       .3561075       Kurtosis       3.573916
(66,951 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_10.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .11
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(20,987 missing values generated)
(20,987 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 116
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0376362      -.0216216
 5%     .0565602       -.010906
10%     .0666739      -.0091621       Obs              10,239
25%     .0836562      -.0064043       Sum of Wgt.      10,239

50%     .1146542                      Mean           .1288101
                        Largest       Std. Dev.        .06102
75%     .1610862       .4414285
90%     .2117794       .4474871       Variance       .0037234
95%     .2472663       .5980989       Skewness       1.234513
99%      .321934       .6595528       Kurtosis       5.311103
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .033622      -.0216216
 5%     .0520086       -.010906
10%     .0609817      -.0091621       Obs               6,364
25%     .0750593      -.0064043       Sum of Wgt.       6,364

50%     .0932635                      Mean           .1026728
                        Largest       Std. Dev.      .0426166
75%     .1217177       .3383437
90%     .1569327       .3617024       Variance       .0018162
95%     .1813177       .4414285       Skewness       1.754257
99%     .2461633       .6595528       Kurtosis       11.10347
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0493887       .0173727
 5%     .0783036       .0199874
10%     .0912734       .0249202       Obs               5,304
25%      .112109       .0277624       Sum of Wgt.       5,304

50%     .1409903                      Mean           .1515342
                        Largest       Std. Dev.      .0560991
75%     .1820162       .4041771
90%     .2266493       .4055302       Variance       .0031471
95%     .2564768        .428032       Skewness       1.019088
99%     .3211589       .6596124       Kurtosis       5.271311
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0378351       .0173727
 5%     .0564167       .0199874
10%     .0701876       .0299502       Obs                 369
25%      .105034       .0378351       Sum of Wgt.         369

50%     .1372234                      Mean           .1385789
                        Largest       Std. Dev.      .0519612
75%     .1702628       .2709595
90%      .201187        .285072       Variance          .0027
95%     .2308217       .3138007       Skewness       .4483656
99%     .2709595       .3398993       Kurtosis       3.573635
(66,951 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_11.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .115
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(20,987 missing values generated)
(20,987 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 116
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0359996      -.0206794
 5%     .0540766      -.0104306
10%     .0637552      -.0087625       Obs              10,239
25%     .0799816       -.006125       Sum of Wgt.      10,239

50%       .10963                      Mean           .1231911
                        Largest       Std. Dev.      .0583741
75%     .1540746       .4221329
90%     .2025688       .4280292       Variance       .0034075
95%     .2364967       .5720937       Skewness         1.2345
99%     .3079363       .6308696       Kurtosis       5.310154
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0321511      -.0206794
 5%     .0497208      -.0104306
10%     .0583236      -.0087625       Obs               6,364
25%     .0717652       -.006125       Sum of Wgt.       6,364

50%      .089175                      Mean           .0981793
                        Largest       Std. Dev.      .0407626
75%     .1163813        .323612
90%     .1501089       .3459748       Variance       .0016616
95%     .1734209       .4221329       Skewness       1.754976
99%     .2354531       .6308696       Kurtosis       11.10644
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0472351       .0166151
 5%     .0748991       .0191168
10%     .0873049       .0238367       Obs               5,304
25%     .1072347       .0265553       Sum of Wgt.       5,304

50%     .1348601                      Mean           .1449453
                        Largest       Std. Dev.        .05366
75%     .1741024       .3866042
90%      .216795       .3878985       Variance       .0028794
95%     .2453256       .4094219       Skewness       1.019083
99%     .3071955       .6309333       Kurtosis       5.271313
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0361863       .0166151
 5%     .0539615       .0191168
10%     .0671338       .0286441       Obs                 369
25%     .1004656       .0361863       Sum of Wgt.         369

50%     .1312539                      Mean           .1325487
                        Largest       Std. Dev.       .049701
75%     .1628563       .2591726
90%     .1924373       .2726616       Variance       .0024702
95%     .2207761       .3001405       Skewness       .4482411
99%     .2591726       .3251005       Kurtosis       3.573355
(66,951 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_12.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .1200000000000
> 001
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(20,941 missing values generated)
(20,941 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 117
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0344994      -.0198157
 5%      .051806      -.0099947
10%     .0610769      -.0083963       Obs              10,239
25%     .0766334       -.005869       Sum of Wgt.      10,239

50%     .1050273                      Mean           .1180404
                        Largest       Std. Dev.      .0559487
75%     .1476447       .4044454
90%     .1941256       .4101928       Variance       .0031303
95%     .2266246       .5482556       Skewness       1.234486
99%     .2951052       .6045765       Kurtosis       5.309203
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0308028      -.0198157
 5%     .0477002      -.0099947
10%      .055887      -.0083963       Obs               6,388
25%     .0688137       -.005869       Sum of Wgt.       6,388

50%     .0856025                      Mean           .0943914
                        Largest       Std. Dev.      .0394705
75%     .1120086       .3170686
90%     .1445758       .3315578       Variance       .0015579
95%     .1678389       .4044454       Skewness       1.757436
99%     .2266246       .6045765       Kurtosis       10.92957
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .045261       .0159206
 5%     .0717783       .0183188
10%     .0836672       .0228435       Obs               5,304
25%     .1027665       .0254488       Sum of Wgt.       5,304

50%     .1292408                      Mean           .1389056
                        Largest       Std. Dev.      .0514242
75%     .1668482       .3704957
90%     .2077618        .371736       Variance       .0026444
95%     .2351037       .3923627       Skewness       1.019077
99%     .2943957       .6046442       Kurtosis       5.271315
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0346748       .0159206
 5%     .0517108       .0183188
10%     .0643346       .0274469       Obs                 369
25%      .096278       .0346748       Sum of Wgt.         369

50%     .1257818                      Mean            .127021
                        Largest       Std. Dev.      .0476291
75%      .156067       .2483681
90%     .1844167       .2612854       Variance       .0022685
95%     .2115676       .2876186       Skewness       .4481166
99%     .2483681        .311535       Kurtosis       3.573074
(66,905 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_13.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .1250000000000
> 001
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(20,941 missing values generated)
(20,941 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 117
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0331193      -.0190211
 5%     .0497266      -.0095937
10%     .0586084      -.0080593       Obs              10,239
25%      .073554      -.0056334       Sum of Wgt.      10,239

50%     .1008044                      Mean           .1133017
                        Largest       Std. Dev.      .0537173
75%      .141734       .3881728
90%     .1863579       .3937832       Variance       .0028856
95%     .2175423       .5263245       Skewness       1.234472
99%     .2833006       .5803869       Kurtosis       5.308251
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0295624      -.0190211
 5%     .0457679      -.0095937
10%     .0536377      -.0080593       Obs               6,388
25%     .0660257      -.0056334       Sum of Wgt.       6,388

50%     .0821435                      Mean           .0905888
                        Largest       Std. Dev.      .0378909
75%      .107517       .3043814
90%     .1387602       .3182941       Variance       .0014357
95%     .1610389       .3881728       Skewness       1.758141
99%     .2175423       .5803869       Kurtosis       10.93234
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0434448       .0152816
 5%     .0689072       .0175845
10%     .0803205       .0219297       Obs               5,304
25%     .0986559       .0244309       Sum of Wgt.       5,304

50%     .1240711                      Mean            .133349
                        Largest       Std. Dev.      .0493672
75%     .1601742       .3556758
90%     .1994513       .3568666       Variance       .0024371
95%     .2256996       .3766682       Skewness       1.019072
99%     .2826198       .5804583       Kurtosis       5.271318
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0332843       .0152816
 5%     .0496403       .0175845
10%     .0617593       .0263454       Obs                 369
25%     .0924253       .0332843       Sum of Wgt.         369

50%     .1207468                      Mean           .1219356
                        Largest       Std. Dev.       .045723
75%     .1498209       .2384278
90%     .1770377       .2508193       Variance       .0020906
95%     .2030959       .2760985       Skewness       .4479921
99%     .2384278       .2990547       Kurtosis       3.572794
(66,905 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_14.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .1300000000000
> 001
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(20,941 missing values generated)
(20,941 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 117
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0318453      -.0182876
 5%     .0478038      -.0092236
10%     .0563274      -.0077483       Obs              10,239
25%     .0707128       -.005416       Sum of Wgt.      10,239

50%     .0969057                      Mean           .1089275
                        Largest       Std. Dev.      .0516576
75%     .1362695       .3731521
90%     .1791878        .378636       Variance       .0026685
95%     .2091586       .5060805       Skewness       1.234457
99%      .272404        .558058       Kurtosis       5.307298
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0284174      -.0182876
 5%     .0439843      -.0092236
10%     .0515616      -.0077483       Obs               6,388
25%     .0634671       -.005416       Sum of Wgt.       6,388

50%     .0789455                      Mean           .0870786
                        Largest       Std. Dev.      .0364327
75%     .1033459       .2926701
90%     .1333704       .3060507       Variance       .0013273
95%     .1547619       .3731521       Skewness       1.758846
99%     .2091586        .558058       Kurtosis        10.9351
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0417683       .0146919
 5%     .0662569       .0169068
10%     .0772312       .0210863       Obs               5,304
25%     .0948614       .0234912       Sum of Wgt.       5,304

50%      .119299                      Mean           .1282199
                        Largest       Std. Dev.      .0474685
75%     .1540137        .341996
90%     .1917801       .3431409       Variance       .0022533
95%     .2170188       .3621809       Skewness       1.019066
99%     .2717499       .5581327       Kurtosis        5.27132
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0320008       .0146919
 5%      .047729       .0169068
10%     .0593821       .0253287       Obs                 369
25%     .0888691       .0320008       Sum of Wgt.         369

50%     .1160981                      Mean           .1172413
                        Largest       Std. Dev.      .0439635
75%     .1440552       .2292522
90%     .1702264       .2411582       Variance       .0019328
95%     .1952758       .2654645       Skewness       .4478676
99%     .2292522       .2875345       Kurtosis       3.572513
(66,905 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_15.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .1350000000000
> 001
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(20,941 missing values generated)
(20,941 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 117
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0306534      -.0176085
 5%     .0460274      -.0088808
10%     .0542153      -.0074603       Obs              10,239
25%     .0680791      -.0052147       Sum of Wgt.      10,239

50%     .0932852                      Mean           .1048773
                        Largest       Std. Dev.      .0497505
75%     .1312143       .3592439
90%     .1725452       .3646108       Variance       .0024751
95%     .2014079        .487336       Skewness       1.234442
99%     .2623146       .5373832       Kurtosis       5.306344
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0273572      -.0176085
 5%     .0423329      -.0088808
10%     .0496415      -.0074603       Obs               6,388
25%     .0610951      -.0052147       Sum of Wgt.       6,388

50%     .0759957                      Mean           .0838285
                        Largest       Std. Dev.      .0350826
75%     .0994658       .2818264
90%     .1283853       .2947142       Variance       .0012308
95%     .1489886       .3592439       Skewness        1.75955
99%     .2013959       .5373832       Kurtosis       10.93786
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .040216       .0141458
 5%     .0638029       .0162793
10%     .0743708       .0203053       Obs               5,304
25%      .091348       .0226212       Sum of Wgt.       5,304

50%     .1148804                      Mean           .1234706
                        Largest       Std. Dev.      .0457104
75%     .1483095       .3293295
90%     .1846772        .330432       Variance       .0020894
95%     .2089811       .3487668       Skewness        1.01906
99%      .261685        .537461       Kurtosis       5.271322
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0308123       .0141458
 5%     .0459593       .0162793
10%      .057181       .0243873       Obs                 369
25%     .0855762       .0308123       Sum of Wgt.         369

50%     .1117938                      Mean           .1128948
                        Largest       Std. Dev.      .0423343
75%     .1387167       .2207563
90%     .1639196       .2322128       Variance       .0017922
95%     .1880349       .2556183       Skewness       .4477432
99%     .2207563       .2768676       Kurtosis       3.572233
(66,905 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_16.csv saved
Beta, Gamma, and Epsilon: .0685098394751549, -.0218667536973953, .1400000000000
> 001
(45,244 missing values generated)
(45,016 missing values generated)
(45,244 missing values generated)
(45,016 missing values generated)
(51,537 missing values generated)
(54,031 missing values generated)
(51,987 missing values generated)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(228 real changes made, 228 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            90,032  
    -----------------------------------------
(45,964 observations deleted)
(20,785 missing values generated)
(20,785 missing values generated)
(note: file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp not found)
file C:\Users\shermo\AppData\Local\Temp\8\ST_cd7c_000004.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,896
        from master                     1,896  
        from using                          0  

    matched                            88,136  
    -----------------------------------------
 Counterfactual: fed_9usd
    Unique CBAs: 176
    Unique CBAs strongly affected: 118
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0295433      -.0169778
 5%     .0443707      -.0085626
10%     .0522541      -.0071929       Obs              10,239
25%      .065629      -.0050277       Sum of Wgt.      10,239

50%     .0899533                      Mean           .1011165
                        Largest       Std. Dev.      .0479796
75%     .1265279       .3463293
90%      .166377       .3515874       Variance        .002302
95%     .1942124       .4699304       Skewness       1.234427
99%     .2529459       .5181851       Kurtosis       5.305389
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0263727      -.0169778
 5%      .040967      -.0085626
10%     .0481469      -.0071929       Obs               6,532
25%     .0591198      -.0050277       Sum of Wgt.       6,532

50%     .0739186                      Mean           .0817306
                        Largest       Std. Dev.       .034496
75%     .0974315       .2717572
90%     .1260035       .2841875       Variance         .00119
95%     .1462362       .3463293       Skewness       1.711796
99%     .1953604       .5181851       Kurtosis        10.2819
 Counterfactual: chi14
    Unique CBAs: 176
    Unique CBAs strongly affected: 1
    Distribution of rho

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0387746       .0136387
 5%     .0615243       .0156966
10%     .0717147       .0195801       Obs               5,304
25%     .0880856       .0218133       Sum of Wgt.       5,304

50%     .1107774                      Mean           .1190607
                        Largest       Std. Dev.      .0440779
75%     .1430127       .3175677
90%     .1780815       .3186308       Variance       .0019429
95%     .2015175       .3363108       Skewness       1.019055
99%     .2523392       .5182658       Kurtosis       5.271325
    Distribution of rho for strongly affected CBAs

                             rho
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0297087       .0136387
 5%      .044316       .0156966
10%     .0551371       .0235131       Obs                 369
25%     .0825185       .0297087       Sum of Wgt.         369

50%     .1077969                      Mean           .1088588
                        Largest       Std. Dev.      .0408215
75%     .1337594       .2128672
90%     .1580633       .2239064       Variance       .0016664
95%     .1813113       .2464754       Skewness       .4476187
99%     .2128672       .2669626       Kurtosis       3.571953
(66,749 observations deleted)
(0 observations deleted)
file ../temp/tot_incidence_17.csv saved
(note: file ../output/tot_incidence_var_epsilon.csv not found)
file ../output/tot_incidence_var_epsilon.csv saved

. 
end of do-file


Execute:  StataMP-64 /e do "./figures_varepsilon.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./figures_varepsilon.do 

. clear all

. set more off

. set maxvar 32000


. set scheme s2color, permanently
(set scheme preference recorded)

. 
. program main
  1.     local in_large "../../../drive/analysis_large/counterfactuals"
  2.     local in_wages "../../twfe_wages/output"
  3.     local in_zip   "../../../drive/derived_large/zipcode"
  4. 
.     import delimited "../output/tot_incidence_var_epsilon.csv", clear
  5. 
.     rename counterfactual cofa
  6.     replace epsilon = round(epsilon, .001)
  7.     gen base = (epsilon > .099) & (epsilon < 0.101)
  8. 
.     twoway (line    tot_incidence epsilon if cofa == "fed_9usd",             
> lcol(navy))    ///
>            (line    tot_incidence epsilon if cofa == "chi14",                
> lcol(maroon))  ///
>            (scatter tot_incidence epsilon if cofa == "fed_9usd" & base == 1, 
> mcol(navy))    ///
>            (scatter tot_incidence epsilon if cofa == "chi14"    & base == 1, 
> mcol(maroon)), ///
>         xtitle("Elasticity of wage income to the minimum wage") xline(0.1, lp
> at(dash) lcol(gray)) ///
>         ytitle("Total share pocketed by landlords")                          
>                ///
>         ylabel(0.06(0.03)0.19) xlabel(0.06(0.02)0.14)                        
>                ///
>         graphregion(color(white)) bgcolor(white)                             
>                ///
>         legend(order(1 "Federal MW" 2 "Chicago city MW"))
  9.             
.     graph export "../output/incidence_by_epsilon_png.png", width(2221) height
> (1615) replace
 10.     graph export "../output/incidence_by_epsilon.eps", replace
 11. end

. 
. program get_xlabel, rclass
  1.     syntax, var(str)
  2. 
.     if inlist("`var'", "p_d_ln_rents", "p_d_ln_rents_with_fe", ///
>               "p_d_ln_rents_zillow", "p_d_ln_rents_with_fe_zillow") {
  3.         return local x_lab "Change in log rents"
  4.     }
  5. 
.     if "`var'"=="d_mw_res"           return local x_lab "Change in residence 
> MW"
  6.     if "`var'"=="d_mw_wkp"           return local x_lab "Change in workpla
> ce MW"
  7. 
.     if "`var'"=="change_ln_rents"    return local x_lab "Change in log rents 
> per sq. foot"
  8.     if "`var'"=="change_ln_wagebill" return local x_lab "Change in log tot
> al wages"
  9. 
.     if "`var'"=="rho"                return local x_lab "Share pocketed by la
> ndlords"
 10.     if "`var'"=="rho_with_imputed"   return local x_lab "Share pocketed by
>  landlords"
 11. 
.     if "`var'"=="s_imputed"          return local x_lab "Housing expenditure 
> share"
 12. end

. 
. 
. main
(6 vars, 68 obs)
(0 real changes made)
(note: file ../output/incidence_by_epsilon_png.png not found)
(file ../output/incidence_by_epsilon_png.png written in PNG format)
(note: file ../output/incidence_by_epsilon.eps not found)
(file ../output/incidence_by_epsilon.eps written in EPS format)

. 
end of do-file


Execute:  StataMP-64 /e do "./make_autofill_values.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./make_autofill_values.do 

. clear all

. set more off

. set maxvar 32000


. 
. program main
  1.     local in_data       "../../../drive/analysis_large/counterfactuals"
  2.     local in_baseline   "../../fd_baseline/output"
  3.     local in_wages      "../../twfe_wages/output"
  4.     local out_autofill  "../output"
  5. 
.     load_parameters, in_baseline(`in_baseline') in_wages(`in_wages')
  6.     local beta    = r(beta)
  7.     local gamma   = r(gamma)
  8.     local epsilon = r(epsilon)
  9. 
.     import delimited ../output/tot_incidence.csv, clear
 10.     qui sum tot_incidence if counterfactual == "fed_9usd"
 11.     local tot_inc_fed_9usd = r(mean)
 12.     qui sum tot_incidence if counterfactual == "chi14"
 13.     local tot_inc_chi14 = r(mean)
 14. 
.     use `in_data'/data_counterfactuals.dta, clear
 15. 
.     make_autofill_values, beta(`beta') gamma(`gamma') epsilon(`epsilon') ///
>         tot_inc_fed_9usd(`tot_inc_fed_9usd') tot_inc_chi14(`tot_inc_chi14')
 16. 
. end

. 
. program load_parameters, rclass
  1.     syntax, in_baseline(str) in_wages(str)
  2. 
.     use `in_baseline'/estimates_static.dta, clear
  3.     keep if model == "static_both"
  4. 
.     qui sum b if var == "mw_res"
  5.     return local gamma = r(mean)
  6.     qui sum b if var == "mw_wkp_tot_17"
  7.     return local beta = r(mean)
  8. 
.     use `in_wages'/estimates_all.dta if model == "cbsa_time", clear
  9.     qui sum b
 10.     return local epsilon = r(mean)
 11. end

. 
. program make_autofill_values
  1.     syntax, gamma(real) beta(real) epsilon(real) tot_inc_fed_9usd(real) to
> t_inc_chi14(real)
  2. 
.     cap file close f
  3.     file open   f using "../output/autofill_counterfactuals.tex", write re
> place
  4.     file write  f "\newcommand{\gammaCf}{"    %5.4f  (`gamma')   "}" _n
  5.     file write  f "\newcommand{\betaCf}{"     %5.4f  (`beta')    "}" _n
  6.     file write  f "\newcommand{\epsilonCf}{"  %5.4f  (`epsilon') "}" _n
  7. 
.     foreach cf in "fed_9usd" "chi14" {
  8. 
.         if "`cf'" == "fed_9usd" {
  9.             local cfname "FedNine"
 10.             local tot_inc = `tot_inc_fed_9usd'
 11.         }
 12.         else if "`cf'" == "chi14" {
 13.             local cfname "ChiFourteen"
 14.             local tot_inc = `tot_inc_chi14'
 15.         }
 16. 
.         preserve
 17.             local tot_inc_cents = `tot_inc'*100
 18.             
.             qui tab cbsa if cbsa_low_inc_increase == 1 & counterfactual == "`
> cf'"
 19.             local cbsa_low_inc = r(r)
 20. 
.             keep if counterfactual == "`cf'" & cbsa_low_inc_increase == 0
 21.             gen nonmiss_cond = !missing(s_imputed) & !missing(perc_incr_re
> nt)  ///
>                 & !missing(perc_incr_wagebill)
 22. 
.             qui sum rho if nonmiss_cond == 1, d
 23. 
.             local rho_median    = r(p50)
 24.             local rho_med_cents = r(p50)*100
 25. 
.             qui sum rho if nonmiss_cond == 1 & year == 2020 & no_direct_treat
> ment == 0, d
 26.             local rho_meddir_cent = 100 * r(p50)
 27. 
.             qui sum rho if nonmiss_cond == 1 & year == 2020 & no_direct_treat
> ment == 1, d
 28.             local rho_medind_cent = 100 * r(p50)
 29. 
.             qui count if nonmiss_cond == 1 & year == 2020
 30.             local zip_total = r(N)
 31. 
.             qui count if nonmiss_cond == 1 & year == 2020 & no_direct_treatme
> nt == 1
 32.             local zip_no_treat = r(N)
 33.             local zip_notr_pct = 100*`zip_no_treat'/`zip_total'
 34. 
.             qui count if nonmiss_cond == 1 & year == 2020 & no_direct_treatme
> nt == 0
 35.             local zip_treat    = r(N)
 36.             local zip_tr_pct   = 100*`zip_treat'/`zip_total'
 37. 
.             qui count if year == 2019 & no_direct_treatment == 0 & statutory_
> mw == 7.25
 38.             local zip_bound     = r(N)    
 39.             local zip_bound_pct = 100*`zip_bound'/`zip_total'
 40. 
.             qui sum d_mw_res if nonmiss_cond == 1, d
 41.             local avg_change_mw_res = 100 * r(mean)
 42.             local med_change_mw_res = 100 * r(p50)
 43. 
.             qui sum d_mw_wkp if nonmiss_cond == 1, d
 44.             local avg_change_mw_wkp = 100 * r(mean)
 45.             local med_change_mw_wkp = 100 * r(p50)
 46. 
.             file write  f "\newcommand{\totIncidence`cfname'}{\textnormal{"  
>       %4.3f   (`tot_inc')         "}}" _n
 47.             file write  f "\newcommand{\totIncidenceCents`cfname'}{\textno
> rmal{"   %3.1f   (`tot_inc_cents')   "}}" _n
 48.             file write  f "\newcommand{\rhoMedian`cfname'}{\textnormal{"  
>          %4.3f   (`rho_median')      "}}" _n
 49.             file write  f "\newcommand{\cbsaLowInc`cfname'}{\textnormal{" 
>          %2.0f   (`cbsa_low_inc')     "}}" _n
 50.             file write  f "\newcommand{\rhoMedCentsIndir`cfname'}{\textnor
> mal{"    %4.1f   (`rho_medind_cent') "}}" _n
 51.             file write  f "\newcommand{\rhoMedCentsDir`cfname'}{\textnorma
> l{"      %4.1f   (`rho_meddir_cent') "}}" _n
 52. 
.             if "`cf'" == "chi14" {
 53.                 file write  f "\newcommand{\zipNoInc`cfname'}{\textnormal{
> "        %3.0fc  (`zip_no_treat')    "}}" _n
 54.                 file write  f "\newcommand{\zipInc`cfname'}{\textnormal{" 
>          %2.0fc  (`zip_treat')       "}}" _n
 55.             }
 56.             else if "`cf'" == "fed_9usd" {
 57.                 file write  f "\newcommand{\zipNoInc`cfname'}{\textnormal{
> "        %5.0fc  (`zip_no_treat')    "}}" _n
 58.                 file write  f "\newcommand{\zipInc`cfname'}{\textnormal{" 
>          %5.0fc  (`zip_treat')       "}}" _n
 59.             }
 60. 
.             if "`cf'" == "fed_9usd" {
 61.                 file write  f "\newcommand{\rhoMedianCents`cfname'}{\textn
> ormal{"   %1.0f   (`rho_med_cents')   "}}" _n
 62.                 file write  f "\newcommand{\zipcodes`cfname'}{\textnormal{
> "         %5.0fc  (`zip_total')       "}}" _n
 63.                 file write  f "\newcommand{\zipNoIncPct`cfname'}{\textnorm
> al{"      %4.1f   (`zip_notr_pct')    "}}" _n
 64.                 file write  f "\newcommand{\zipIncPct`cfname'}{\textnormal
> {"        %4.1f   (`zip_tr_pct')      "}}" _n
 65.                 file write  f "\newcommand{\zipBoundPct`cfname'}{\textnorm
> al{"      %3.1f   (`zip_bound_pct')   "}}" _n
 66.                 file write  f "\newcommand{\zipBound`cfname'}{\textnormal{
> "         %5.0fc  (`zip_bound')       "}}" _n
 67.                 file write  f "\newcommand{\AvgChangeMWRes`cfname'}{\textn
> ormal{"   %3.1f   (`avg_change_mw_res') "}}" _n
 68.                 file write  f "\newcommand{\MedChangeMWRes`cfname'}{\textn
> ormal{"   %3.1f   (`med_change_mw_res') "}}" _n
 69.                 file write  f "\newcommand{\AvgChangeMWWkp`cfname'}{\textn
> ormal{"   %3.1f   (`avg_change_mw_wkp') "}}" _n 
 70.                 file write  f "\newcommand{\MedChangeMWWkp`cfname'}{\textn
> ormal{"   %3.1f   (`med_change_mw_wkp') "}}" _n 
 71.             }
 72. 
.         restore
 73.     }
 74.     file close  f
 75. end

. 
. main
(6 observations deleted)
(5 vars, 4 obs)
(note: file ../output/autofill_counterfactuals.tex not found)
(76,158 observations deleted)
(89,256 observations deleted)

. 
. 
. 
. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(data.table)
Warning message:
package 'data.table' was built under R version 4.1.3 
> 
> main <- function() {
+   instub   <- "../output"
+   in_large <- "../../../drive/analysis_large/counterfactuals"
+   outstub  <- "../output"
+   
+   dt <- fread(file.path(in_large, "data_counterfactuals.csv"))
+   
+   txt <- c("<tab:counterfactuals>")
+ 
+   for (cf in c("fed_9usd", "chi14")) {
+ 
+     dt_cf <- dt[counterfactual == cf
+                 & year == 2020 
+                 & cbsa_low_inc_increase == 0]
+ 
+     for (sample in c("fully_affected", "no_direct_treatment")) {
+       dt_sample <- dt_cf[get(sample) == 1]
+       
+       txt <- c(txt, 
+                   paste(dim(dt_sample)[1],
+                         median(dt_sample[["d_mw_res"]],         na.rm = T),
+                         median(dt_sample[["d_mw_wkp"]],         na.rm = T),
+                         median(dt_sample[["s_imputed"]],        na.rm = T),
+                         median(dt_sample[["rho_with_imputed"]], na.rm = T),
+                         sep = "\t"))
+     }
+ 
+     dt_tot_incidence <- fread(file.path(instub, "tot_incidence.csv"))
+     dt_tot_incidence <- dt_tot_incidence[counterfactual == cf]
+     txt <- c(txt, 
+           paste(dt_tot_incidence$N,
+                 dt_tot_incidence$tot_incidence,
+                 sep = "\t"))
+   }
+   fileConn <- file(file.path(outstub, "counterfactuals.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+  
+   # Other Federal Counterfactual policies  
+   txt <- c("<tab:counterfactuals_other>")
+ 
+   for (cf in c("fed_10pc", "fed_15usd")) {
+     dt_cf <- dt[counterfactual == cf
+                & year == 2020 
+                & cbsa_low_inc_increase == 0]
+ 
+     for (sample in c("fully_affected", "no_direct_treatment")) {
+       
+       dt_sample <- dt_cf[get(sample) == 1]      
+       txt <- c(txt, 
+               paste(dim(dt_sample)[1],
+                     median(dt_sample[["d_mw_res"]],         na.rm = T),
+                     median(dt_sample[["d_mw_wkp"]],         na.rm = T),
+                     median(dt_sample[["s_imputed"]],        na.rm = T),
+                     median(dt_sample[["rho_with_imputed"]], na.rm = T),
+                     sep = "\t"))
+     }
+     
+     dt_tot_incidence <- fread(file.path(instub, "tot_incidence.csv"))
+     dt_tot_incidence <- dt_tot_incidence[counterfactual == cf]
+     txt <- c(txt, 
+              paste(dt_tot_incidence$N,
+                    dt_tot_incidence$tot_incidence,
+                    sep = "\t"))
+   }
+   
+   fileConn <- file(file.path(outstub, "counterfactuals_other.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.71    0.21    0.75 


Execute:  R CMD BATCH --no-save "./map_cfs.R" map_cfs.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> 
> library(sf)
Linking to GEOS 3.9.1, GDAL 3.2.1, PROJ 7.2.1
> library(dplyr)

Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

Warning message:
package 'dplyr' was built under R version 4.1.3 
> library(spData)
To access larger datasets in this package, install the spDataLarge
package with: `install.packages('spDataLarge',
repos='https://nowosad.github.io/drat/', type='source')`
> library(tmap)
> library(tmaptools)
> library(ggplot2)
> 
> main <- function() {
+   in_map   <- "../../../drive/raw_data/shapefiles/USPS_zipcodes"
+   in_counties   <- "../../../drive/raw_data/shapefiles/counties"
+   in_large <- "../../../drive/analysis_large/counterfactuals"
+ 
+   USPS_zipcodes <- read_sf(dsn   = in_map, 
+                            layer = "USPS_zipcodes_July2020") %>%
+     select(ZIP_CODE, PO_NAME, STATE, POPULATION, SQMI, POP_SQMI) %>%
+     rename(zipcode = ZIP_CODE, zipcode_name = PO_NAME,
+            state_name = STATE)
+ 
+   counties <- read_sf(dsn   = in_counties, 
+                       layer = "cb_2018_us_county_500k") %>%
+     select(COUNTYFP) %>%
+     rename(countyfp = COUNTYFP)
+   
+   df_cf_data <- data.table::fread(file.path(in_large, "data_counterfactuals.csv"),
+                                   colClasses = c(zipcode = "character")) %>%
+     filter(year == 2020)
+   
+   # Housing expenditure  
+   df_all <- df_cf_data %>%
+     filter(counterfactual == "fed_9usd")
+ 
+   df_all <- left_join(USPS_zipcodes, df_all, by = "zipcode")
+ 
+   df_chicago <- df_all %>% filter(cbsa == 16980)
+ 
+   min_break <- round(min(df_chicago$s_imputed, na.rm = TRUE), digits = 3)
+   max_break <- round(max(df_chicago$s_imputed, na.rm = TRUE), digits = 3)
+   
+   build_map(data         = df_chicago, 
+             counties     = counties,
+             var          = "s_imputed", 
+             var_legend   ="Share of expenditure in housing", 
+             break_values = c(min_break, (min_break + max_break)/2, max_break), 
+             map_name     = "chicago_s_imputed")
+ 
+   # Maps for each counterfactual
+   
+   plotsdata_list <- list(
+     c("d_mw_res",           "Change in\nresidence MW",           "chicago_d_mw_res",      "d_mw_res"),
+     c("d_mw_wkp",           "Change in\nworkplace MW",           "chicago_d_mw_wkp",      "d_mw_res"),
+     c("change_ln_rents",    "Change in log rents\nper sq. foot", "chicago_d_ln_rents",    "change_ln_rents"),
+     c("change_ln_wagebill", "Change in\nlog total wages",        "chicago_d_ln_wagebill", "change_ln_wagebill"),
+     c("rho_with_imputed",   "Share pocketed\nby landlords",      "chicago_rho_with_imputed", "rho_with_imputed"))
+       # Var                 # Legend                             # Plot name              # Break var
+   
+   for (cf in c("fed_9usd", "chi14")) {
+     
+     df_all <- left_join(USPS_zipcodes, 
+                         df_cf_data %>% filter(counterfactual == cf), 
+                         by = "zipcode")
+     df_chicago <- df_all %>% filter(cbsa == 16980)
+ 
+     lapply(plotsdata_list, 
+       function(plt_data) {
+ 
+         yvar        <- plt_data[1]
+         legend_name <- plt_data[2]
+         plot_name   <- paste0(plt_data[3], "_", cf)
+         break_var   <- plt_data[4]
+ 
+         min_break <- round(min(df_chicago[[break_var]], na.rm = TRUE), digits = 3)
+         max_break <- round(max(df_chicago[[break_var]], na.rm = TRUE), digits = 3)
+ 
+         if ("mw" %in% yvar) {
+           break_vals <- c(0, max_break/2, max_break)
+         } 
+         else {
+           if (grepl("rents|wage", yvar)) {
+             min_break <- round(min(min(df_chicago$change_ln_wagebill, na.rm = T),
+                                    min(df_chicago$change_ln_rents, na.rm = T)), 
+                                 digits = 3)
+             max_break <- round(max(max(df_chicago$change_ln_wagebill, na.rm = T),
+                                    max(df_chicago$change_ln_rents, na.rm = T)), 
+                                 digits = 3)
+           }
+           break_vals <- c(min_break, (min_break + max_break)/2, max_break)
+         }
+         
+         build_map(data         = df_chicago, 
+                   counties     = counties,
+                   var          = yvar, 
+                   var_legend   = legend_name, 
+                   break_values = break_vals, 
+                   map_name     = plot_name)
+     })
+   }
+ }
> 
> build_map <- function(data, counties, var, var_legend, break_values,
+                       map_name, .dpi = 300) {
+   
+   map <- tm_shape(data) + 
+     tm_fill(col = var,
+             title = var_legend,
+             style = "cont",
+             palette = c("#A6E1F4", "#077187"),
+             breaks = break_values,
+             textNA = "NA") +
+     tm_borders(col = "white", lwd = .006, alpha = 1) +
+     tm_layout(legend.position = c("left", "bottom"),
+               legend.bg.color = "white",
+               frame = FALSE) +
+     tm_shape(counties) +
+     tm_borders(col = "black", lwd = .002,
+                alpha = 1) +
+     tmap_options(check.and.fix = TRUE)
+   
+   tmap_save(map, 
+             paste0("../output/", map_name, "_png.png"),
+             dpi = .dpi)
+   tmap_save(map, 
+             paste0("../output/", map_name, ".eps"))
+ }
> 
> main()
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_s_imputed_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_s_imputed.eps
Size: 6.117331 by 8.010029 inches
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_mw_res_fed_9usd_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_mw_res_fed_9usd.eps
Size: 6.117331 by 8.010029 inches
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_mw_wkp_fed_9usd_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_mw_wkp_fed_9usd.eps
Size: 6.117331 by 8.010029 inches
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_ln_rents_fed_9usd_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_ln_rents_fed_9usd.eps
Size: 6.117331 by 8.010029 inches
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_ln_wagebill_fed_9usd_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_ln_wagebill_fed_9usd.eps
Size: 6.117331 by 8.010029 inches
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_rho_with_imputed_fed_9usd_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_rho_with_imputed_fed_9usd.eps
Size: 6.117331 by 8.010029 inches
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_mw_res_chi14_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_mw_res_chi14.eps
Size: 6.117331 by 8.010029 inches
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_mw_wkp_chi14_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_mw_wkp_chi14.eps
Size: 6.117331 by 8.010029 inches
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_ln_rents_chi14_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_ln_rents_chi14.eps
Size: 6.117331 by 8.010029 inches
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_ln_wagebill_chi14_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_d_ln_wagebill_chi14.eps
Size: 6.117331 by 8.010029 inches
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_rho_with_imputed_chi14_png.png
Resolution: 1835.199 by 2403.009 pixels
Size: 6.117331 by 8.010029 inches (300 dpi)
Map saved to C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\counterfactuals\output\chicago_rho_with_imputed_chi14.eps
Size: 6.117331 by 8.010029 inches
There were 32 warnings (use warnings() to see them)
> 
> proc.time()
   user  system elapsed 
 546.01   41.87  592.03 

 make.py ended: 2023-08-03 13:14:00
