
 make.py started: 2021-10-23 09:39:34 C:\Users\diegog\Desktop\Diego\min_wage_rent\base\min_wage\code 




Execute:  StataMP-64 /e do "./state_mw.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./state_mw.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local raw     "../../../drive/raw_data/min_wage"
  2.     local xwalk   "../../../raw/crosswalk"
  3.     local outstub "../output"
  4.     local temp    "../temp"
  5. 
.     import_statenames, instub(`xwalk') outstub(`temp')
  6.     local fips = r(fips)
  7. 
.     fed_min_wage_change,   instub(`raw') outstub(`temp') 
  8.     add_state_to_fedmw,    fips(`fips')  outstub(`temp')
  9.     state_min_wage_change, instub(`raw') outstub(`temp') temp(`temp')
 10. 
.     prepare_finaldata, begindate(01may1974) finaldate(31Jan2020)           //
> /
>                        outstub(`temp') temp(`temp')
 11. 
.     local mw_list "fed_mw mw"
 12.     export_state_daily,     instub(`temp') outstub(`outstub') target_mw(`m
> w_list')
 13.     export_state_monthly,   instub(`temp') outstub(`outstub') target_mw(`m
> w_list')
 14.     export_state_quarterly, instub(`temp') outstub(`outstub') target_mw(`m
> w_list')
 15.     export_state_yearly,    instub(`temp') outstub(`outstub') target_mw(`m
> w_list')
 16. end

. 
. program import_statenames, rclass
  1.     syntax, instub(str) outstub(str)
  2. 
.     import excel using `instub'/state_name_fips_usps.xlsx, clear ///
>         firstrow
  3. 
.     rename (Name       FIPSStateNumericCode  OfficialUSPSCode)           ///
>            (statename  statefips             stateabb)
  4.     drop sname
  5. 
.     label var stateabb "State"
  6. 
.     save_data `outstub'/crosswalk.dta, replace key(statefips) log(none)
  7. 
.     levelsof statefips, local(fips)
  8.     return local fips "`fips'"
  9. end

. 
. program fed_min_wage_change
  1.     syntax, instub(str) outstub(str)
  2. 
.     import excel using `instub'/VZ_FederalMinimumWage_Changes.xlsx, clear fir
> strow
  3.     rename Fed_mw fed_mw
  4.     keep year month day fed_mw source
  5. 
.     gen date = mdy(month, day, year)
  6.     format date %td
  7. 
.     replace fed_mw = round(fed_mw, .01)
  8.     label var fed_mw "Federal Minimum Wage"
  9. 
.     order year month day date fed_mw source
 10. 
.     export delim using `outstub'/VZ_federal_changes.csv, replace
 11. end

. 
. program add_state_to_fedmw
  1.     syntax, fips(str) outstub(str)
  2.     
.     tsset date
  3.     tsfill
  4. 
.     carryforward year month day fed_mw, replace
  5. 
.     keep date fed_mw
  6. 
.     tempfile temp
  7.     save `temp'
  8.     
.     foreach i in `fips' {
  9.         use `temp', clear
 10.         gen statefips = `i'
 11.         tempfile state`i'
 12.         save `state`i''
 13.     }
 14.     foreach i in `fips' {
 15.         if `i' == 1 use `state`i'', clear
 16.         else quietly append using `state`i''
 17.     }
 18. 
.     compress
 19. 
.     save_data `outstub'/fedmw.dta, ///
>             replace key(date statefips) log(none)
 20. end

. 
. program state_min_wage_change
  1.     syntax, instub(str) outstub(str) temp(str)
  2. 
.     import excel using `instub'/VZ_StateMinimumWage_Changes.xlsx, clear first
> row
  3. 
.     gen date = mdy(month,day,year)
  4.     format date %td
  5. 
.     gen double mw = round(VZ_mw, .01)
  6.     gen double mw_healthinsurance = round(VZ_mw_healthinsurance, .01)
  7.     gen double mw_smallbusiness   = round(VZ_mw_smallbusiness, .01)
  8.     drop VZ_mw*
  9. 
.     merge m:1 statefips using `temp'/crosswalk.dta, nogen assert(3)
 10. 
.     order statefips statename stateabb year month day date mw* ///
>             source source_2 source_notes
 11.     label var statefips "State FIPS Code"
 12.     label var statename "State"
 13. 
.     sort stateabb date
 14.     
.     export delim using `outstub'/VZ_state_changes.csv, replace 
 15. 
.     tsset statefips date
 16.     tsfill
 17. 
.     keep statefips date mw* source_notes
 18. 
.     foreach x of varlist source_notes {
 19.         bysort statefips (date): replace `x' = `x'[_n-1] if `x' == ""
 20.     }
 21.     foreach x of varlist mw* {
 22.         bysort statefips (date): replace `x' = `x'[_n-1] if `x' == .
 23.     }
 24. end 

. 
. program prepare_finaldata    
  1.     syntax, begindate(str) finaldate(str) outstub(str) temp(str)
  2. 
.     merge 1:1 statefips date using `temp'/fedmw.dta, nogen
  3.     merge m:1 statefips using `temp'/crosswalk.dta, nogen assert(3)
  4. 
.     gen mw_adj = mw
  5.     replace mw_adj = fed_mw if fed_mw >= mw & fed_mw ~= .
  6.     replace mw_adj = fed_mw if mw == . & fed_mw ~= .
  7.     drop mw
  8.     rename mw_adj mw
  9. 
.     keep if date >= td(`begindate') & date <= td(`finaldate')
 10. 
.     order statefips statename stateabb date fed_mw mw
 11.     label var mw "State Minimum Wage"
 12.     notes mw: The mw variable represents the higher rate between the state
>  and federal minimum wage
 13. 
.     save_data `outstub'/data_state.dta, replace key(statefips date) log(none)
 14. end

. 
. program export_state_monthly
  1.     syntax, instub(str) outstub(str) target_mw(str)
  2. 
.     use `instub'/data_state.dta, clear
  3. 
.     keep statefips statename stateabb date `target_mw'
  4. 
.     gen monthly_date = mofd(date)
  5.     format monthly_date %tm
  6. 
.     collapse (max) `target_mw', by(statefips statename stateabb monthly_date)
  7. 
.     label var monthly_date "Monthly Date"
  8.     label_mw_vars, time_level("Monthly")
  9. 
.     save_data `outstub'/state_monthly.csv, key(statefips monthly_date) ///
>         outsheet replace
 10. end

. 
. program export_state_quarterly
  1.     syntax, instub(str) outstub(str) target_mw(str)
  2. 
.     use `instub'/data_state.dta, clear
  3. 
.     keep statefips statename stateabb date `target_mw'
  4. 
.     gen quarterly_date = qofd(date)
  5.     format quarterly_date %tq
  6. 
.     collapse (max) `target_mw', by(statefips statename stateabb quarterly_dat
> e)
  7. 
.     label var quarterly_date "Quarterly Date"
  8.     label_mw_vars, time_level("Quarterly")
  9. 
.     save_data `outstub'/state_quarterly.csv, key(statefips quarterly_date) //
> /
>         outsheet replace
 10. end

. 
. program export_state_yearly
  1.     syntax, instub(str) outstub(str) target_mw(str)
  2. 
.     use `instub'/data_state.dta, clear
  3. 
.     keep statefips statename stateabb date `target_mw'
  4. 
.     gen year = yofd(date)
  5.     format year %ty
  6. 
.     collapse (max) `target_mw', by(statefips statename stateabb year)
  7. 
.     label var year "Year"
  8.     label_mw_vars, time_level("Annual")
  9. 
.     save_data `outstub'/state_annual.csv, key(statefips year) ///
>         outsheet replace
 10. end

. 
. program export_state_daily
  1.     syntax, instub(str) outstub(str) target_mw(str)
  2. 
.     use `instub'/data_state.dta, clear
  3. 
.     keep statefips statename stateabb date `target_mw'
  4. 
.     save_data `outstub'/state_daily.csv, key(statefips date) ///
>         outsheet replace
  5. end

. 
. program label_mw_vars
  1.     syntax, time_level(str)
  2. 
.         cap label var fed_mw  "`time_level' Federal MW"
  3.         cap label var mw      "`time_level' State MW"   
  4.         cap label var mw_healthinsurance "`time_level' State MW Health and
>  Insurance"
  5.         cap label var mw_smallbusiness   "`time_level' State MW Small Busi
> ness"
  6. end

. 
. *EXECUTE
. main 
(data now sorted by statefips)
  (0 bytes saved)
===============================================================================
File: ../temp/crosswalk.dta
Key: statefips
===============================================================================
  51:3(102890):1997375568:263623840

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statefips |         51    28.96078    15.83283          1         56
   statename |          0
    stateabb |          0




(note: file ../temp/crosswalk.dta not found)
file ../temp/crosswalk.dta saved
1 2 4 5 6 8 9 10 11 12 13 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32
>  33 34 35 36 37 38 39 40 41 42 44 45 46 47 48 49 50 51 53 54 55 56
(3 real changes made)
(note: file ../temp/VZ_federal_changes.csv not found)
file ../temp/VZ_federal_changes.csv saved
        time variable:  date, 01may1974 to 31dec2020, but with gaps
                delta:  1 day
year:  (17,031 real changes made)
month:  (17,031 real changes made)
day:  (17,031 real changes made)
fed_mw:  (17,031 real changes made)
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000001.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000002.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000003.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000004.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000005.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000006.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000007.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000008.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000009.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000a.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000b.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000c.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000d.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000e.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000f.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000g.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000h.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000i.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000j.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000k.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000l.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000m.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000n.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000o.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000p.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000q.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000r.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000s.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000t.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000u.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000v.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000w.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00000x.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000010.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000011.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000012.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000013.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000014.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000015.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000016.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000017.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000018.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_000019.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00001a.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00001b.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00001c.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00001d.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00001e.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00001f.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00001g.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00001h.tmp saved
file C:\Users\diegog\AppData\Local\Temp\3\ST_6890_00001i.tmp saved
  variable date was float now int
  variable statefips was float now byte
  (4,346,985 bytes saved)
(data now sorted by date statefips)
  (0 bytes saved)
===============================================================================
File: ../temp/fedmw.dta
Key: date statefips
===============================================================================
  869397:3(96450):1130533771:3716020793

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        date |    869,397       13757    4921.048       5234      22280
   statefips |    869,397    28.96078    15.67684          1         56
      fed_mw |    869,397    4.831841     1.68357          2       7.25




(note: file ../temp/fedmw.dta not found)
file ../temp/fedmw.dta saved
(658 missing values generated)
(628 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               666  
    -----------------------------------------
(note: file ../temp/VZ_state_changes.csv not found)
file ../temp/VZ_state_changes.csv saved
       panel variable:  statefips (unbalanced)
        time variable:  date, 08feb1943 to 01jan2023, but with gaps
                delta:  1 day
(96,598 real changes made)
(573582 real changes made)
(5141 real changes made)
(28850 real changes made)

    Result                           # of obs.
    -----------------------------------------
    not matched                       427,297
        from master                    66,074  
        from using                    361,223  

    matched                           508,174  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           935,471  
    -----------------------------------------
(361,223 missing values generated)
(85,834 real changes made)
(361,223 real changes made)
(83,159 observations deleted)
(data now sorted by statefips date)
  variable date was float now int
  (1,704,624 bytes saved)
===============================================================================
File: ../temp/data_state.dta
Key: statefips date
===============================================================================
  852312:9(106708):3159219423:1815783777

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statefips |    852,312    28.96078    15.67684          1         56
        date |    852,312     13589.5    4824.342       5234      21945
   statename |          0
    stateabb |          0
      fed_mw |    852,312    4.783368     1.66483          2       7.25
-------------+---------------------------------------------------------
          mw |    852,312    5.060593    2.012467          2         14
mw_healthi~e |      4,813    6.868294    .7656977       5.15       10.3
mw_smallbu~s |     27,822    5.427126    1.649678          4         12
source_notes |          0




(note: file ../temp/data_state.dta not found)
file ../temp/data_state.dta saved
(data already sorted by statefips date)
  (0 bytes saved)
===============================================================================
File: ../output/state_daily.csv
Key: statefips date
===============================================================================
  852312:6(105292):575411115:2616799169

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statefips |    852,312    28.96078    15.67684          1         56
        date |    852,312     13589.5    4824.342       5234      21945
   statename |          0
    stateabb |          0
      fed_mw |    852,312    4.783368     1.66483          2       7.25
-------------+---------------------------------------------------------
          mw |    852,312    5.060593    2.012467          2         14




(note: file ../output/state_daily.csv not found)
(data now sorted by statefips monthly_date)
  variable monthly_date was float now int
  (55,998 bytes saved)
===============================================================================
File: ../output/state_monthly.csv
Key: statefips monthly_date
===============================================================================
  27999:6(88358):3331865866:3195017412

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statefips |     27,999    28.96078    15.67712          1         56
monthly_date |     27,999         446    158.4852        172        720
   statename |          0
    stateabb |          0
      fed_mw |     27,999    4.786248    1.667073          2       7.25
-------------+---------------------------------------------------------
          mw |     27,999    5.063642    2.016484          2         14




(note: file ../output/state_monthly.csv not found)
(data now sorted by statefips quarterly_date)
  variable quarterly_date was float now int
  (18,768 bytes saved)
===============================================================================
File: ../output/state_quarterly.csv
Key: statefips quarterly_date
===============================================================================
  9384:6(75918):2680524157:3198691344

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statefips |      9,384    28.96078    15.67767          1         56
quarterly_~e |      9,384       148.5    53.11827         57        240
   statename |          0
    stateabb |          0
      fed_mw |      9,384    4.791576    1.673538          2       7.25
-------------+---------------------------------------------------------
          mw |      9,384    5.074138    2.032655          2         14




(note: file ../output/state_quarterly.csv not found)
(data now sorted by statefips year)
  variable year was float now int
  (4,794 bytes saved)
===============================================================================
File: ../output/state_annual.csv
Key: statefips year
===============================================================================
  2397:6(71699):875877152:3872915462

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statefips |      2,397    28.96078    15.68011          1         56
        year |      2,397        1997    13.56749       1974       2020
   statename |          0
    stateabb |          0
      fed_mw |      2,397    4.855319    1.710565          2       7.25
-------------+---------------------------------------------------------
          mw |      2,397    5.153246    2.107144          2         14




(note: file ../output/state_annual.csv not found)

. 
end of do-file


Execute:  StataMP-64 /e do "./substate_mw.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./substate_mw.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main 
  1.         local raw     "../../../drive/raw_data/min_wage"
  2.     local xwalk   "../../../raw/crosswalk"
  3.         local outstub "../output"
  4.         local temp    "../temp"
  5. 
.         import_crosswalk, instub(`xwalk') outstub(`temp')
  6. 
.         substate_min_wage_change, instub(`raw') outstub(`temp') temp(`temp')
  7.         prepare_local, temp(`temp')
  8.         prepare_state, outstub(`outstub') temp(`temp') finaldate(31Jan2020
> )
  9.         
.         local mw_list = "mw mw_smallbusiness"
 10.         prepare_finaldata, temp(`temp') finaldate(31Jan2020) target_mw(`mw
> _list')
 11. 
.         export_substate_monthly,   outstub(`outstub') temp(`temp') target_mw(
> `mw_list')
 12.         export_substate_quarterly, outstub(`outstub') temp(`temp') target_
> mw(`mw_list')
 13.         export_substate_yearly,    outstub(`outstub') temp(`temp') target_
> mw(`mw_list')
 14. end

. 
. program import_crosswalk
  1.         syntax, instub(str) outstub(str)
  2.         import excel using `instub'/state_name_fips_usps.xlsx, clear first
> row 
  3.         
.         rename Name statename
  4.         rename FIPSStateNumericCode statefips
  5.         rename OfficialUSPSCode stateabb
  6.         replace stateabb = upper(stateabb)
  7.         label var stateabb "State Abbreviation"
  8.         
.         keep statename statefips stateabb
  9. 
.         save `outstub'/crosswalk.dta, replace
 10. end

. 
. program substate_min_wage_change
  1.         syntax, instub(str) outstub(str) temp(str)
  2. 
.         import excel using `instub'/VZ_SubstateMinimumWage_Changes.xlsx, clea
> r firstrow
  3. 
.         gen date = mdy(month,day,year)
  4.         format date %td
  5. 
.         gen double mw                 = round(VZ_mw, .01)
  6.         gen double mw_healthinsurance = round(VZ_mw_healthinsurance, .01)
  7.         gen double mw_macrobusiness   = round(VZ_mw_macrobusiness, .01)
  8.         gen double mw_mediumbusiness  = round(VZ_mw_mediumbusiness, .01)
  9.         gen double mw_smallbusiness   = round(VZ_mw_smallbusiness, .01)
 10.         gen double mw_smallbusiness_mincomp = round(VZ_mw_smallbusiness_mi
> ncompensat, .01)
 11.         gen double mw_hotel           = round(VZ_mw_hotel, .01)
 12.         gen double mw_nonprofit       = round(VZ_mw_nonprofit, .01)
 13.         gen double mw_tipped          = round(VZ_mw_tipped, .01)
 14.         drop VZ_mw*
 15. 
.         egen min_mw  = rowmin(mw-mw_tipped)
 16.         egen mean_mw = rowmean(mw-mw_tipped)
 17.         egen max_mw  = rowmax(mw-mw_tipped)
 18. 
.         merge m:1 statefips using `temp'/crosswalk.dta, nogen keep(3)
 19.         label var statefips "State FIPS Code"
 20.         label var statename "State"
 21.         label var stateabb "State Abbreviation"
 22.         label var locality "City/County"
 23.         label var mw "Minimum Wage"
 24.         order statefips statename stateabb locality year month day date mw
>  ///
>                 mw_* source source_2 source_notes
 25. 
.         export delim using `outstub'/VZ_substate_changes.csv, replace 
 26. end

. 
. program prepare_local
  1.         syntax, temp(str)
  2.         preserve
  3.                 egen tag = tag(statefips locality)
  4.                 keep if tag == 1
  5.                 keep statefips locality
  6. 
.                 save `temp'/localities.dta, replace
  7.         restore
  8. end

. 
. program prepare_state
  1.         syntax, outstub(str) temp(str) finaldate(str)
  2. 
.         sum year
  3.         local minyear = r(min)
  4. 
.         preserve        
  5.                 import delim `outstub'/state_daily.csv, clear 
  6. 
.                 gen date2 = date(date, "DMY")
  7.                 format date2 %td
  8.                 order date2, after(date)
  9.                 drop date 
 10.                 rename date2 date
 11. 
.                 keep if year(date) >= `minyear' & date <= td(`finaldate')
 12.                 joinby statefips using `temp'/localities.dta
 13.                 keep statefips statename stateabb locality date mw
 14. 
.                 rename mw state_mw
 15.                 save `temp'/statemw.dta, replace
 16.         restore
 17. end

. 
. program prepare_finaldata
  1.         syntax, temp(str) finaldate(str) target_mw(str)
  2.         
.         encode locality, gen(locality_temp)
  3. 
.         tsset locality_temp date
  4.         tsfill
  5. 
.         foreach x of varlist statename stateabb locality source_notes {
  6.           bysort locality_temp (date): replace `x' = `x'[_n-1] if `x' == "
> "
  7.         }
  8.         foreach x of varlist statefips mw* {
  9.           bysort locality_temp (date): replace `x' = `x'[_n-1] if `x' == .
 10.         }
 11. 
.         keep if date <= td(`finaldate')
 12. 
.         merge 1:m statefips locality date using "`temp'/statemw.dta", ///
>             assert(2 3) nogen
 13. 
.         replace mw = state_mw if mw == .
 14.         replace mw = round(mw,0.01)
 15.         gen abovestate_mw = mw > state_mw
 16.         label var abovestate_mw "Local `var' > State min wage"
 17. 
.         local mw "mw"
 18.         local new_target_mw: list target_mw - mw 
 19.         
.         foreach var in `new_target_mw' {
 20.                 replace `var' = mw if `var' == .
 21.                 replace `var' = round(`var', 0.01)
 22.                 gen abovestate_`var' = `var' > state_mw
 23.                 label var abovestate_`var' "Local `var' > State min wage" 
>               
 24.         }
 25. 
.         keep statefips statename stateabb date locality mw mw_* abovestate_* 
>  source_notes
 26.         order statefips statename stateabb date locality mw mw_* abovestat
> e_*   source_notes
 27.         notes mw: The mw variable represents the most applicable minimum w
> age across the locality.
 28. 
.         save_data `temp'/data_substate.dta, key(statefips locality date) repl
> ace log(none)
 29. end

. 
. program export_substate_monthly
  1.         syntax, outstub(str) temp(str) target_mw(str)
  2.         use `temp'/data_substate.dta, clear
  3. 
.         gen monthly_date = mofd(date)
  4.         format monthly_date %tm
  5. 
.         collapse (max) `target_mw' abovestate_*, ///
>             by(statefips statename stateabb locality monthly_date)
  6. 
.         label var monthly_date "Monthly Date"
  7.         label_mw_vars, time_level("Monthly")
  8. 
.         save_data `outstub'/substate_monthly.csv, key(locality monthly_date) 
> ///
>         outsheet replace
  9. end 

. 
. program export_substate_quarterly
  1.         syntax, outstub(str) temp(str) target_mw(str)
  2.         use `temp'/data_substate.dta, clear
  3. 
.         gen quarterly_date = qofd(date)
  4.         format quarterly_date %tq
  5. 
.         collapse (max) `target_mw' abovestate_*, ///
>             by(statefips statename stateabb locality quarterly_date)
  6. 
.         label var quarterly_date "Quarterly Date"
  7.         label_mw_vars, time_level("Quarterly")
  8. 
.         save_data `outstub'/substate_quarterly.csv, key(locality quarterly_da
> te) ///
>         outsheet replace
  9. end 

. 
. program export_substate_yearly
  1.         syntax, outstub(str) temp(str) target_mw(str)
  2.         use `temp'/data_substate.dta, clear
  3. 
.         gen year = yofd(date)
  4.         format year %ty
  5. 
.         collapse (max) `target_mw' abovestate_*, ///
>             by(statefips statename stateabb locality year)
  6. 
.         label var year "Year"
  7.         label_mw_vars, time_level("Annual")
  8. 
.         save_data `outstub'/substate_annual.csv, key(locality year) ///
>         outsheet replace
  9. end

. 
. program label_mw_vars
  1.         syntax, time_level(str)
  2. 
.         cap label var mw     "`time_level' MW"  
  3.         cap label var abovestate_mw "Local > State min wage"    
  4.         cap label var mw_healthinsurance "`time_level' State MW Health and
>  Insurance"
  5.         cap label var mw_smallbusiness   "`time_level' State MW Small Busi
> ness"
  6. end

. 
. * EXECUTE
. main 
(0 real changes made)
file ../temp/crosswalk.dta saved
(649 missing values generated)
(659 missing values generated)
(973 missing values generated)
(993 missing values generated)
(991 missing values generated)
(908 missing values generated)
(992 missing values generated)
(990 missing values generated)
(987 missing values generated)
(936 missing values generated)
(649 missing values generated)
(649 missing values generated)
(649 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                               349  
    -----------------------------------------
(note: file ../temp/VZ_substate_changes.csv not found)
file ../temp/VZ_substate_changes.csv saved
(286 observations deleted)
(note: file ../temp/localities.dta not found)
file ../temp/localities.dta saved

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        year |        349    2017.456    3.443535       2004       2024
(6 vars, 852,312 obs)
(552,687 observations deleted)
(note: file ../temp/statemw.dta not found)
file ../temp/statemw.dta saved
       panel variable:  locality_temp (unbalanced)
        time variable:  date, 01jan2004 to 01jul2024, but with gaps
                delta:  1 day
(104,050 real changes made)
(104,050 real changes made)
(104,050 real changes made)
(51,517 real changes made)
(104,050 real changes made)
(103878 real changes made)
(11029 real changes made)
(1273 real changes made)
(1821 real changes made)
(26502 real changes made)
(3192 real changes made)
(3646 real changes made)
(3277 real changes made)
(22903 real changes made)
(16,751 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                       282,477
        from master                         0  
        from using                    282,477  

    matched                            87,648  
    -----------------------------------------
(282,508 real changes made)
(52,037 real changes made)
(355,165 real changes made)
(0 real changes made)
(data now sorted by statefips locality date)
  variable date was float now int
  variable abovestate_mw was float now byte
  variable abovestate_mw_smallbusiness was float now byte
  variable mw_mediumbusiness was double now byte
  (5,551,875 bytes saved)
===============================================================================
File: ../temp/data_substate.dta
Key: statefips locality date
===============================================================================
  370125:17(32428):414941543:1479349743

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statefips |    370,125    15.42857    13.72604          4         53
    locality |          0
        date |    370,125       19008    1695.969      16071      21945
   statename |          0
    stateabb |          0
-------------+---------------------------------------------------------
          mw |    370,125     8.59149     2.19235       5.15      16.39
mw_healthi~e |      8,892    8.541565    2.654135       5.75         15
mw_macrobu~s |         31        12.5           0       12.5       12.5
mw_mediumb~s |         31          13           0         13         13
mw_smallbu~s |    370,125    8.551619    2.118944       5.15      16.34
-------------+---------------------------------------------------------
mw_smallbu~p |      1,767    13.14955    1.404958         11      15.75
    mw_hotel |      2,620    15.56565    1.010303      13.25      16.63
mw_nonprofit |      2,222    11.26232    1.179716         10      15.38
   mw_tipped |     21,594    4.182519    1.608279       2.13         10
abovestate~w |    370,125    .2397703    .4269438          0          1
-------------+---------------------------------------------------------
abovestate~s |    370,125    .2283553    .4197733          0          1
source_notes |          0




(note: file ../temp/data_substate.dta not found)
file ../temp/data_substate.dta saved
(data now sorted by locality monthly_date)
  variable monthly_date was float now int
  (24,318 bytes saved)
===============================================================================
File: ../output/substate_monthly.csv
Key: locality monthly_date
===============================================================================
  12159:9(81157):3325631152:3406239383

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    locality |          0
monthly_date |     12,159         624    55.71584        528        720
   statefips |     12,159    15.42857    13.72658          4         53
   statename |          0
    stateabb |          0
-------------+---------------------------------------------------------
          mw |     12,159    8.598928    2.201173       5.15      16.39
mw_smallbu~s |     12,159    8.559118    2.128255       5.15      16.34
abovestate~w |     12,159    .2422897    .4284863          0          1
abovestate~s |     12,159    .2308578     .421399          0          1




(note: file ../output/substate_monthly.csv not found)
(data now sorted by locality quarterly_date)
  variable quarterly_date was float now int
  (8,190 bytes saved)
===============================================================================
File: ../output/substate_quarterly.csv
Key: locality quarterly_date
===============================================================================
  4095:9(28147):2866820487:4096829633

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    locality |          0
quarterly_~e |      4,095         208    18.76395        176        240
   statefips |      4,095    15.42857     13.7277          4         53
   statename |          0
    stateabb |          0
-------------+---------------------------------------------------------
          mw |      4,095    8.651907    2.252699       5.15      16.39
mw_smallbu~s |      4,095    8.610281    2.177988       5.15      16.34
abovestate~w |      4,095    .2493284    .4326771          0          1
abovestate~s |      4,095     .237851    .4258194          0          1




(note: file ../output/substate_quarterly.csv not found)
(data now sorted by locality year)
  variable year was float now int
  (2,142 bytes saved)
===============================================================================
File: ../output/substate_annual.csv
Key: locality year
===============================================================================
  1071:9(67984):3568874211:1975764433

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    locality |          0
        year |      1,071        2012    4.901268       2004       2020
   statefips |      1,071    15.42857    13.73243          4         53
   statename |          0
    stateabb |          0
-------------+---------------------------------------------------------
          mw |      1,071     8.94225    2.479409       5.15      16.39
mw_smallbu~s |      1,071    8.891867    2.397945       5.15      16.34
abovestate~w |      1,071    .2959851    .4566975          0          1
abovestate~s |      1,071    .2857143     .451965          0          1




(note: file ../output/substate_annual.csv not found)

. 
end of do-file

 make.py ended: 2021-10-23 09:41:55
