
 make.py started: 2020-06-19 09:38:53 C:\Users\gabriel\Dropbox (Brown)\research\min_wage_rent\analysis\descriptive\code 




Execute:  StataMP-64 /e do "./desc_stats_general.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./desc_stats_general.do 

. set more off

. clear all

. adopath + ../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/gslab_misc/ado"

. adopath + ../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/gslab_misc/ado"
  [8]              "../../lib/stata/mental_coupons/ado"

. 
. 
. program main 
  1.         local instub  = "../../../drive/" 
  2.         local outstub = "../output/"
  3. 
.         us_stats, instub(`instub')
  4.         // baseline_rent_stats, instub(`instub')
.         // baseline_listing_stats, instub(`instub')
.         // baseline_yearmonth_stats, instub(`instub')
. 
.         *build_table
. end 

. 
. 
. program us_stats
  1.         syntax, instub(str)
  2. 
.         import delim `instub'/raw_data/census/tract/nhgis0041_csv/nhgis0041_d
> s239_20185_2018_tract.csv, clear
  3. 
.         g statefips = string(statea, "%02.0f")
  4.         g countyfips = string(countya, "%03.0f")
  5.         g tractfips = string(tracta, "%06.0f")
  6. 
.         g tract_fips = statefips + countyfips + tractfips
  7. 
.         rename (ajwme001 aj1se001 ajzae001) (pop housing_units med_hhinc)
  8. 
.         g housing_rent_sh = aj1ue003 / aj1ue001
  9. 
.         
.         order aj1ue003 aj1ue001, last
 10.         replace housing_rent_sh = 0 if aj1ue003 == 0 & aj1um001==0 
 11. 
.         keep tract_fips pop housing_units housing_rent_sh med_hhinc
 12. 
.         save ../temp/us_stats_tract.dta, replace
 13. 
.         import excel `instub'/raw_data/hud_Xwalks/TRACT_ZIP_122018.xlsx, firs
> trow clear
 14.         rename (tract zip) (tract_fips zipcode)
 15.         keep tract_fips zipcode tot_ratio
 16. 
. 
.         merge m:1 tract_fips using ../temp/us_stats_tract.dta, nogen assert(1
>  2 3) keep(1 3)
 17.         sort zipcode
 18. 
.         collapse (sum) pop housing_units (mean) med_hhinc housing_rent_sh [iw
>  = tot_ratio], by (zipcode)
 19. 
.         save ../temp/us_stats_zipcode.dta, replace
 20. 
.         destring zipcode, replace
 21.         collapse (sum) pop housing_units (mean) med_hhinc housing_rent_sh 
> (count) zipcode
 22. 
.         g pop_sh = 1
 23.         g housing_units_sh = 1
 24.         g zipcode_sh = 1
 25. 
.         order zipcode zipcode_sh pop pop_sh housing_units housing_units_sh me
> d_hhinc housing_rent_sh
 26.         save ../temp/us_panel_stats_zipcode.dta, replace
 27. 
.         keep pop housing_units zipcode
 28.         rename (pop housing_units zipcode) (USpop UShousing_units USzipcod
> e)
 29.         save ../temp/us_totals.dta, replace 
 30. 
. 
. end

. 
. program baseline_rent_stats
  1.         syntax, instub(str)
  2. 
.         use `instub'/derived_large/output/baseline_rent_panel.dta, clear
  3.         keep zipcode 
  4.         duplicates drop
  5.         g zip2 = string(zipcode, "%05.0f")
  6.         drop zipcode 
  7.         rename zip2 zipcode 
  8.         tempfile baseline_rent_zip 
  9.         save "`baseline_rent_zip'", replace 
 10. 
.         use ../temp/us_stats_zipcode.dta, clear 
 11. 
.         merge 1:1 zipcode using `baseline_rent_zip', nogen assert(1 2 3) keep
> (3)
 12. 
.         destring zipcode, replace
 13. 
.         collapse (sum) pop housing_units (mean) med_hhinc housing_rent_sh (co
> unt) zipcode
 14. 
.         merge 1:1 _n using ../temp/us_totals, nogen assert(1 2 3)
 15. 
.         g pop_sh = pop/USpop
 16.         g housing_units_sh = housing_units/UShousing_units
 17.         g zipcode_sh = zipcode/USzipcode
 18. 
.         drop USpop UShousing_units USzipcode
 19. 
.         order zipcode zipcode_sh pop pop_sh housing_units housing_units_sh me
> d_hhinc housing_rent_sh
 20. 
.         save ../temp/rent_panel_stats_zipcode.dta, replace 
 21. end 

. 
. 
. program baseline_listing_stats
  1.         syntax, instub(str)
  2. 
.         use `instub'/derived_large/output/baseline_listing_panel.dta, clear
  3.         keep zipcode 
  4.         duplicates drop
  5.         g zip2 = string(zipcode, "%05.0f")
  6.         drop zipcode 
  7.         rename zip2 zipcode 
  8.         tempfile baseline_listing_zip 
  9.         save "`baseline_listing_zip'", replace 
 10. 
.         use ../temp/us_stats_zipcode.dta, clear 
 11. 
.         merge 1:1 zipcode using `baseline_listing_zip', nogen assert(1 2 3) k
> eep(3)
 12. 
.         destring zipcode, replace
 13. 
.         collapse (sum) pop housing_units (mean) med_hhinc housing_rent_sh (co
> unt) zipcode
 14. 
.         merge 1:1 _n using ../temp/us_totals, nogen assert(1 2 3)
 15. 
.         g pop_sh = pop/USpop
 16.         g housing_units_sh = housing_units/UShousing_units
 17.         g zipcode_sh = zipcode/USzipcode
 18. 
.         drop USpop UShousing_units USzipcode
 19. 
.         order zipcode zipcode_sh pop pop_sh housing_units housing_units_sh me
> d_hhinc housing_rent_sh
 20. 
.         save ../temp/listing_panel_stats_zipcode.dta, replace 
 21. end 

. 
. 
. program baseline_yearmonth_stats
  1.         syntax, instub(str)
  2. 
.         use "../../../drive/derived_large/output/zipcode_yearmonth_panel_all.
> dta", clear
  3.         
.         keep if year_month == `=tm(2019m1)'
  4.         g zip2 = string(zipcode, "%05.0f")
  5.         drop zipcode 
  6.         rename zip2 zipcode 
  7.         tempfile baseline_yearmonth_zip 
  8.         save "`baseline_yearmonth_zip'", replace 
  9. 
.         use ../temp/us_stats_zipcode.dta, clear 
 10. 
.         merge 1:1 zipcode using `baseline_yearmonth_zip', nogen assert(1 2 3)
>  keep(1 3)
 11. 
.         destring zipcode, replace
 12. 
.         collapse (sum) pop housing_units (mean) med_hhinc housing_rent_sh (co
> unt) zipcode
 13. 
.         merge 1:1 _n using ../temp/us_totals, nogen assert(1 2 3)
 14. 
.         g pop_sh = pop/USpop
 15.         g housing_units_sh = housing_units/UShousing_units
 16.         g zipcode_sh = zipcode/USzipcode
 17. 
.         drop USpop UShousing_units USzipcode
 18. 
.         order zipcode zipcode_sh pop pop_sh housing_units housing_units_sh me
> d_hhinc housing_rent_sh
 19. 
.         save ../temp/yearmonth_panel_stats_zipcode.dta, replace 
 20. end 

. 
. 
. program build_table 
  1.         mat t = J(8, 4, .)
  2.         use ../temp/rent_panel_stats_zipcode.dta, clear
  3.         append using ../temp/listing_panel_stats_zipcode.dta
  4.         append using ../temp/yearmonth_panel_stats_zipcode.dta
  5.         append using ../temp/us_panel_stats_zipcode.dta
  6. 
.         format pop housing_units med_hhinc %20.0fc
  7. 
. 
.         forval x = 1/4 {
  8.                 mat t[1, `x'] = zipcode[`x']
  9.                 mat t[2, `x'] = round(zipcode_sh[`x'], .001) 
 10.                 mat t[3, `x'] = pop[`x']
 11.                 mat t[4, `x'] = round(pop_sh[`x'], .001)
 12.                 mat t[5, `x'] = housing_units[`x']
 13.                 mat t[6, `x'] = round(housing_units_sh[`x'], .001)
 14.                 mat t[7, `x'] = med_hhinc[`x']'
 15.                 mat t[8, `x'] = round(housing_rent_sh[`x'], .001)
 16.         }
 17. 
.         local rownames `" "zipcode" "(\%)" "population" "(\%)"  "housing unit
> s" "(\%)"  "median income"  "rent/income ratio" "'
 18.         mat rowname t = `rownames'
 19. 
.         local dsets_names = `" "Rent Panel" "Listing Panel" "Full Panel" "U.S
> ." "'
 20.         mat colname t = `dsets_names'
 21. 
. 
.         outtable using ../output/desc_stats.tex, mat(t) center replace 
 22. 
. 
. 
. 
. end

. 
. 
. 
. main 
(50 vars, 74,001 obs)
(887 missing values generated)
(0 real changes made)
(note: file ../temp/us_stats_tract.dta not found)
file ../temp/us_stats_tract.dta saved
file ../../../drive//raw_data/hud_Xwalks/TRACT_ZIP_122018.xlsx not found
r(601);

end of do-file
r(601);


Execute:  StataMP-64 /e do "./wage_rent_motivation.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./wage_rent_motivation.do 

. set more off

. clear all

. adopath + ../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/gslab_misc/ado"

. adopath + ../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/gslab_misc/ado"
  [8]              "../../lib/stata/mental_coupons/ado"

. set scheme s1color

. 
. 
. program main 
  1.         local instub  = "../../../drive/derived_large/output/" 
  2.         local outstub = "../output/"
  3. 
.         nMW_rent_corr, output(`outstub') instub(`instub') target_yr(2019) ///
>                                         target_qt(3) start_yr(2012) ///
>                                         target_vars("medrentpricepsqft_sfcc m
> edlistingpricepsqft_sfcc")
  4. 
. 
. end 

. 
. 
. 
. program nMW_rent_corr 
  1.         syntax, output(str) instub(str) target_yr(int) target_qt(int) star
> t_yr(int) target_vars(str)
  2. 
.         use `instub'county_quarter_panel_all.dta, clear 
  3.         egen county_id = group(countyfips)
  4.         xtset county_id year_quarter
  5. 
.         g year = year(dofq(year_quarter))
  6.         
. 
. 
.         preserve
  7.         bys county_id (year_quarter): egen tot_sal_mw_events = sum(sal_mw_
> event)
  8.         collapse (first) tot_sal_mw_events, by(county_id)
  9.         sum tot_sal_mw_events, det 
 10.         xtile ev_qtl = tot_sal_mw_events, n(2)
 11.         keep county_id ev_qtl
 12.         tempfile n_event_qt
 13.         save "`n_event_qt'", replace 
 14.         restore 
 15. 
.         merge m:1 county_id using `n_event_qt', assert(1 2 3) keep(1 3) nogen
>  
 16. 
.         collapse (mean) `target_vars' (first) ev_qtl, by(county_id year)
 17. 
.         winsor2 `target_vars', cuts(1 95) by(year)
 18. 
.         keep if year>=`start_yr'
 19.         
. 
.         collapse `target_vars', by(year ev_qtl)
 20. 
.         drop if missing(medrentpricepsqft_sfcc)
 21. 
. 
.         foreach var in `target_vars' {
 22.                 bys ev_qtl (year): gen start_`var' = `var'[1]
 23.                 replace `var' = `var' / start_`var'
 24.         }
 25. 
.         twoway (connected medrentpricepsqft_sfcc year if ev_qtl==1) ///
>                    (connected medrentpricepsqft_sfcc year if ev_qtl==2), ///
>                    legend(order(1 "less than 5 MW changes" 2 "more than 5 MW 
> changes"))
 26.               
. end 

. 
. 
. 
. 
. 
. main
       panel variable:  county_id (unbalanced)
        time variable:  year_quarter, 1996q2 to 2019q4
                delta:  1 quarter

                  (first) tot_sal_mw_events
-------------------------------------------------------------
      Percentiles      Smallest
 1%            3              1
 5%            3              1
10%            3              1       Obs               2,977
25%            4              2       Sum of Wgt.       2,977

50%            5                      Mean           5.255291
                        Largest       Std. Dev.      1.736312
75%            5             13
90%            7             14       Variance       3.014778
95%            8             19       Skewness       2.024398
99%           12             21       Kurtosis       10.31525
(note: file C:\Users\gabriel\AppData\Local\Temp\ST_95e0_000002.tmp not found)
file C:\Users\gabriel\AppData\Local\Temp\ST_95e0_000002.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           281,526  
    -----------------------------------------
(47,304 observations deleted)
(0 observations deleted)
(16 real changes made)
(16 real changes made)

. 
end of do-file

 make.py ended: 2020-06-19 09:39:08
