
 make.py started: 2021-10-23 08:25:26 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\zipcode_sqft_measure\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000


. 
. program main
  1.         local instub "../../../drive/derived_large/zipcode_month"
  2. 
.         use zipcode year month medlistingprice_SFCC ///
>             medlistingpricepsqft_SFCC medrentprice_SFCC medrentpricepsqft_SFC
> C ///
>                 using "`instub'/zipcode_month_panel.dta", clear
  3.         
.     keep if year == 2019
  4.         collapse (mean) medlistingprice_SFCC medlistingpricepsqft_SFCC ///
>             medrentprice_SFCC medrentpricepsqft_SFCC, by(zipcode)
  5.                 
.     gen sqft_from_listings = medlistingprice_SFCC/medlistingpricepsqft_SFCC
  6.     gen sqft_from_rents    = medrentprice_SFCC/medrentpricepsqft_SFCC
  7.         
.         scatter sqft_from_listings sqft_from_rents if sqft_from_rents <= 1000
> 0, ///
>             graphregion(color(white)) bgcolor(white)
  8.         graph export "../output/sqft_rents_vs_listings.png", replace
  9.         
.         histogram sqft_from_listings, ///
>             graphregion(color(white)) bgcolor(white)
 10.         graph export "../output/histogram_sqft_listings.png", replace
 11.         
.         histogram sqft_from_rents if sqft_from_rents <= 10000, ///
>             graphregion(color(white)) bgcolor(white)
 12.         graph export "../output/histogram_sqft_rents.png", replace
 13.         
.         keep zipcode sqft_from_listings sqft_from_rents
 14.         
.         save_data "../output/housing_sqft_per_zipcode.dta", key(zipcode) repl
> ace
 15. end

. 
. main
(4,372,704 observations deleted)
(30,663 missing values generated)
(37,389 missing values generated)
(note: file ../output/sqft_rents_vs_listings.png not found)
(file ../output/sqft_rents_vs_listings.png written in PNG format)
(bin=39, start=192.76872, width=156.8251)
(note: file ../output/histogram_sqft_listings.png not found)
(file ../output/histogram_sqft_listings.png written in PNG format)
(bin=34, start=209.50357, width=106.76203)
(note: file ../output/histogram_sqft_rents.png not found)
(file ../output/histogram_sqft_rents.png written in PNG format)
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/housing_sqft_per_zipcode.dta
Key: zipcode
===============================================================================
  40488:3(73258):1937007222:2748334303

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
sqft_from~gs |      9,825    1790.649     481.809   192.7687   6308.948
sqft_from~ts |      3,099    1439.971    429.7467   209.5036   12119.38




(note: file ../output/housing_sqft_per_zipcode.dta not found)
file ../output/housing_sqft_per_zipcode.dta saved

. 
end of do-file

 make.py ended: 2021-10-23 08:25:34
