
 make.py started: 2021-10-25 07:33:33 C:\Users\diegog\Desktop\Diego\min_wage_rent\derived\zipcode_sqft_measure\code 




Execute:  StataMP-64 /e do "./build_sqft.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build_sqft.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000


. 
. program main
  1.         local instub "../../../drive/derived_large/zipcode_month"
  2. 
.         use zipcode year month medlistingprice_SFCC ///
>             medlistingpricepsqft_SFCC medrentprice_SFCC medrentpricepsqft_SFC
> C ///
>                 using "`instub'/zipcode_month_panel.dta", clear
  3.         
.     keep if year == 2019
  4.         collapse (mean) medlistingprice_SFCC medlistingpricepsqft_SFCC ///
>             medrentprice_SFCC medrentpricepsqft_SFCC, by(zipcode)
  5.                 
.     gen sqft_from_listings = medlistingprice_SFCC/medlistingpricepsqft_SFCC
  6.     gen sqft_from_rents    = medrentprice_SFCC/medrentpricepsqft_SFCC
  7.         
.         scatter sqft_from_listings sqft_from_rents if sqft_from_rents <= 1000
> 0, ///
>             graphregion(color(white)) bgcolor(white)
  8.         graph export "../output/sqft_rents_vs_listings.png", replace
  9.         
.         histogram sqft_from_listings, ///
>             graphregion(color(white)) bgcolor(white)
 10.         graph export "../output/histogram_sqft_listings.png", replace
 11.         
.         histogram sqft_from_rents if sqft_from_rents <= 10000, ///
>             graphregion(color(white)) bgcolor(white)
 12.         graph export "../output/histogram_sqft_rents.png", replace
 13.         
.         keep zipcode sqft_from_listings sqft_from_rents
 14.         
.         save_data "../output/housing_sqft_per_zipcode.dta", key(zipcode) repl
> ace
 15. end

. 
. main
(4,413,083 observations deleted)
(30,662 missing values generated)
(37,388 missing values generated)
(note: file ../output/sqft_rents_vs_listings.png not found)
(file ../output/sqft_rents_vs_listings.png written in PNG format)
(bin=39, start=192.76872, width=156.8251)
(note: file ../output/histogram_sqft_listings.png not found)
(file ../output/histogram_sqft_listings.png written in PNG format)
(bin=34, start=209.50357, width=106.76203)
(note: file ../output/histogram_sqft_rents.png not found)
(file ../output/histogram_sqft_rents.png written in PNG format)
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/housing_sqft_per_zipcode.dta
Key: zipcode
===============================================================================
  40487:3(73258):2471923641:3244967932

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
sqft_from~gs |      9,825    1790.649     481.809   192.7687   6308.948
sqft_from~ts |      3,099    1439.971    429.7467   209.5036   12119.38




(note: file ../output/housing_sqft_per_zipcode.dta not found)
file ../output/housing_sqft_per_zipcode.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./predict_sqft.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./predict_sqft.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000


. 
. program main
  1.         local instub "../../../base/geo_master/output"
  2. 
.         use "`instub'/zip_county_place_usps_master.dta", clear
  3.         drop place_name county_name cbsa10_name state_abb 
  4.         merge 1:1 zipcode using "../output/housing_sqft_per_zipcode.dta", 
> ///
>             nogen assert(3)
  5.                 
.         local covariates "area_sqmi pop2020_esri houses_zcta_place_county"
  6.         local absorb "place_code countyfips cbsa10 statefips zipcode_type"
  7.         
.         reghdfe sqft_from_rents `covariates', absorb(`absorb')
  8.         predict p_sqft_from_rents, xb
  9.         gen imp_sqft_from_rents = sqft_from_rents
 10.         replace imp_sqft_from_rents = p_sqft_from_rents if missing(imp_sqf
> t_from_rents)
 11.         
.         reghdfe sqft_from_listings `covariates', absorb(`absorb')
 12.         predict p_sqft_from_listings, xb
 13.         gen imp_sqft_from_listings = sqft_from_rents
 14.         replace imp_sqft_from_listings = p_sqft_from_listings if missing(i
> mp_sqft_from_listings)
 15.         
.         keep zipcode zcta sqft_from_rents sqft_from_listings ///
>             p_sqft_from_rents p_sqft_from_listings ///
>                 imp_sqft_from_rents imp_sqft_from_listings
 16.         save_data "../output/sqft_data_with_predictions.dta", ///
>             key(zipcode) replace
 17.         export delimited "../output/sqft_data_with_predictions.csv", repla
> ce
 18. end

. 
. main

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            40,487  
    -----------------------------------------
(dropped 1029 singleton observations)
(MWFE estimator converged in 50 iterations)

HDFE Linear regression                            Number of obs   =      2,070
Absorbing 5 HDFE groups                           F(   3,   1549) =      14.88
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.6488
                                                  Adj R-squared   =     0.5308
                                                  Within R-sq.    =     0.0280
                                                  Root MSE        =   239.5701

------------------------------------------------------------------------------
sqft_from~ts |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   area_sqmi |   .5423903   .1339825     4.05   0.000     .2795841    .8051966
pop2020_esri |    .002151   .0005425     3.96   0.000     .0010868    .0032151
houses_zct~y |  -.0065206   .0014205    -4.59   0.000     -.009307   -.0037343
       _cons |   1384.373   16.98629    81.50   0.000     1351.055    1417.692
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   place_code |       315           0         315     |
   countyfips |       255          52         203     |
       cbsa10 |       152         152           0    ?|
    statefips |        44          44           0    ?|
 zipcode_type |         1           1           0    ?|
------------------------------------------------------+
? = number of redundant parameters may be higher
(8,907 missing values generated)
(37,388 missing values generated)
(28,481 real changes made)
(dropped 3743 singleton observations)
(MWFE estimator converged in 41 iterations)

HDFE Linear regression                            Number of obs   =      6,079
Absorbing 5 HDFE groups                           F(   3,   4556) =      39.11
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.5360
                                                  Adj R-squared   =     0.3809
                                                  Within R-sq.    =     0.0251
                                                  Root MSE        =   388.2437

------------------------------------------------------------------------------
sqft_from~gs |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   area_sqmi |    .170599   .0707158     2.41   0.016     .0319617    .3092362
pop2020_esri |  -.0025463   .0005372    -4.74   0.000    -.0035995   -.0014931
houses_zct~y |  -.0065262   .0015912    -4.10   0.000    -.0096457   -.0034068
       _cons |   1912.602   13.03926   146.68   0.000     1887.039    1938.165
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
   place_code |       767           0         767     |
   countyfips |       797          45         752     |
       cbsa10 |       416         416           0    ?|
    statefips |        51          51           0    ?|
 zipcode_type |         2           1           1    ?|
------------------------------------------------------+
? = number of redundant parameters may be higher
(8,907 missing values generated)
(37,388 missing values generated)
(28,481 real changes made)
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/sqft_data_with_predictions.dta
Key: zipcode
===============================================================================
  40487:8(53311):3933973841:2752986687

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
        zcta |          0
sqft_from~gs |      9,825    1790.649     481.809   192.7687   6308.948
sqft_from~ts |      3,099    1439.971    429.7467   209.5036   12119.38
p_sqft_fr~ts |     31,580    1445.271     205.596   1142.325   12394.61
-------------+---------------------------------------------------------
imp_sqft_~ts |     31,580    1447.251    244.5116   209.5036   12394.61
p_sqft_fr~gs |     31,580    1884.705    94.28255   1356.194    5354.84
imp_sqft_~gs |     31,580     1853.92    207.9396   209.5036   12119.38




(note: file ../output/sqft_data_with_predictions.dta not found)
file ../output/sqft_data_with_predictions.dta saved
(note: file ../output/sqft_data_with_predictions.csv not found)
file ../output/sqft_data_with_predictions.csv saved

. 
end of do-file

 make.py ended: 2021-10-25 07:34:07
