
 make.py started: 2023-04-17 14:39:12 C:\Users\diegog\Desktop\Diego\min_wage_rent\base\zip_biz_patterns\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local instub  "../temp"
  2.     local outstub "../../../drive/base_large/zip_biz_patterns"
  3.     local logfile "../output/data_file_manifest.log"
  4. 
.     * Zip files
.     foreach y in "09" "10" "11" "12" "13" "14" "15" "16" "17" "18" "19" "20" 
> {
  5.         read_total_file, instub(`instub') yr(`y')
  6.     }
  7.     use "../temp/zbp_totals_09.dta", clear
  8.     foreach y in "10" "11" "12" "13" "14" "15" "16" "17" "18" "19" "20" {
  9.         append using "../temp/zbp_totals_`y'.dta"
 10.     }
 11.     save_data "`outstub'/zbp_totals.dta", key(zipcode year) ///
>         log(`logfile') replace
 12.     export delimited "`outstub'/zbp_totals.csv", replace
 13. 
.     * Zip by industry files
.     foreach y in "09" "10" "11" "12" "13" "14" "15" "16" "17" "18" "19" "20" 
> {
 14.         read_detail_file, instub(`instub') yr(`y')
 15.     }
 16.     use "../temp/zbp_detail_09.dta", clear
 17.     foreach y in "10" "11" "12" "13" "14" "15" "16" "17" "18" "19" "20" {
 18.         append using "../temp/zbp_detail_`y'.dta"
 19.     }
 20.     save_data "`outstub'/zbp_by_naics.dta", key(zipcode naics6 year) ///
>         log(`logfile') replace
 21.     export delimited "`outstub'/zbp_by_naics.csv", replace
 22. end

. 
. program read_total_file
  1.     syntax, instub(str) yr(str)
  2. 
.     import delimited "`instub'/zbp`yr'totals.txt", clear ///
>         stringcols(1 2)
  3. 
.     cap keep zip name empflag emp ap est
  4.     cap keep zip name emp ap est
  5. 
.     rename (zip     name    emp           ap                   est) ///
>            (zipcode zipname nbr_employees total_annual_payroll nbr_estab)
  6. 
.     cap replace nbr_employees = . if !missing(empflag)
  7.     cap replace total_annual_payroll = . if !missing(empflag)
  8.     cap drop empflag
  9. 
.     gen year = int(`yr') + 2000
 10. 
.     create_variables
 11. 
.     save "../temp/zbp_totals_`yr'.dta", replace
 12.     clear
 13. end

. 
. program read_detail_file
  1.     syntax, instub(str) yr(str)
  2. 
.     import delimited "`instub'/zbp`yr'detail.txt", clear ///
>         stringcols(1 2)
  3. 
.     cap keep zip naics est n1_4 n5_9 n10_19 n20_49 n50_99 n100_249 n250_499 n
> 500_999 n1000
  4.     cap keep zip naics est n5 n5_9 n10_19 n20_49 n50_99 n100_249 n250_499 
> n500_999 n1000
  5. 
.     rename (zip     naics  est) ///
>            (zipcode naics6 nbr_estab)
  6. 
.     drop if naics6 == "------"
  7. 
.     cap rename (n1_4 n5_9 n10_19 n20_49 n50_99 n100_249 n250_499 n500_999 n10
> 00) ///
>         (nbr_estab1_4 nbr_estab5_9 nbr_estab10_19 ///
>         nbr_estab20_49 nbr_estab50_99 nbr_estab100_249 ///
>         nbr_estab250_499 nbr_estab500_999 nbr_estab1000)
  8.     cap rename (n5 n5_9 n10_19 n20_49 n50_99 n100_249 n250_499 n500_999 n1
> 000) ///
>         (nbr_estab1_4 nbr_estab5_9 nbr_estab10_19 ///
>          nbr_estab20_49 nbr_estab50_99 nbr_estab100_249 ///
>          nbr_estab250_499 nbr_estab500_999 nbr_estab1000)
  9. 
.     foreach size in "1_4" "5_9" "10_19" "20_49" "50_99" "100_249" "250_499" "
> 500_999" "1000" {
 10.         cap destring nbr_estab`size', replace force
 11.     }
 12. 
.     gen year = int(`yr') + 2000
 13. 
.     save "../temp/zbp_detail_`yr'.dta", replace
 14.     clear
 15. end

. 
. program create_variables
  1.     gen avg_nbr_emp_per_est = nbr_employees/nbr_estab
  2.     gen avg_payroll_per_emp  = 1000*total_annual_payroll/nbr_employees
  3. end

. 
. * Execute
. main
(10 vars, 39,174 obs)
(9,205 missing values generated)
(note: file ../temp/zbp_totals_09.dta not found)
file ../temp/zbp_totals_09.dta saved
(13 vars, 39,104 obs)
(9,169 missing values generated)
(note: file ../temp/zbp_totals_10.dta not found)
file ../temp/zbp_totals_10.dta saved
(13 vars, 39,032 obs)
(9,266 missing values generated)
(note: file ../temp/zbp_totals_11.dta not found)
file ../temp/zbp_totals_11.dta saved
(13 vars, 38,818 obs)
(12,618 missing values generated)
(note: file ../temp/zbp_totals_12.dta not found)
file ../temp/zbp_totals_12.dta saved
(13 vars, 38,804 obs)
(12,678 missing values generated)
(note: file ../temp/zbp_totals_13.dta not found)
file ../temp/zbp_totals_13.dta saved
(13 vars, 38,792 obs)
(12,676 missing values generated)
(note: file ../temp/zbp_totals_14.dta not found)
file ../temp/zbp_totals_14.dta saved
(13 vars, 38,748 obs)
(4,981 missing values generated)
(note: file ../temp/zbp_totals_15.dta not found)
file ../temp/zbp_totals_15.dta saved
(13 vars, 38,722 obs)
(4,990 missing values generated)
(note: file ../temp/zbp_totals_16.dta not found)
file ../temp/zbp_totals_16.dta saved
(13 vars, 35,279 obs)
(1,624 missing values generated)
(note: file ../temp/zbp_totals_17.dta not found)
file ../temp/zbp_totals_17.dta saved
(12 vars, 35,244 obs)
(5 missing values generated)
(note: file ../temp/zbp_totals_18.dta not found)
file ../temp/zbp_totals_18.dta saved
(12 vars, 35,129 obs)
(3 missing values generated)
(note: file ../temp/zbp_totals_19.dta not found)
file ../temp/zbp_totals_19.dta saved
(12 vars, 35,053 obs)
(3 missing values generated)
(note: file ../temp/zbp_totals_20.dta not found)
file ../temp/zbp_totals_20.dta saved
(note: variable nbr_estab was int, now long to accommodate using data's
       values)
(data now sorted by zipcode year)
  variable year was float now int
  (903,798 bytes saved)
===============================================================================
File: ../../../drive/base_large/zip_biz_patterns/zbp_totals.dta
Key: zipcode year
===============================================================================
  451899:8(22618):1031363698:2534954135

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
        year |    451,899    2014.361    3.426814       2009       2020
     zipname |          0
nbr_employ~s |    451,899    3196.162    23887.51          0    6476624
total_annu~l |    451,899      158741     1327663          0   3.82e+08
-------------+---------------------------------------------------------
   nbr_estab |    451,899     203.146    398.4413          1      33466
avg_nbr_em~t |    451,899    10.75558    28.00287          0       3618
avg_payrol~p |    374,681    38555.28    20358.79    1224.49    3084692




file ../../../drive/base_large/zip_biz_patterns/zbp_totals.dta saved
file ../../../drive/base_large/zip_biz_patterns/zbp_totals.csv saved
(12 vars, 3,238,421 obs)
(39,174 observations deleted)
(note: file ../temp/zbp_detail_09.dta not found)
file ../temp/zbp_detail_09.dta saved
(12 vars, 3,219,077 obs)
(39,104 observations deleted)
(note: file ../temp/zbp_detail_10.dta not found)
file ../temp/zbp_detail_10.dta saved
(12 vars, 3,196,767 obs)
(39,032 observations deleted)
(note: file ../temp/zbp_detail_11.dta not found)
file ../temp/zbp_detail_11.dta saved
(12 vars, 8,380,408 obs)
(38,818 observations deleted)
(note: file ../temp/zbp_detail_12.dta not found)
file ../temp/zbp_detail_12.dta saved
(12 vars, 8,371,007 obs)
(38,804 observations deleted)
(note: file ../temp/zbp_detail_13.dta not found)
file ../temp/zbp_detail_13.dta saved
(12 vars, 8,377,070 obs)
(38,792 observations deleted)
(note: file ../temp/zbp_detail_14.dta not found)
file ../temp/zbp_detail_14.dta saved
(12 vars, 8,403,660 obs)
(38,748 observations deleted)
(note: file ../temp/zbp_detail_15.dta not found)
file ../temp/zbp_detail_15.dta saved
(12 vars, 8,418,283 obs)
(38,722 observations deleted)
(note: file ../temp/zbp_detail_16.dta not found)
file ../temp/zbp_detail_16.dta saved
(12 vars, 2,870,579 obs)
(35,279 observations deleted)
(note: file ../temp/zbp_detail_17.dta not found)
file ../temp/zbp_detail_17.dta saved
(12 vars, 2,874,446 obs)
(35,244 observations deleted)
(note: file ../temp/zbp_detail_18.dta not found)
file ../temp/zbp_detail_18.dta saved
(16 vars, 2,881,311 obs)
(35,129 observations deleted)
(note: file ../temp/zbp_detail_19.dta not found)
file ../temp/zbp_detail_19.dta saved
(16 vars, 2,886,438 obs)
(35,053 observations deleted)
(note: file ../temp/zbp_detail_20.dta not found)
file ../temp/zbp_detail_20.dta saved
(note: variable nbr_estab was int, now long to accommodate using data's
       values)
(data now sorted by zipcode naics6 year)
  variable year was float now int
  variable nbr_estab was long now int
  (250,662,272 bytes saved)
===============================================================================
File: ../../../drive/base_large/zip_biz_patterns/zbp_by_naics.dta
Key: zipcode naics6 year
===============================================================================
  62665568:13(85703):273812617:1563782010

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
      naics6 |          0
        year | 62,665,568    2014.209    2.781605       2009       2020
   nbr_estab | 62,665,568    5.812984     17.0127          1       7480
nbr_estab1_4 | 58,090,501    3.319817    10.26656          0       4598
-------------+---------------------------------------------------------
nbr_estab5_9 | 53,822,770    1.120945    3.403735          0        994
nbr_estab~19 | 52,978,331    .7696041    2.646109          0        690
nbr_esta~_49 | 52,414,345    .5413985    2.308388          0        716
nbr_esta~_99 | 51,638,639    .1698724    .9310895          0        326
nbr_esta~249 | 51,459,064    .0908212    .6123328          0        420
-------------+---------------------------------------------------------
nbr_esta~499 | 51,314,643    .0214189    .3848907          0        563
nbr_esta~999 | 51,298,722    .0079052    .4852982          0        750
nbr_est~1000 | 51,296,703    .0049695    .6263983          0        906




file ../../../drive/base_large/zip_biz_patterns/zbp_by_naics.dta saved
file ../../../drive/base_large/zip_biz_patterns/zbp_by_naics.csv saved

. 
end of do-file

 make.py ended: 2023-04-18 05:22:37
