
 make.py started: 2022-02-16 18:31:21 C:\Users\shermo\Documents\GitHub\min_wage_rent\base\geo_master\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local xwalk_dir  "../../../raw/crosswalk"
  2.     local zillow_dir "../../../drive/base_large/zillow"
  3.     local shape_dir  "../../../drive/raw_data/shapefiles/USPS_zipcodes"
  4.     local output     "../output"
  5.     
.     build_geomaster_large, instub(`xwalk_dir') ///
>             in_shape(`shape_dir') outstub(`output')
  6.     build_geomaster_small, instub(`xwalk_dir') ///
>             outstub(`output')
  7. end

. 
. program build_geomaster_large
  1.     syntax, instub(str) in_shape(str) outstub(str)
  2.         
.         import dbase "`in_shape'/USPS_zipcodes_July2020.dbf", clear
  3.     rename (ZIP_CODE PO_NAME STATE POPULATION SQMI) ///
>             (zipcode zipcode_name statefips pop2020_esri area_sqmi)
  4.         keep zipcode pop2020_esri area_sqmi
  5.         save_data "../temp/usps_shape.dta", key(zipcode) replace log(none)
  6. 
.     import excel "`instub'/zip_to_zcta_2019.xlsx", ///
>         sheet("ZiptoZCTA_crosswalk") firstrow allstring clear
  7.     rename (ZIP_CODE ZCTA PO_NAME) (zipcode zcta zipcode_name)
  8.     drop if zipcode == "96898" & zcta == "No ZCTA"
  9.     keep zipcode zcta zipcode_name
 10.     save_data "../temp/usps_master.dta", key(zipcode) replace log(none)
 11.     
.     import delimited "`instub'/geocorr2018.csv", ///
>         varnames(1) stringcols(1 2 3 4 5) clear
 12. 
.     drop metdiv10 mdivname10 afact
 13.     rename (zcta5      county       placefp     state)                  //
> /
>            (zcta       countyfips   place_code  statefips)
 14.     rename (zipname    cntyname     placenm     cbsaname10   stab)      //
> /
>            (zcta_name  county_name  place_name  cbsa10_name  state_abb)
 15.     rename hus10 houses_zcta_place_county
 16. 
.     gen rural = place_code == "99999"
 17. 
.     merge m:m zcta using "../temp/usps_master.dta", nogen keep(3)
 18. 
.     * Make sure zipcode-county-place combinations are unique
.     isid zipcode place_code countyfips
 19. 
.     local keep_vars ///
>         zipcode     place_code   countyfips   cbsa10     zcta       ///
>         place_name  county_name  cbsa10_name  state_abb  statefips  ///
>         houses_zcta_place_county rural
 20. 
.     keep  `keep_vars'
 21.     order `keep_vars'
 22.         
.         merge m:1 zipcode using "../temp/usps_master.dta", nogen keep(1 3)
 23.         
.         replace place_code = "47766" if zipcode == "95035" /* Manual fix for 
> Milpitas*/
 24.         
.         save_data "`outstub'/zip_county_place_usps_all.dta", ///
>         key(zipcode countyfips place_code) replace
 25.     export delimited "`outstub'/zip_county_place_usps_all.csv", replace
 26.         
.     gen   neg_houses = -houses_zcta_place_county
 27.     bys   zipcode (neg_houses): keep if _n == 1
 28.     drop  neg_houses            
 29.         
.     save_data "`outstub'/zip_county_place_usps_master.dta", ///
>         key(zipcode) replace
 30.     export delimited "`outstub'/zip_county_place_usps_master.csv", replace
 31. end

. 
. program build_geomaster_small
  1.     syntax, instub(str) outstub(str)
  2. 
.     import excel "`instub'/TRACT_ZIP_122019.xlsx", ///
>         firstrow clear
  3. 
.     drop BUS_RATIO OTH_RATIO TOT_RATIO    
  4. 
.     rename (TRACT ZIP RES_RATIO) (tract_fips zipcode res_ratio)
  5. 
.     save_data "`outstub'/tract_zip_master.dta", ///
>         key(tract_fips zipcode) replace
  6.     save_data "`outstub'/tract_zip_master.csv", outsheet ///
>         key(tract_fips zipcode) replace 
  7. end

. 
. *EXECUTE
. main 
(9 vars, 31,985 obs)
(data now sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../temp/usps_shape.dta
Key: zipcode
===============================================================================
  31985:3(47856):2632292210:254409311

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
pop2020_esri |     31,985    10428.53    15079.92          0     133324
   area_sqmi |     31,985    112.7203    765.6261          0   95698.64




(note: file ../temp/usps_shape.dta not found)
file ../temp/usps_shape.dta saved
(1 observation deleted)
(data now sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../temp/usps_master.dta
Key: zipcode
===============================================================================
  41106:3(76453):4239886574:3006094094

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
zipcode_name |          0
        zcta |          0




(note: file ../temp/usps_master.dta not found)
file ../temp/usps_master.dta saved
(14 vars, 84,977 obs)
(note: variable zcta was str5, now str7 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            87,799  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            87,799  
    -----------------------------------------
(1 real change made)
(data now sorted by zipcode countyfips place_code)
  variable rural was float now byte
  variable zcta was str7 now str5
  variable zipcode_name was str57 now str26
  (3,160,764 bytes saved)
===============================================================================
File: ../output/zip_county_place_usps_all.dta
Key: zipcode countyfips place_code
===============================================================================
  87799:13(64378):3252530079:3044680579

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
  place_code |          0
      cbsa10 |          0
        zcta |          0
-------------+---------------------------------------------------------
  place_name |          0
 county_name |          0
 cbsa10_name |          0
   state_abb |          0
   statefips |          0
-------------+---------------------------------------------------------
houses_zct~y |     87,799    1796.605    3756.885          1      47617
       rural |     87,799     .443513    .4968018          0          1
zipcode_name |          0




(note: file ../output/zip_county_place_usps_all.dta not found)
file ../output/zip_county_place_usps_all.dta saved
(note: file ../output/zip_county_place_usps_all.csv not found)
file ../output/zip_county_place_usps_all.csv saved
(47,311 observations deleted)
(data already sorted by zipcode)
  variable rural was float now byte
  variable zcta was str7 now str5
  variable zipcode_name was str57 now str26
  (1,457,568 bytes saved)
===============================================================================
File: ../output/zip_county_place_usps_master.dta
Key: zipcode
===============================================================================
  40488:13(64378):3596658418:1014299020

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  place_code |          0
  countyfips |          0
      cbsa10 |          0
        zcta |          0
-------------+---------------------------------------------------------
  place_name |          0
 county_name |          0
 cbsa10_name |          0
   state_abb |          0
   statefips |          0
-------------+---------------------------------------------------------
houses_zct~y |     40,488    3314.308      5032.1          1      47617
       rural |     40,488     .444675    .4969359          0          1
zipcode_name |          0




(note: file ../output/zip_county_place_usps_master.dta not found)
file ../output/zip_county_place_usps_master.dta saved
(note: file ../output/zip_county_place_usps_master.csv not found)
file ../output/zip_county_place_usps_master.csv saved
(data now sorted by tract_fips zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/tract_zip_master.dta
Key: tract_fips zipcode
===============================================================================
  170189:3(55294):342765164:372020979

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  tract_fips |          0
     zipcode |          0
   res_ratio |    170,189    .4305214    .4102205          0          1




(note: file ../output/tract_zip_master.dta not found)
file ../output/tract_zip_master.dta saved
(data now sorted by tract_fips zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/tract_zip_master.csv
Key: tract_fips zipcode
===============================================================================
  170189:3(55294):342765164:372020979

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  tract_fips |          0
     zipcode |          0
   res_ratio |    170,189    .4305214    .4102205          0          1




(note: file ../output/tract_zip_master.csv not found)

. 
end of do-file

 make.py ended: 2022-02-16 18:32:17
