
 make.py started: 2021-03-07 14:41:37 /Users/gabriborg/Dropbox (Brown)/research/min_wage_rent/base/geo_master/code 




Execute:  stataSE -e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: 120-user network perpetual
Serial number: 401606201670
  Licensed to: Brown University
               Brown University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "/Applications/Stata/ado/base/"
  [2]  (SITE)      "/Applications/Stata/ado/site/"
  [3]              "."
  [4]  (PERSONAL)  "/Users/gabriborg/Documents/Stata/ado/personal/"
  [5]  (PLUS)      "/Users/gabriborg/Library/Application Support/Stata/ado/plus/"
  [6]  (OLDPLACE)  "~/ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.         local xwalk_dir  "../../../raw/crosswalk"
  2.         local output     "../output"
  3. 
.         build_geomaster_large, instub(`xwalk_dir') outstub(`output')
  4.         build_geomaster_small, instub(`xwalk_dir') outstub(`output')
  5. end

. 
. program build_geomaster_large
  1.         syntax, instub(str) outstub(str)
  2.         import excel "`instub'/zip_to_zcta_2019.xlsx", ///
>                 sheet("ZiptoZCTA_crosswalk") firstrow allstring clear
  3.         rename (ZIP_CODE ZCTA PO_NAME) (zipcode zcta zipcode_name)
  4.         drop if zipcode == "96898" & zcta == "No ZCTA"
  5.         keep zipcode zcta zipcode_name
  6.         save_data "../temp/usps_master.dta", ///
>                 key(zipcode) replace
  7.         
.         clear
  8.         import delimited "`instub'/geocorr2018.csv", ///
>                 varnames(1) stringcols(1 2 3 4 5)
  9.         drop metdiv10 mdivname10 afact
 10.         rename (zcta5 placefp county state zipname cntyname placenm cbsaname10 sta
> b) ///
>                 (zcta place_code countyfips statefips zcta_name county_name place_nam
> e ///
>                 cbsa10_name state_abb)
 11.         rename hus10 houses_zcta_place_county
 12.         merge m:m zcta using "../temp/usps_master.dta", nogen keep(3)
 13. 
.         keep zcta zipcode place_code countyfips cbsa10 statefips ///
>                 houses_zcta_place_county zcta_name place_name county_name ///
>                 cbsa10_name state_abb
 14.         order zcta zipcode place_code countyfips cbsa10 statefips ///
>                 houses_zcta_place_county zcta_name place_name county_name ///
>                 cbsa10_name state_abb
 15. 
.         save_data "`outstub'/zip_county_place_usps_master.dta", ///
>                 key(zcta zipcode countyfips place_code) replace
 16.         save_data "`outstub'/zip_county_place_usps_master.csv", outsheet ///
>                 key(zcta zipcode countyfips place_code) replace
 17. end

. 
. program build_geomaster_small
  1.         syntax, instub(str) outstub(str)
  2. 
.         import excel "`instub'/TRACT_ZIP_122019.xlsx", ///
>                 firstrow clear
  3. 
.         drop BUS_RATIO OTH_RATIO TOT_RATIO      
  4. 
.         rename (TRACT ZIP RES_RATIO) (tract_fips zipcode res_ratio)
  5. 
.         save_data "`outstub'/tract_zip_master.dta", ///
>                 key(tract_fips zipcode) replace
  6.         save_data "`outstub'/tract_zip_master.csv", outsheet ///
>                 key(tract_fips zipcode) replace
  7. 
. end 

. 
. *EXECUTE
. main 
(6 vars, 41,107 obs)
(1 observation deleted)
(data now sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../temp/usps_master.dta
Key: zipcode
===============================================================================
  41106:3(76453):4239886574:3006094094

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
zipcode_name |          0
        zcta |          0




(note: file ../temp/usps_master.dta not found)
file ../temp/usps_master.dta saved
(14 vars, 84,977 obs)
(note: variable zcta was str5, now str7 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            87,799  
    -----------------------------------------
(data now sorted by zcta zipcode countyfips place_code)
  variable zcta was str7 now str5
  (175,598 bytes saved)
===============================================================================
File: ../output/zip_county_place_usps_master.dta
Key: zcta zipcode countyfips place_code
===============================================================================
  87799:12(78582):1748966768:2632504554

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        zcta |          0
     zipcode |          0
  countyfips |          0
  place_code |          0
      cbsa10 |          0
-------------+---------------------------------------------------------
   statefips |          0
houses_zct~y |     87,799    1796.605    3756.885          1      47617
   zcta_name |          0
  place_name |          0
 county_name |          0
-------------+---------------------------------------------------------
 cbsa10_name |          0
   state_abb |          0




(note: file ../output/zip_county_place_usps_master.dta not found)
file ../output/zip_county_place_usps_master.dta saved
(data now sorted by zcta zipcode countyfips place_code)
  variable zcta was str7 now str5
  (175,598 bytes saved)
===============================================================================
File: ../output/zip_county_place_usps_master.csv
Key: zcta zipcode countyfips place_code
===============================================================================
  87799:12(78582):1748966768:2632504554

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        zcta |          0
     zipcode |          0
  countyfips |          0
  place_code |          0
      cbsa10 |          0
-------------+---------------------------------------------------------
   statefips |          0
houses_zct~y |     87,799    1796.605    3756.885          1      47617
   zcta_name |          0
  place_name |          0
 county_name |          0
-------------+---------------------------------------------------------
 cbsa10_name |          0
   state_abb |          0




(note: file ../output/zip_county_place_usps_master.csv not found)
(6 vars, 170,189 obs)
(data now sorted by tract_fips zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/tract_zip_master.dta
Key: tract_fips zipcode
===============================================================================
  170189:3(55294):342765164:372020979

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  tract_fips |          0
     zipcode |          0
   res_ratio |    170,189    .4305214    .4102205          0          1




(note: file ../output/tract_zip_master.dta not found)
file ../output/tract_zip_master.dta saved
(data now sorted by tract_fips zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/tract_zip_master.csv
Key: tract_fips zipcode
===============================================================================
  170189:3(55294):342765164:372020979

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  tract_fips |          0
     zipcode |          0
   res_ratio |    170,189    .4305214    .4102205          0          1




(note: file ../output/tract_zip_master.csv not found)

. 
end of do-file

 make.py ended: 2021-03-07 14:42:02
