
 make.py started: 2021-03-26 08:49:03 C:\Users\shermo\Documents\GitHub\min_wage_rent\base\geo_master\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local xwalk_dir  "../../../raw/crosswalk"
  2.     local zillow_dir "../../../drive/base_large/zillow"
  3.     local output     "../output"
  4.     
.     build_zillow_zipcode_stats, instub(`zillow_dir')
  5.     build_geomaster_large, instub(`xwalk_dir') outstub(`output')
  6.     build_geomaster_small, instub(`xwalk_dir') outstub(`output')
  7. end

. 
. program build_zillow_zipcode_stats
  1.     syntax, instub(str)
  2. 
.     use "`instub'/zillow_zipcode_clean.dta"
  3. 
.     keep if !missing(medrentpricepsqft_SFCC)
  4.     collapse (count) n_months_zillow_rents = medrentpricepsqft_SFCC, by(zi
> pcode)
  5.     tostring zipcode, format(%05.0f) replace
  6. 
.     save "../temp/zillow_zipcodes_with_rents.dta", replace
  7. end

. 
. program build_geomaster_large
  1.     syntax, instub(str) outstub(str)
  2. 
.     import excel "`instub'/zip_to_zcta_2019.xlsx", ///
>         sheet("ZiptoZCTA_crosswalk") firstrow allstring clear
  3. 
.     rename (ZIP_CODE ZCTA PO_NAME) (zipcode zcta zipcode_name)
  4.     drop if zipcode == "96898" & zcta == "No ZCTA"
  5.     keep zipcode zcta zipcode_name
  6. 
.     merge 1:1 zipcode using "../temp/zillow_zipcodes_with_rents.dta", ///
>         assert(1 3)
  7. 
.     gen     zillow_zipcode = (_merge == 3)
  8.     replace n_months_zillow_rents = 0 if missing(n_months_zillow_rents)
  9.     drop    _merge
 10. 
.     save_data "../temp/usps_master.dta", key(zipcode) replace log(none)
 11.     
.     clear
 12.     import delimited "`instub'/geocorr2018.csv", ///
>         varnames(1) stringcols(1 2 3 4 5)
 13. 
.     drop metdiv10 mdivname10 afact
 14.     rename (zcta5      county       placefp     state)                  //
> /
>            (zcta       countyfips   place_code  statefips)
 15.     rename (zipname    cntyname     placenm     cbsaname10   stab)      //
> /
>            (zcta_name  county_name  place_name  cbsa10_name  state_abb)
 16.     rename hus10 houses_zcta_place_county
 17. 
.     gen rural = place_code == "99999"
 18. 
.     merge m:m zcta using "../temp/usps_master.dta", nogen keep(3)
 19. 
.     * Make sure zipcode-county-place combinations are unique
.     isid zipcode place_code countyfips
 20. 
.     replace n_months_zillow_rents = . if n_months_zillow_rents == 0
 21. 
.     local keep_vars ///
>         zipcode     place_code   countyfips   cbsa10     zcta       ///
>         place_name  county_name  cbsa10_name  state_abb  statefips  ///
>         houses_zcta_place_county n_months_zillow_rents
 22. 
.     keep  `keep_vars'
 23.     order `keep_vars'
 24.     
.     * Make dummy to select prefer ZIP code within zipcode-county-place combin
> ations
.     gsort zipcode -houses_zcta_place_county countyfips place_code
 25.     gen   neg_houses = -houses_zcta_place_county
 26.     bys   zipcode (neg_houses): gen zip_max_houses = (_n == 1)
 27.     drop  neg_houses
 28. 
.     save_data "`outstub'/zip_county_place_usps_master.dta", ///
>         key(zipcode countyfips place_code) replace
 29.     save_data "`outstub'/zip_county_place_usps_master.csv", outsheet ///
>         key(zipcode countyfips place_code) replace
 30. end

. 
. program build_geomaster_small
  1.     syntax, instub(str) outstub(str)
  2. 
.     import excel "`instub'/TRACT_ZIP_122019.xlsx", ///
>         firstrow clear
  3. 
.     drop BUS_RATIO OTH_RATIO TOT_RATIO    
  4. 
.     rename (TRACT ZIP RES_RATIO) (tract_fips zipcode res_ratio)
  5. 
.     save_data "`outstub'/tract_zip_master.dta", ///
>         key(tract_fips zipcode) replace
  6.     save_data "`outstub'/tract_zip_master.csv", outsheet ///
>         key(tract_fips zipcode) replace
  7. 
.     local instub  "../../../raw/crosswalk"
  8.     import delim "`instub'/tract_zcta_xwalk.csv", ///
>         varnames(1) stringcols(3 4 5) clear
  9. 
.     replace tract = tract * 100
 10.     replace tract = round(tract, 1)     
 11.     g tract_fips = string(tract, "%06.0f")
 12.     g county_fips = string(county, "%05.0f")
 13.     replace tract_fips = county_fips + tract_fips      
 14.     order tract_fips, first
 15. 
.     rename (zcta5 afact) (zcta res_ratio)
 16.     keep tract_fips zcta res_ratio
 17. 
.     save_data "`outstub'/tract_zcta_master.dta", ///
>         key(tract_fips zcta) replace
 18.     save_data "`outstub'/tract_zcta_master.csv", outsheet ///
>         key(tract_fips zcta) replace   
 19. end 

. 
. *EXECUTE
. main 
(9,066,669 observations deleted)
zipcode was long now str5
(note: file ../temp/zillow_zipcodes_with_rents.dta not found)
file ../temp/zillow_zipcodes_with_rents.dta saved
(1 observation deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,790
        from master                    37,790  (_merge==1)
        from using                          0  (_merge==2)

    matched                             3,316  (_merge==3)
    -----------------------------------------
(37,790 real changes made)
(data already sorted by zipcode)
  variable n_months_zillow_rents was long now int
  variable zillow_zipcode was float now byte
  (205,530 bytes saved)
===============================================================================
File: ../temp/usps_master.dta
Key: zipcode
===============================================================================
  41106:5(53297):2847124819:2269243045

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
zipcode_name |          0
        zcta |          0
n_months_z~s |     41,106     4.81628     18.9409          0        119
zillow_zip~e |     41,106    .0806695    .2723302          0          1




(note: file ../temp/usps_master.dta not found)
file ../temp/usps_master.dta saved
(14 vars, 84,977 obs)
(note: variable zcta was str5, now str7 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            87,799  
    -----------------------------------------
(80,453 real changes made, 80,453 to missing)
(data now sorted by zipcode countyfips place_code)
  variable zip_max_houses was float now byte
  variable zcta was str7 now str5
  (438,995 bytes saved)
===============================================================================
File: ../output/zip_county_place_usps_master.dta
Key: zipcode countyfips place_code
===============================================================================
  87799:13(78026):1023705753:2054576064

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
  place_code |          0
      cbsa10 |          0
        zcta |          0
-------------+---------------------------------------------------------
  place_name |          0
 county_name |          0
 cbsa10_name |          0
   state_abb |          0
   statefips |          0
-------------+---------------------------------------------------------
houses_zct~y |     87,799    1796.605    3756.885          1      47617
n_months_z~s |      7,346    58.76354    33.90895         12        119
zip_max_ho~s |     87,799    .4611442    .4984908          0          1




(note: file ../output/zip_county_place_usps_master.dta not found)
file ../output/zip_county_place_usps_master.dta saved
(data now sorted by zipcode countyfips place_code)
  variable zip_max_houses was float now byte
  variable zcta was str7 now str5
  (438,995 bytes saved)
===============================================================================
File: ../output/zip_county_place_usps_master.csv
Key: zipcode countyfips place_code
===============================================================================
  87799:13(78026):1023705753:2054576064

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
  place_code |          0
      cbsa10 |          0
        zcta |          0
-------------+---------------------------------------------------------
  place_name |          0
 county_name |          0
 cbsa10_name |          0
   state_abb |          0
   statefips |          0
-------------+---------------------------------------------------------
houses_zct~y |     87,799    1796.605    3756.885          1      47617
n_months_z~s |      7,346    58.76354    33.90895         12        119
zip_max_ho~s |     87,799    .4611442    .4984908          0          1




(note: file ../output/zip_county_place_usps_master.csv not found)
(data now sorted by tract_fips zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/tract_zip_master.dta
Key: tract_fips zipcode
===============================================================================
  170189:3(55294):342765164:372020979

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  tract_fips |          0
     zipcode |          0
   res_ratio |    170,189    .4305214    .4102205          0          1




(note: file ../output/tract_zip_master.dta not found)
file ../output/tract_zip_master.dta saved
(data now sorted by tract_fips zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/tract_zip_master.csv
Key: tract_fips zipcode
===============================================================================
  170189:3(55294):342765164:372020979

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  tract_fips |          0
     zipcode |          0
   res_ratio |    170,189    .4305214    .4102205          0          1




(note: file ../output/tract_zip_master.csv not found)
(7 vars, 144,182 obs)
(144,182 real changes made)
(8,821 real changes made)
variable tract_fips was str6 now str11
(144,182 real changes made)
(data now sorted by tract_fips zcta)
  (0 bytes saved)
===============================================================================
File: ../output/tract_zcta_master.dta
Key: tract_fips zcta
===============================================================================
  144182:3(55301):511757313:695675967

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  tract_fips |          0
        zcta |          0
   res_ratio |    144,182    .5024898    .4094098      .0001          1




(note: file ../output/tract_zcta_master.dta not found)
file ../output/tract_zcta_master.dta saved
(data now sorted by tract_fips zcta)
  (0 bytes saved)
===============================================================================
File: ../output/tract_zcta_master.csv
Key: tract_fips zcta
===============================================================================
  144182:3(55301):511757313:695675967

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  tract_fips |          0
        zcta |          0
   res_ratio |    144,182    .5024898    .4094098      .0001          1




(note: file ../output/tract_zcta_master.csv not found)

. 
end of do-file

 make.py ended: 2021-03-26 08:49:43
