
 make.py started: 2021-04-08 09:52:08 C:\Users\diegog\Desktop\Diego\min_wage_rent\base\geo_master\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local xwalk_dir  "../../../raw/crosswalk"
  2.     local zillow_dir "../../../drive/base_large/zillow"
  3.     local output     "../output"
  4.     
.     build_geomaster_large, instub(`xwalk_dir') outstub(`output')
  5.     build_geomaster_small, instub(`xwalk_dir') outstub(`output')
  6. end

. 
. program build_geomaster_large
  1.     syntax, instub(str) outstub(str)
  2. 
.     import excel "`instub'/zip_to_zcta_2019.xlsx", ///
>         sheet("ZiptoZCTA_crosswalk") firstrow allstring clear
  3.     rename (ZIP_CODE ZCTA PO_NAME) (zipcode zcta zipcode_name)
  4.     drop if zipcode == "96898" & zcta == "No ZCTA"
  5.     keep zipcode zcta zipcode_name
  6.     save_data "../temp/usps_master.dta", key(zipcode) replace log(none)
  7.     
.     clear
  8.     import delimited "`instub'/geocorr2018.csv", ///
>         varnames(1) stringcols(1 2 3 4 5)
  9. 
.     drop metdiv10 mdivname10 afact
 10.     rename (zcta5      county       placefp     state)                  //
> /
>            (zcta       countyfips   place_code  statefips)
 11.     rename (zipname    cntyname     placenm     cbsaname10   stab)      //
> /
>            (zcta_name  county_name  place_name  cbsa10_name  state_abb)
 12.     rename hus10 houses_zcta_place_county
 13. 
.     gen rural = place_code == "99999"
 14. 
.     merge m:m zcta using "../temp/usps_master.dta", nogen keep(3)
 15. 
.     * Make sure zipcode-county-place combinations are unique
.     isid zipcode place_code countyfips
 16. 
.     local keep_vars ///
>         zipcode     place_code   countyfips   cbsa10     zcta       ///
>         place_name  county_name  cbsa10_name  state_abb  statefips  ///
>         houses_zcta_place_county rural
 17. 
.     keep  `keep_vars'
 18.     order `keep_vars'
 19.     
.         save_data "`outstub'/zip_county_place_usps_all.dta", ///
>         key(zipcode countyfips place_code) replace
 20.     export delimited "`outstub'/zip_county_place_usps_all.csv", replace
 21.         
.     gen   neg_houses = -houses_zcta_place_county
 22.     bys   zipcode (neg_houses): keep if _n == 1
 23.     drop  neg_houses            
 24.         
.     save_data "`outstub'/zip_county_place_usps_master.dta", ///
>         key(zipcode) replace
 25.     export delimited "`outstub'/zip_county_place_usps_master.csv", replace
 26. end

. 
. program build_geomaster_small
  1.     syntax, instub(str) outstub(str)
  2. 
.     import excel "`instub'/TRACT_ZIP_122019.xlsx", ///
>         firstrow clear
  3. 
.     drop BUS_RATIO OTH_RATIO TOT_RATIO    
  4. 
.     rename (TRACT ZIP RES_RATIO) (tract_fips zipcode res_ratio)
  5. 
.     save_data "`outstub'/tract_zip_master.dta", ///
>         key(tract_fips zipcode) replace
  6.     save_data "`outstub'/tract_zip_master.csv", outsheet ///
>         key(tract_fips zipcode) replace 
  7. end 

. 
. *EXECUTE
. main 
(1 observation deleted)
(data now sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../temp/usps_master.dta
Key: zipcode
===============================================================================
  41106:3(76453):4239886574:3006094094

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
zipcode_name |          0
        zcta |          0




(note: file ../temp/usps_master.dta not found)
file ../temp/usps_master.dta saved
(14 vars, 84,977 obs)
(note: variable zcta was str5, now str7 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            87,799  
    -----------------------------------------
(data now sorted by zipcode countyfips place_code)
  variable rural was float now byte
  variable zcta was str7 now str5
  (438,995 bytes saved)
===============================================================================
File: ../output/zip_county_place_usps_all.dta
Key: zipcode countyfips place_code
===============================================================================
  87799:12(15803):1520888658:143548167

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
  place_code |          0
      cbsa10 |          0
        zcta |          0
-------------+---------------------------------------------------------
  place_name |          0
 county_name |          0
 cbsa10_name |          0
   state_abb |          0
   statefips |          0
-------------+---------------------------------------------------------
houses_zct~y |     87,799    1796.605    3756.885          1      47617
       rural |     87,799     .443513    .4968018          0          1




(note: file ../output/zip_county_place_usps_all.dta not found)
file ../output/zip_county_place_usps_all.dta saved
(note: file ../output/zip_county_place_usps_all.csv not found)
file ../output/zip_county_place_usps_all.csv saved
(47,311 observations deleted)
(data already sorted by zipcode)
  variable rural was float now byte
  variable zcta was str7 now str5
  (202,440 bytes saved)
===============================================================================
File: ../output/zip_county_place_usps_master.dta
Key: zipcode
===============================================================================
  40488:12(81338):2396928722:1567900855

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  place_code |          0
  countyfips |          0
      cbsa10 |          0
        zcta |          0
-------------+---------------------------------------------------------
  place_name |          0
 county_name |          0
 cbsa10_name |          0
   state_abb |          0
   statefips |          0
-------------+---------------------------------------------------------
houses_zct~y |     40,488    3314.308      5032.1          1      47617
       rural |     40,488     .444675    .4969359          0          1




(note: file ../output/zip_county_place_usps_master.dta not found)
file ../output/zip_county_place_usps_master.dta saved
(note: file ../output/zip_county_place_usps_master.csv not found)
file ../output/zip_county_place_usps_master.csv saved
(data now sorted by tract_fips zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/tract_zip_master.dta
Key: tract_fips zipcode
===============================================================================
  170189:3(55294):342765164:372020979

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  tract_fips |          0
     zipcode |          0
   res_ratio |    170,189    .4305214    .4102205          0          1




(note: file ../output/tract_zip_master.dta not found)
file ../output/tract_zip_master.dta saved
(data now sorted by tract_fips zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/tract_zip_master.csv
Key: tract_fips zipcode
===============================================================================
  170189:3(55294):342765164:372020979

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  tract_fips |          0
     zipcode |          0
   res_ratio |    170,189    .4305214    .4102205          0          1




(note: file ../output/tract_zip_master.csv not found)

. 
end of do-file

 make.py ended: 2021-04-08 09:52:46
