
 make.py started: 2022-02-15 19:53:56 C:\Users\shermo\Documents\GitHub\min_wage_rent\base\census_block_master\code 




Execute:  StataMP-64 /e do "./shp_to_dta.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./shp_to_dta.do 

. clear all

. set more off

. 
. program main
  1.     local in_centroids "../../../drive/base_large/census_blocks_centroids"
  2.     local in_usps_zip  "../../../drive/raw_data/shapefiles/USPS_zipcodes"
  3.     local outstub      "../temp"
  4.     
.     shp2dta using "`in_centroids'/census_blocks_2010_centroids.shp", ///
>         database("`outstub'/census_blocks_2010_centroids_db")        ///
>         coordinates("`outstub'/census_blocks_2010_centroids_coord")  ///
>         genid(cb_centroid_geo_id) replace
  5.         
.     shp2dta using "`in_usps_zip'/USPS_zipcodes_July2020.shp",        ///
>         database("`outstub'/USPS_zipcodes_July2020_db")              ///
>         coordinates("`outstub'/USPS_zipcodes_July2020_coord")        ///
>         genid(usps_zip_poly_geo_id) replace
  6. end

. 
. 
. main
type: 1
type: 5

. 
end of do-file


Execute:  StataMP-64 /e do "./spatial_match.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./spatial_match.do 

. clear all

. set more off

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/min_wage/ado"

. 
. program main
  1.     local in_data   "../temp"
  2.     local in_xwalk  "../../../drive/raw_data/zcta_census_tract/"
  3.     local outstub   "../../../drive/base_large/census_block_master"
  4.     local logfile   "../output/data_file_manifest.log"
  5.     
.     clean_zcta_tract_xwalk, instub(`in_xwalk')
  6.     save_data "`in_data'/tract_to_zcta.dta", ///
>         key(statefips countyfips census_tract) replace 
  7.         
.     use "`in_data'/census_blocks_2010_centroids_coord.dta", clear
  8. 
.     rename _ID     cb_centroid_geo_id
  9.     rename (_X _Y) (longitude latitude)
 10.     
.     geoinpoly latitude longitude ///
>         using "`in_data'/USPS_zipcodes_July2020_coord.dta"
 11.     rename _ID usps_zip_poly_geo_id
 12. 
.     merge m:1 cb_centroid_geo_id using "`in_data'/census_blocks_2010_centroid
> s_db.dta", ///
>         keep(1 3) nogen
 13.     rename (statfps   cntyfps    cnss_tr      cnss_bl      nm_hs10    ) //
> /
>            (statefips countyfips census_tract census_block num_house10)
 14. 
.     merge m:1 usps_zip_poly_geo_id using "`in_data'/USPS_zipcodes_July2020_db
> .dta", ///
>         keep(1 3) nogen keepusing(ZIP_CODE)
 15.     rename ZIP_CODE zipcode
 16. 
.     drop longitude latitude usps_zip_poly_geo_id cb_centroid_geo_id
 17. 
.     merge m:1 statefips countyfips census_tract using "`in_data'/tract_to_zct
> a.dta", ///
>         keep(1 3) nogen
 18. 
.     save_data "`outstub'/census_block_master.dta", ///
>         key(census_block) log(`logfile') replace
 19.     export delimited "`outstub'/census_block_master.csv"
 20. end

. 
. program clean_zcta_tract_xwalk
  1.     syntax, instub(str)
  2.     
.     import delimited "`instub'/zcta_census_tract.txt", ///
>         clear stringcols(1 2 3 4 5)
  3. 
.     gen  neg_hupt = -hupt
  4.     bysort state county tract (neg_hupt): keep if _n == 1
  5.     drop neg_hupt
  6.     
.     keep state county zcta5 tract
  7.     rename (state     county     zcta5 tract       ) ///
>            (statefips countyfips zcta  census_tract)
  8. end

. 
. 
. main
(25 vars, 74,800 obs)
(36,642 observations deleted)
(data already sorted by statefips countyfips census_tract)
  (0 bytes saved)
===============================================================================
File: ../temp/tract_to_zcta.dta
Key: statefips countyfips census_tract
===============================================================================
  38158:4(116560):2680374772:578656039

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statefips |          0
  countyfips |          0
census_tract |          0
        zcta |          0




(note: file ../temp/tract_to_zcta.dta not found)
file ../temp/tract_to_zcta.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        11,078,297  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        40,587
        from master                    40,587  
        from using                          0  

    matched                        11,037,710  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                     6,355,438
        from master                 6,355,438  
        from using                          0  

    matched                         4,722,859  
    -----------------------------------------
(data now sorted by census_block)
  (0 bytes saved)
===============================================================================
File: ../../../drive/base_large/census_block_master/census_block_master.dta
Key: census_block
===============================================================================
  11078297:8(105952):3784367032:3889695251

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
census_block |          0
   statefips |          0
  countyfips |          0
census_tract |          0
 num_house10 | 11,078,297    11.88854    33.80024          0       4022
-------------+---------------------------------------------------------
       pop10 | 11,078,297     27.8694    78.59192          0      19352
     zipcode |          0
        zcta |          0




(note: file ../../../drive/base_large/census_block_master/census_block_master.d
> ta not found)
file ../../../drive/base_large/census_block_master/census_block_master.dta save
> d
file ../../../drive/base_large/census_block_master/census_block_master.csv save
> d

. 
end of do-file

 make.py ended: 2022-02-15 21:05:00
