
 make.py started: 2022-02-18 09:12:40 C:\Users\diegog\Desktop\Diego\min_wage_rent\base\census_block_master\code 




Execute:  StataMP-64 /e do "./spatial_match.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./spatial_match.do 

. clear all

. set more off

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/min_wage/ado"

. 
. program main
  1.     local in_shp    "../../../drive/base_large/shp_to_dta"
  2.     local in_xwalk  "../../../drive/raw_data/census_crosswalks"
  3.         local temp      "../temp"
  4.     local outstub   "../../../drive/base_large/census_block_master"
  5.     local logfile   "../output/data_file_manifest.log"
  6.     
.     clean_zcta_tract_xwalk, instub(`in_xwalk')
  7.     save_data "`temp'/tract_to_zcta.dta", log(none) ///
>         key(statefips countyfips census_tract) replace 
  8.                 
.     clean_zcta_cbsa_xwalk, instub(`in_xwalk')
  9.     save_data "`temp'/zcta_to_cbsa.dta", log(none) ///
>         key(zcta) replace 
 10.     
.     use "`in_shp'/census_blocks_2010_centroids_coord.dta", clear
 11.     rename _ID     cb_centroid_geo_id
 12.     rename (_X _Y) (longitude latitude)
 13.     
.     merge m:1 cb_centroid_geo_id using "`in_shp'/census_blocks_2010_centroids
> _db.dta", ///
>         keep(1 3) nogen
 14.     rename (statfps   cntyfps    cnss_tr      cnss_bl      nm_hs10    ) //
> /
>            (statefips countyfips census_tract census_block num_house10)
 15.     replace countyfips = statefips + countyfips
 16.         
.     map_to_usps_zipcode, instub(`in_shp')    
 17.     map_to_place,        instub(`in_shp')
 18.     drop latitude longitude 
 19. 
.     merge m:1 statefips countyfips census_tract using "`temp'/tract_to_zcta.d
> ta", ///
>         keep(1 3) nogen
 20.     merge m:1 zcta using "`temp'/zcta_to_cbsa.dta", ///
>         keep(1 3) nogen
 21.         
.         gen rural = (missing(place_code))
 22. 
.     save_data "`outstub'/census_block_master.dta", log(`logfile') ///
>         key(census_block) replace
 23.     export delimited "`outstub'/census_block_master.csv", replace
 24. end

. 
. program clean_zcta_tract_xwalk
  1.     syntax, instub(str)
  2.     
.     import delimited "`instub'/zcta_census_tract.txt", ///
>         clear stringcols(1 2 3 4 5)
  3. 
.     gen  neg_hupt = -hupt
  4.     bysort state county tract (neg_hupt): keep if _n == 1
  5.     drop neg_hupt
  6.     
.     keep state county zcta5 tract
  7.     replace county = state + county
  8.     rename (state     county     zcta5 tract       ) ///
>            (statefips countyfips zcta  census_tract)  
  9. end

. 
. program clean_zcta_cbsa_xwalk
  1.     syntax, instub(str)
  2.     
.     import delimited "`instub'/zcta_cbsa_rel_10.txt", ///
>         clear stringcols(1 2)
  3. 
.     gen  neg_hupt = -hupt
  4.     bysort zcta (neg_hupt): keep if _n == 1
  5.     drop neg_hupt
  6.     
.     keep zcta5 cbsa
  7.     rename (zcta5 cbsa) ///
>            (zcta  cbsa10)  
  8. end

. 
. program map_to_usps_zipcode
  1.     syntax, instub(str)
  2. 
.     geoinpoly latitude longitude ///
>         using "`instub'/USPS_zipcodes_July2020_coord.dta"
  3.     rename _ID usps_zip_poly_geo_id
  4. 
.     merge m:1 usps_zip_poly_geo_id using "`instub'/USPS_zipcodes_July2020_db.
> dta", ///
>         keep(1 3) nogen keepusing(ZIP_CODE)
  5.     rename ZIP_CODE zipcode
  6. 
.     drop usps_zip_poly_geo_id cb_centroid_geo_id
  7. end

. 
. program map_to_place
  1.     syntax, instub(str)
  2. 
.     geoinpoly latitude longitude ///
>         using "`instub'/us_places_2010_coord.dta"
  3.     rename _ID us_place_poly_geo_id
  4. 
.     merge m:1 us_place_poly_geo_id using "`instub'/us_places_2010_db.dta", //
> /
>         keep(1 3) nogen keepusing(place_code place_name place_type)
  5. 
.     drop us_place_poly_geo_id
  6. end

. 
. 
. main
(25 vars, 148,897 obs)
(75,301 observations deleted)
variable county was str3 now str5
(73,596 real changes made)
(data now sorted by statefips countyfips census_tract)
  (0 bytes saved)
===============================================================================
File: ../temp/tract_to_zcta.dta
Key: statefips countyfips census_tract
===============================================================================
  73596:4(116560):786098208:698911353

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   statefips |          0
  countyfips |          0
census_tract |          0
        zcta |          0




(note: file ../temp/tract_to_zcta.dta not found)
file ../temp/tract_to_zcta.dta saved
(23 vars, 28,712 obs)
(3,053 observations deleted)
(data already sorted by zcta)
  (0 bytes saved)
===============================================================================
File: ../temp/zcta_to_cbsa.dta
Key: zcta
===============================================================================
  25659:2(99802):546899890:3368053907

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        zcta |          0
      cbsa10 |          0




(note: file ../temp/zcta_to_cbsa.dta not found)
file ../temp/zcta_to_cbsa.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                        11,078,297  
    -----------------------------------------
variable countyfips was str3 now str5
(11,078,297 real changes made)

    Result                           # of obs.
    -----------------------------------------
    not matched                        40,587
        from master                    40,587  
        from using                          0  

    matched                        11,037,710  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                     5,672,388
        from master                 5,672,388  
        from using                          0  

    matched                         5,405,909  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         9,743
        from master                     9,743  
        from using                          0  

    matched                        11,068,554  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                     1,998,312
        from master                 1,998,312  
        from using                          0  

    matched                         9,079,985  
    -----------------------------------------
(data now sorted by census_block)
  variable rural was float now byte
  (33,234,891 bytes saved)
===============================================================================
File: ../../../drive/base_large/census_block_master/census_block_master.dta
Key: census_block
===============================================================================
  11078297:13(46784):614886025:3062266460

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
census_block |          0
   statefips |          0
  countyfips |          0
census_tract |          0
 num_house10 | 11,078,297    11.88854    33.80024          0       4022
-------------+---------------------------------------------------------
       pop10 | 11,078,297     27.8694    78.59192          0      19352
     zipcode |          0
  place_code |          0
  place_name |          0
  place_type |          0
-------------+---------------------------------------------------------
        zcta |          0
      cbsa10 |          0
       rural | 11,078,297    .5120271    .4998554          0          1




(note: file ../../../drive/base_large/census_block_master/census_block_master.d
> ta not found)
file ../../../drive/base_large/census_block_master/census_block_master.dta save
> d
(note: file ../../../drive/base_large/census_block_master/census_block_master.c
> sv not found)
file ../../../drive/base_large/census_block_master/census_block_master.csv save
> d

. 
end of do-file

 make.py ended: 2022-02-18 10:14:02
