
 make.py started: 2020-12-01 16:31:27 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\sumstats\code 




Execute:  StataMP-64 /e do "./count_mw.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./count_mw.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000


. 
. program main
  1. 
.         local instub_unbal "../../../drive/derived_large/output"
  2.         local outfile      "../output/sumstats_unbalanced.log"
  3. 
.         use "`instub_unbal'/unbal_rent_panel.dta", clear
  4. 
.         count_mw_and_write_file, outfile(`outfile')
  5. 
.         local instub_baseline "../../first_differences/temp"
  6.         local outfile         "../output/sumstats_baseline.log"
  7. 
.         use "`instub_baseline'/fd_rent_panel.dta", clear
  8.         merge 1:1 zipcode year_month ///
>                 using "`instub_unbal'/unbal_rent_panel.dta", ///
>                 keep(3) nogen
  9. 
.         count_mw_and_write_file, outfile(`outfile')
 10. end

. 
. program count_mw_and_write_file
  1.         syntax, outfile(str) 
  2. 
.         file open myfile using `outfile', write replace
  3. 
.         tab mw_event if mw_event == 1
  4.         file write myfile "Number of zipcode-level MW events: `r(N)'" _n
  5. 
.         preserve
  6.                 collapse (max) state_event, by(statefips year_month)
  7. 
.                 tab state_event if state_event == 1
  8.                         
.                 file write myfile "Number of MW events at the state level: `r
> (N)'" _n
  9.         restore
 10. 
.         foreach event_type in county local {
 11.                 preserve
 12.                         collapse (max) `event_type'_event, by(countyfips y
> ear_month)
 13. 
.                         tab `event_type'_event if `event_type'_event == 1
 14.                         
.                         file write myfile "Number of MW events at the `event_
> type' level: `r(N)'" _n
 15.                 restore
 16.         }
 17. 
.         file close myfile
 18. end

. 
. main
(note: file ../output/sumstats_unbalanced.log not found)

   mw_event |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,689      100.00      100.00
------------+-----------------------------------
      Total |     18,689      100.00

      (max) |
state_event |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        151      100.00      100.00
------------+-----------------------------------
      Total |        151      100.00

      (max) |
county_even |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         44      100.00      100.00
------------+-----------------------------------
      Total |         44      100.00

      (max) |
local_event |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        138      100.00      100.00
------------+-----------------------------------
      Total |        138      100.00
(label msa already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           154,800  
    -----------------------------------------
(note: file ../output/sumstats_baseline.log not found)

   mw_event |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,213      100.00      100.00
------------+-----------------------------------
      Total |      5,213      100.00

      (max) |
state_event |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        124      100.00      100.00
------------+-----------------------------------
      Total |        124      100.00

      (max) |
county_even |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         20      100.00      100.00
------------+-----------------------------------
      Total |         20      100.00

      (max) |
local_event |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         79      100.00      100.00
------------+-----------------------------------
      Total |         79      100.00

. 
end of do-file

 make.py ended: 2020-12-01 16:31:35
