
 make.py started: 2022-02-04 11:41:30 C:\Users\diegog\Desktop\Diego\min_wage_rent\base\irs_soi\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local instub  "../temp"
  2.     local outstub "../../../drive/base_large/irs_soi"
  3.     local logfile "../output/data_file_manifest.log"
  4. 
.     foreach y in "09" "10" "11" "12" "13" "14" "15" "16" "17" "18" "19" {
  5.         read_excel_files, instub(`instub') yr(`y')
  6.     }
  7. 
.     foreach y in "09" "10" "11" "12" "13" "14" "15" "16" "17" "18" "19" {
  8.         append using "../temp/irs_zip_`y'.dta"
  9.     }
 10.     
.     drop if num_hhlds_irs == 0.0001
 11.     drop if num_hhlds_irs == 0
 12.     collapse (sum) num_hhlds_irs pop_irs adj_gross_inc      ///
>         num_wage_hhlds_irs total_wage num_ret_int total_int           ///
>         num_ret_div total_div num_bus_hhlds_irs total_bizinc num_farm_hhlds_i
> rs, ///
>       by(zipcode statefips year)
 13.     
.     create_variables
 14. 
.     save_data "`outstub'/irs_zip.dta", key(zipcode statefips year) ///
>         log(`logfile') replace
 15.     save_data "`outstub'/irs_zip.csv", key(zipcode statefips year) ///
>         log(none) outsheet replace
 16. end

. 
. program read_excel_files
  1.     syntax, instub(str) yr(str)
  2. 
.     import delimited "`instub'/20`yr'/`yr'zpallagi.csv", clear ///
>         stringcols(1 2 3)
  3. 
.     keep statefips zipcode n1 n2 a00100 n00200 a00200 ///
>         n00300 a00300 n00600 a00600 n00900 a00900 schf
  4. 
.     rename (n1            n2      a00100        n00200             a00200) //
> /
>            (num_hhlds_irs pop_irs adj_gross_inc num_wage_hhlds_irs total_wage
> )
  5. 
.     rename (n00300      a00300    n00600      a00600    n00900            a00
> 900       schf) ///
>            (num_ret_int total_int num_ret_div total_div num_bus_hhlds_irs tot
> al_bizinc num_farm_hhlds_irs)
  6. 
.     gen year = int(`yr') + 2000
  7. 
.     save "../temp/irs_zip_`yr'.dta", replace
  8.     clear
  9. end

. 
. program create_variables
  1. 
.     gen agi_per_hhld = adj_gross_inc/num_hhlds_irs
  2.     gen agi_per_cap  = adj_gross_inc/pop_irs
  3. 
.     gen wage_per_wage_hhld = total_wage/num_wage_hhlds_irs
  4.     gen wage_per_hhld      = total_wage/num_hhlds_irs
  5.     gen wage_per_cap       = total_wage/pop_irs
  6. 
.     gen bussines_rev_per_owner = total_bizinc/num_bus_hhlds_irs
  7. 
.     gen share_wage_hhlds      = num_wage_hhlds_irs/num_hhlds_irs
  8.     gen share_bussiness_hhlds = num_bus_hhlds_irs/num_hhlds_irs
  9.     gen share_farmer_hhlds    = num_farm_hhlds_irs/num_hhlds_irs
 10. end

. 
. * Execute
. main
(73 vars, 167,178 obs)
(note: file ../temp/irs_zip_09.dta not found)
file ../temp/irs_zip_09.dta saved
(73 vars, 167,022 obs)
(note: file ../temp/irs_zip_10.dta not found)
file ../temp/irs_zip_10.dta saved
(73 vars, 167,334 obs)
(note: file ../temp/irs_zip_11.dta not found)
file ../temp/irs_zip_11.dta saved
(77 vars, 166,904 obs)
(note: file ../temp/irs_zip_12.dta not found)
file ../temp/irs_zip_12.dta saved
(115 vars, 166,740 obs)
(note: file ../temp/irs_zip_13.dta not found)
file ../temp/irs_zip_13.dta saved
(127 vars, 166,686 obs)
(note: file ../temp/irs_zip_14.dta not found)
file ../temp/irs_zip_14.dta saved
(131 vars, 166,698 obs)
(note: file ../temp/irs_zip_15.dta not found)
file ../temp/irs_zip_15.dta saved
(147 vars, 179,796 obs)
(note: file ../temp/irs_zip_16.dta not found)
file ../temp/irs_zip_16.dta saved
(153 vars, 166,537 obs)
(note: file ../temp/irs_zip_17.dta not found)
file ../temp/irs_zip_17.dta saved
(153 vars, 165,935 obs)
(note: file ../temp/irs_zip_18.dta not found)
file ../temp/irs_zip_18.dta saved
(152 vars, 166,159 obs)
(note: file ../temp/irs_zip_19.dta not found)
file ../temp/irs_zip_19.dta saved
(note: variable num_hhlds_irs was float, now double to accommodate using
       data's values)
(note: variable pop_irs was float, now double to accommodate using data's
       values)
(note: variable adj_gross_inc was float, now double to accommodate using
       data's values)
(note: variable num_wage_hhlds_irs was float, now double to accommodate using
       data's values)
(note: variable total_wage was float, now double to accommodate using data's
       values)
(note: variable num_ret_int was float, now double to accommodate using data's
       values)
(note: variable total_int was float, now double to accommodate using data's
       values)
(note: variable num_ret_div was float, now double to accommodate using data's
       values)
(note: variable total_div was float, now double to accommodate using data's
       values)
(note: variable num_bus_hhlds_irs was float, now double to accommodate using
       data's values)
(note: variable num_farm_hhlds_irs was float, now double to accommodate using
       data's values)
(note: variable total_bizinc was float, now double to accommodate using
       data's values)
(0 observations deleted)
(130,846 observations deleted)
(2 missing values generated)
(12,121 missing values generated)
(data already sorted by zipcode statefips year)
  variable year was float now int
  (615,700 bytes saved)
===============================================================================
File: ../../../drive/base_large/irs_soi/irs_zip.dta
Key: zipcode statefips year
===============================================================================
  307850:24(71340):3500403102:2296745861

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
   statefips |          0
        year |    307,850    2014.008    3.155054       2009       2019
num_hhlds_~s |    307,850    10357.24    181897.2         40   1.83e+07
     pop_irs |    307,850    20280.09    360416.1         50   3.58e+07
-------------+---------------------------------------------------------
adj_gross_~c |    307,850    697421.1    1.31e+07        886   1.68e+09
num_wage_h~s |    307,850      8648.1    151278.9          0   1.52e+07
  total_wage |    307,850    480365.9     8915965          0   1.14e+09
 num_ret_int |    307,850    3309.295    59085.95          0    6565245
   total_int |    307,850    7250.076    151830.7          0   1.93e+07
-------------+---------------------------------------------------------
 num_ret_div |    307,850    1937.689    33643.83          0    3306390
   total_div |    307,850    15564.12    315252.2          0   4.08e+07
num_bus_hh~s |    307,850    1683.779    31806.37          0    3469530
total_bizinc |    307,850    22846.62    464651.1     -52896   5.98e+07
num_farm_h~s |    307,850    117.1838    2026.173          0     225790
-------------+---------------------------------------------------------
agi_per_hhld |    307,850    59.76861    46.44273   3.881399   3886.435
 agi_per_cap |    307,850    30.86258    26.44181   3.803288   2526.183
wage_per_w~d |    307,848    49.02967    26.58815        6.8   1006.877
wage_per_h~d |    307,850    39.99173    20.36183          0   645.2743
wage_per_cap |    307,850     20.4899    11.12704          0    375.538
-------------+---------------------------------------------------------
bussines_r~r |    295,729    10.97549    8.485684  -51.40723   596.3752
share_wage~s |    307,850    .8197127     .063632          0   1.007092
share_buss~s |    307,850    .1543227    .0553351          0   .7058824
share_farm~s |    307,850    .0469408     .074111          0   .7857143




file ../../../drive/base_large/irs_soi/irs_zip.dta saved
(data already sorted by zipcode statefips year)
  variable year was float now int
  (615,700 bytes saved)
===============================================================================
File: ../../../drive/base_large/irs_soi/irs_zip.csv
Key: zipcode statefips year
===============================================================================
  307850:24(71340):3500403102:2296745861

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
   statefips |          0
        year |    307,850    2014.008    3.155054       2009       2019
num_hhlds_~s |    307,850    10357.24    181897.2         40   1.83e+07
     pop_irs |    307,850    20280.09    360416.1         50   3.58e+07
-------------+---------------------------------------------------------
adj_gross_~c |    307,850    697421.1    1.31e+07        886   1.68e+09
num_wage_h~s |    307,850      8648.1    151278.9          0   1.52e+07
  total_wage |    307,850    480365.9     8915965          0   1.14e+09
 num_ret_int |    307,850    3309.295    59085.95          0    6565245
   total_int |    307,850    7250.076    151830.7          0   1.93e+07
-------------+---------------------------------------------------------
 num_ret_div |    307,850    1937.689    33643.83          0    3306390
   total_div |    307,850    15564.12    315252.2          0   4.08e+07
num_bus_hh~s |    307,850    1683.779    31806.37          0    3469530
total_bizinc |    307,850    22846.62    464651.1     -52896   5.98e+07
num_farm_h~s |    307,850    117.1838    2026.173          0     225790
-------------+---------------------------------------------------------
agi_per_hhld |    307,850    59.76861    46.44273   3.881399   3886.435
 agi_per_cap |    307,850    30.86258    26.44181   3.803288   2526.183
wage_per_w~d |    307,848    49.02967    26.58815        6.8   1006.877
wage_per_h~d |    307,850    39.99173    20.36183          0   645.2743
wage_per_cap |    307,850     20.4899    11.12704          0    375.538
-------------+---------------------------------------------------------
bussines_r~r |    295,729    10.97549    8.485684  -51.40723   596.3752
share_wage~s |    307,850    .8197127     .063632          0   1.007092
share_buss~s |    307,850    .1543227    .0553351          0   .7058824
share_farm~s |    307,850    .0469408     .074111          0   .7857143




(note: file ../../../drive/base_large/irs_soi/irs_zip.csv not found)

. 
end of do-file

 make.py ended: 2022-02-04 11:45:28
