
 make.py started: 2021-09-17 15:19:06 C:\Users\diegog\Desktop\Diego\min_wage_rent\base\irs_soi\code 




Execute:  StataMP-64 /e do "./build_irs_soi.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build_irs_soi.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     foreach y in "09" "10" "11" "12" "13" ///
>             "14" "15" "16" "17" "18" {
  2.                     read_excel_files, yr(`y')
  3.                 }
  4.         use "../temp/irs_zip_09.dta", clear
  5.     foreach y in "10" "11" "12" "13" ///
>             "14" "15" "16" "17" "18" {
  6.                     append using "../temp/irs_zip_`y'.dta"
  7.                 }
  8.         save_data "../output/irs_zip.dta", key(zipcode year) clear
  9. end

. 
. program read_excel_files
  1.         syntax, yr(str)
  2. 
.         import delimited "../temp/20`yr'/`yr'zpallagi.csv", clear ///
>             stringcols(1 2 3)
  3.         keep statefips zipcode n1 n2 numdep a00100 n00200 a00200 ///
>             n00300 a00300 n00600 a00600 n00900 a00900 schf
  4.     rename (n1 n2 numdep a00100 n00200 a00200 ///
>             n00300 a00300 n00600 a00600 n00900 a00900 schf) ///
>                 (num_ret num_exemp num_dep agi num_ret_wage total_wage ///
>                 num_ret_int total_int num_ret_div total_div num_ret_bus tot_b
> us num_ret_farm)
  5.         gen year = int(`yr') + 2000
  6.         save "../temp/irs_zip_`yr'.dta", replace
  7. end

. 
. * Execute
. main
(73 vars, 167,178 obs)
(note: file ../temp/irs_zip_09.dta not found)
file ../temp/irs_zip_09.dta saved
(73 vars, 167,022 obs)
(note: file ../temp/irs_zip_10.dta not found)
file ../temp/irs_zip_10.dta saved
(73 vars, 167,334 obs)
(note: file ../temp/irs_zip_11.dta not found)
file ../temp/irs_zip_11.dta saved
(77 vars, 166,904 obs)
(note: file ../temp/irs_zip_12.dta not found)
file ../temp/irs_zip_12.dta saved
(115 vars, 166,740 obs)
(note: file ../temp/irs_zip_13.dta not found)
file ../temp/irs_zip_13.dta saved
(127 vars, 166,686 obs)
(note: file ../temp/irs_zip_14.dta not found)
file ../temp/irs_zip_14.dta saved
(131 vars, 166,698 obs)
(note: file ../temp/irs_zip_15.dta not found)
file ../temp/irs_zip_15.dta saved
(147 vars, 179,796 obs)
(note: file ../temp/irs_zip_16.dta not found)
file ../temp/irs_zip_16.dta saved
(153 vars, 166,537 obs)
(note: file ../temp/irs_zip_17.dta not found)
file ../temp/irs_zip_17.dta saved
(153 vars, 165,935 obs)
(note: file ../temp/irs_zip_18.dta not found)
file ../temp/irs_zip_18.dta saved
(note: variable num_ret was float, now double to accommodate using data's
       values)
(note: variable num_exemp was float, now double to accommodate using data's
       values)
(note: variable num_dep was float, now double to accommodate using data's
       values)
(note: variable agi was float, now double to accommodate using data's values)
(note: variable num_ret_wage was float, now double to accommodate using
       data's values)
(note: variable total_wage was float, now double to accommodate using data's
       values)
(note: variable num_ret_int was float, now double to accommodate using data's
       values)
(note: variable total_int was float, now double to accommodate using data's
       values)
(note: variable num_ret_div was float, now double to accommodate using data's
       values)
(note: variable total_div was float, now double to accommodate using data's
       values)
(note: variable num_ret_bus was float, now double to accommodate using data's
       values)
(note: variable num_ret_farm was float, now double to accommodate using
       data's values)
(note: variable tot_bus was float, now double to accommodate using data's
       values)
variables zipcode year do not uniquely identify the observations
r(459);

end of do-file
r(459);

 make.py ended: 2021-09-17 15:22:24
