
 make.py started: 2020-03-12 18:52:34 C:\Users\gabriel\Dropbox (Brown)\research\min_wage_rent\analysis\code 




Execute:  StataMP-64 /e do "./preclean_event_studies.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./preclean_event_studies.do 

. clear all

. set more off

. adopath + ../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/mental_coupons/ado"

. adopath + ../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/mental_coupons/ado"
  [8]              "../../lib/stata/gslab_misc/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub  "../../derived/output/"
  2.         local outstub "../output/"
  3. 
.         use `instub'zipcode_yearmonth_panel.dta, clear
  4. 
.         prepare_data, time_var(year_month) geo_unit(zipcode)
  5. 
.         foreach window in 12 24 {
  6.                 create_latest_event_vars, event_dummy(min_event) window(`w
> indow')                         ///
>                         time_var(year_month) geo_unit(zipcode)
  7.                         
.         create_event_vars, event_dummy(min_event) window(`window')           
>               ///
>                         time_var(year_month) geo_unit(zipcode)
  8.                                                 
.         }
  9.         
.         save_data ../temp/zipcode_year_month_panel.dta, key(zipcode year_mont
> h) ///
>             replace log(none)
 10. end

. 
. program prepare_data
  1.     syntax, time_var(str) geo_unit(str)
  2. 
.     gen date = dofm(year_month)
  3.         gen calendar_month = month(date)
  4.         drop date
  5.         
.         replace min_event = 0 if dmin_actual_mw < 0.5
  6. 
.         drop if missing(msa)
  7.         
.         keep zipcode year_month state msa calendar_month ///
>             zhvi2br rent2br_median rent2br_psqft_median ///
>                 min_event mean_event max_event
  8. end

. 
. program create_latest_event_vars
  1.         syntax, event_dummy(str) window(int) time_var(str) geo_unit(str) [
> min_option(str)]
  2.         
.         local window_span = `window'*2 + 1 
  3.         
.         gen `event_dummy'_`time_var' = `time_var' if `event_dummy' == 1
  4.         format `event_dummy'_`time_var' %tm
  5.         
.         bysort `geo_unit': egen last_`event_dummy'_`time_var' = max(`event_du
> mmy'_`time_var')
  6.         gen last_`event_dummy'_rel_months`window' = `time_var' - last_`eve
> nt_dummy'_`time_var'
  7.         replace last_`event_dummy'_rel_months`window' = last_`event_dummy'
> _rel_months`window' + `window' + 1
  8.         replace last_`event_dummy'_rel_months`window' = 0 ///
>             if last_`event_dummy'_rel_months`window' <= 0
  9.         replace last_`event_dummy'_rel_months`window' = 1000 ///
>             if last_`event_dummy'_rel_months`window' > `window_span'
 10.                 
.         drop `event_dummy'_`time_var' last_`event_dummy'_`time_var'
 11. end

. 
. program create_event_vars
  1.         syntax, event_dummy(str) window(int) time_var(str) geo_unit(str)
  2. 
.         bysort `geo_unit' (`time_var'): gen event_start = 1 if `event_dummy'[
> _n + `window'] == 1
  3.         gen event_start_non_overlap = event_start
  4.         forvalues i = 0(1)`window' {                                    
  5.                 bysort `geo_unit' (`time_var'): replace event_start_non_ov
> erlap = . ///
>                     if `event_dummy'[_n - `i'] == 1
  6.         }
  7.         
.         local window_span = 2*`window' + 1
  8.         gen rel_months_`event_dummy' = event_start_non_overlap
  9.         forvalues i = 2(1)`window_span' {                                 
>       
 10.                 bysort `geo_unit' (`time_var'): replace rel_months_`event_
> dummy' = `i' ///
>                     if event_start_non_overlap[_n - `i' + 1] == 1
 11.         }
 12.         replace rel_months_`event_dummy' = 1000 if rel_months_`event_dummy
> ' == .
 13. 
. 
.         drop event_start event_start_non_overlap
 14.         rename rel_months_`event_dummy' rel_months_`event_dummy'`window'  
>       
 15. end

. 
. main
(98,274 real changes made)
(1,612,815 observations deleted)
(5,901,758 missing values generated)
(1309 missing values generated)
(1,309 missing values generated)
(5,983,359 real changes made)
(3,255,985 real changes made)
(2,182,709 real changes made)
(5,920,968 missing values generated)
(5,920,968 missing values generated)
(24783 real changes made, 24783 to missing)
(0 real changes made)
(99 real changes made, 99 to missing)
(140 real changes made, 140 to missing)
(0 real changes made)
(1529 real changes made, 1529 to missing)
(1656 real changes made, 1656 to missing)
(129 real changes made, 129 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(279 real changes made, 279 to missing)
(5,949,583 missing values generated)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(35085 real changes made)
(5,147,494 real changes made)
(5,901,758 missing values generated)
(1309 missing values generated)
(1,309 missing values generated)
(5,983,359 real changes made)
(3,003,997 real changes made)
(1,930,721 real changes made)
(5,922,764 missing values generated)
(5,922,764 missing values generated)
(7217 real changes made, 7217 to missing)
(0 real changes made)
(25 real changes made, 25 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(900 real changes made, 900 to missing)
(1105 real changes made, 1105 to missing)
(0 real changes made)
(0 real changes made)
(1680 real changes made, 1680 to missing)
(0 real changes made)
(711 real changes made, 711 to missing)
(0 real changes made)
(457 real changes made, 457 to missing)
(257 real changes made, 257 to missing)
(74 real changes made, 74 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1470 real changes made, 1470 to missing)
(0 real changes made)
(1134 real changes made, 1134 to missing)
(5,937,794 missing values generated)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(46874 real changes made)
(4,411,797 real changes made)
(data already sorted by zipcode year_month)
  variable calendar_month was float now byte
  variable last_min_event_rel_months12 was float now int
  variable rel_months_min_event12 was float now int
  variable last_min_event_rel_months24 was float now int
  variable rel_months_min_event24 was float now int
  (65,831,348 bytes saved)
===============================================================================
> ===================
File: ../temp/zipcode_year_month_panel.dta
Key: zipcode year_month
===============================================================================
> ===================
  5984668:15(47629):3069167475:1538193651

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |  5,984,668    47855.64    28544.01       1001      99901
  year_month |  5,984,668    577.0312    82.27507        435        719
         msa |  5,984,668    436.7477    244.9903          1        859
       state |  5,984,668     29.4037    15.21314          1         56
   min_event |  5,102,248    .0162497    .1264344          0          1
-------------+---------------------------------------------------------
  mean_event |  5,102,248    .0386438    .1927444          0          1
   max_event |  5,102,248    .0317648    .1753734          0          1
rent2br_me~n |    106,315    1764.751    877.7131        475      19500
rent2br_ps~n |     92,450    1.682024    .8027275   .5015197   12.55461
     zhvi2br |  4,629,892    156521.6      140189       7100    3893638
-------------+---------------------------------------------------------
calendar_m~h |  5,984,668    6.547375    3.437978          1         12
last_min_~12 |  5,984,668    365.8572    480.5047          0       1000
rel_month~12 |  5,984,668    861.9516    342.3222          1       1000
last_min_~24 |  5,984,668    326.9095    464.6324          0       1000
rel_month~24 |  5,984,668    744.4643    428.0353          1       1000




(note: file ../temp/zipcode_year_month_panel.dta not found)
file ../temp/zipcode_year_month_panel.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./first_last_event_study.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./first_last_event_study.do 

. clear all

. set more off

. adopath + ../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/mental_coupons/ado"

. adopath + ../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/mental_coupons/ado"
  [8]              "../../lib/stata/gslab_misc/ado"

. adopath + ../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/mental_coupons/ado"
  [8]              "../../lib/stata/gslab_misc/ado"
  [9]              "../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         use ../temp/zipcode_year_month_panel.dta, clear
  2. 
.         foreach window in 12 24 {
  3.                 create_event_plot, depvar(rent2br_median) event_var(last_m
> in_event_rel_months`window')      ///
>                         controls(" ") window(`window') ///
>                         absorb(zipcode msa calendar_month##state year_month)
  4. 
.                 create_event_plot, depvar(rent2br_psqft_median) event_var(las
> t_min_event_rel_months`window')      ///
>                         controls(" ") window(`window') ///
>                         absorb(zipcode msa calendar_month##state year_month)
  5. 
.                 create_event_plot, depvar(zhvi2br) event_var(last_min_event_r
> el_months`window')      ///
>                         controls(" ") window(`window') ///
>                         absorb(zipcode msa calendar_month##state year_month)
  6.         }
  7. end

. 
. main
(MWFE estimator converged in 8 iterations)

HDFE Linear regression                            Number of obs   =    106,315
Absorbing 4 HDFE groups                           F(  26,   2561) =       3.65
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9839
                                                  Adj R-squared   =     0.9834
                                                  Within R-sq.    =     0.0245
Number of clusters (zipcode) =      2,562         Root MSE        =   113.1117

                            (Std. Err. adjusted for 2,562 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
rent2br_me~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
last_min_~12 |
          0  |  -72.52451    13.9117    -5.21   0.000    -99.80383   -45.24519
          1  |  -39.95261   12.17782    -3.28   0.001    -63.83199   -16.07323
          2  |  -29.20816   12.02315    -2.43   0.015    -52.78425   -5.632078
          3  |  -25.73915   12.78848    -2.01   0.044    -50.81596   -.6623388
          4  |  -25.54402    13.1201    -1.95   0.052     -51.2711    .1830572
          5  |  -33.82341   11.97605    -2.82   0.005    -57.30713   -10.33969
          6  |  -37.84692   10.42804    -3.63   0.000    -58.29516   -17.39867
          7  |  -6.489689   9.801046    -0.66   0.508    -25.70847    12.72909
          8  |   3.475336   8.527647     0.41   0.684    -13.24645    20.19712
          9  |   .6752351   7.811472     0.09   0.931    -14.64221    15.99268
         10  |  -.6771535    7.69018    -0.09   0.930    -15.75676    14.40245
         11  |   4.946017   6.100745     0.81   0.418    -7.016876    16.90891
         13  |   13.01681   7.098307     1.83   0.067    -.9021936    26.93581
         14  |   20.83292   7.818422     2.66   0.008     5.501847    36.16399
         15  |   28.81183    8.33413     3.46   0.001     12.46952    45.15415
         16  |     38.098   8.876492     4.29   0.000     20.69217    55.50383
         17  |   31.27747    8.89405     3.52   0.000     13.83721    48.71773
         18  |   21.67189   8.628064     2.51   0.012     4.753198    38.59058
         19  |     20.808    9.68843     2.15   0.032     1.810046    39.80595
         20  |   35.77669   9.903088     3.61   0.000     16.35782    55.19556
         21  |   39.97578   9.691367     4.12   0.000     20.97207    58.97949
         22  |   37.83164   9.777071     3.87   0.000     18.65987     57.0034
         23  |   27.31644   9.838893     2.78   0.006      8.02344    46.60943
         24  |   35.92448   9.424865     3.81   0.000     17.44335    54.40561
         25  |   31.50029   9.872503     3.19   0.001     12.14139    50.85919
       1000  |   48.64359   10.10771     4.81   0.000     28.82347    68.46372
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |      2562        2562           0    *|
                    msa |       254           0         254     |
   calendar_month#state |       612          30         582     |
             year_month |       112          12         100    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/rent2br_median_last_min_event_rel_months12.png not found)
(file ../output/rent2br_median_last_min_event_rel_months12.png written in PNG f
> ormat)
(dropped 8 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =     92,442
Absorbing 4 HDFE groups                           F(  26,   2380) =       4.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9860
                                                  Adj R-squared   =     0.9855
                                                  Within R-sq.    =     0.0330
Number of clusters (zipcode) =      2,381         Root MSE        =     0.0967

                            (Std. Err. adjusted for 2,381 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
rent2br_ps~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
last_min_~12 |
          0  |  -.0553779   .0165543    -3.35   0.001    -.0878403   -.0229155
          1  |   .0079763   .0119581     0.67   0.505    -.0154731    .0314257
          2  |   .0056828   .0117057     0.49   0.627    -.0172717    .0286373
          3  |   .0069408   .0118507     0.59   0.558    -.0162979    .0301796
          4  |  -.0128907   .0124787    -1.03   0.302    -.0373611    .0115796
          5  |  -.0153235   .0112484    -1.36   0.173    -.0373811    .0067342
          6  |  -.0178589   .0107486    -1.66   0.097    -.0389365    .0032186
          7  |   .0040058   .0105545     0.38   0.704    -.0166911    .0247027
          8  |   .0121228   .0098715     1.23   0.220    -.0072348    .0314805
          9  |   .0071652   .0087957     0.81   0.415    -.0100829    .0244133
         10  |   .0005069   .0087992     0.06   0.954     -.016748    .0177618
         11  |   .0012592   .0074015     0.17   0.865    -.0132548    .0157733
         13  |   .0089364   .0083567     1.07   0.285    -.0074507    .0253236
         14  |   .0247015   .0086672     2.85   0.004     .0077055    .0416975
         15  |   .0220977   .0092936     2.38   0.017     .0038733     .040322
         16  |   .0263197    .010694     2.46   0.014     .0053493    .0472902
         17  |   .0144701   .0113218     1.28   0.201    -.0077314    .0366717
         18  |    .013331    .011538     1.16   0.248    -.0092947    .0359566
         19  |   .0162917   .0122379     1.33   0.183    -.0077063    .0402898
         20  |   .0472219   .0115594     4.09   0.000     .0245543    .0698894
         21  |   .0460364   .0118106     3.90   0.000     .0228763    .0691965
         22  |   .0495865   .0115367     4.30   0.000     .0269635    .0722095
         23  |   .0464205   .0114668     4.05   0.000     .0239346    .0689065
         24  |   .0460701   .0118855     3.88   0.000     .0227632     .069377
         25  |   .0432754   .0120575     3.59   0.000     .0196311    .0669196
       1000  |   .0846187   .0125995     6.72   0.000     .0599115    .1093258
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |      2381        2381           0    *|
                    msa |       223           0         223     |
   calendar_month#state |       594          31         563     |
             year_month |       117          12         105    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/rent2br_psqft_median_last_min_event_rel_months12.png not 
> found)
(file ../output/rent2br_psqft_median_last_min_event_rel_months12.png written in
>  PNG format)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =  4,629,892
Absorbing 4 HDFE groups                           F(  26,  20990) =     115.97
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8926
                                                  Adj R-squared   =     0.8921
                                                  Within R-sq.    =     0.0022
Number of clusters (zipcode) =     20,991         Root MSE        = 46048.2972

                           (Std. Err. adjusted for 20,991 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
     zhvi2br |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
last_min_~12 |
          0  |   -2271.45   408.6992    -5.56   0.000    -3072.532   -1470.368
          1  |   -5237.69   143.5734   -36.48   0.000    -5519.105   -4956.275
          2  |   -5447.98   140.9362   -38.66   0.000    -5724.225   -5171.734
          3  |  -4839.466   128.9289   -37.54   0.000    -5092.176   -4586.755
          4  |  -3867.496   114.8173   -33.68   0.000    -4092.547   -3642.445
          5  |  -3333.644   102.5228   -32.52   0.000    -3534.597   -3132.691
          6  |  -3058.382   92.50437   -33.06   0.000    -3239.698   -2877.066
          7  |  -2714.537   79.63415   -34.09   0.000    -2870.626   -2558.448
          8  |  -2172.939    68.1816   -31.87   0.000     -2306.58   -2039.297
          9  |  -1741.312   56.11845   -31.03   0.000    -1851.309   -1631.316
         10  |   -1128.26   39.64881   -28.46   0.000    -1205.975   -1050.545
         11  |  -559.3094   20.33918   -27.50   0.000    -599.1757    -519.443
         13  |   861.6209   42.54769    20.25   0.000     778.2242    945.0177
         14  |   618.8026   52.80177    11.72   0.000     515.3071    722.2981
         15  |   1030.747   66.33358    15.54   0.000      900.728    1160.766
         16  |   1904.527    78.8688    24.15   0.000     1749.938    2059.116
         17  |   2251.391   86.91133    25.90   0.000     2081.038    2421.744
         18  |   2347.372   92.65974    25.33   0.000     2165.751    2528.992
         19  |   2682.105   99.32695    27.00   0.000     2487.416    2876.793
         20  |   2729.762   106.1778    25.71   0.000     2521.645    2937.879
         21  |   2814.869   114.2365    24.64   0.000     2590.957    3038.781
         22  |   3166.527   123.3511    25.67   0.000     2924.749    3408.304
         23  |   3630.085   134.3521    27.02   0.000     3366.745    3893.426
         24  |   4120.498    141.924    29.03   0.000     3842.316     4398.68
         25  |   4661.571   158.2842    29.45   0.000     4351.322     4971.82
       1000  |  -8266.892   467.0978   -17.70   0.000    -9182.439   -7351.344
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |     20991       20991           0    *|
                    msa |       859           0         859     |
   calendar_month#state |       612           8         604     |
             year_month |       285          12         273    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/zhvi2br_last_min_event_rel_months12.png not found)
(file ../output/zhvi2br_last_min_event_rel_months12.png written in PNG format)
(MWFE estimator converged in 8 iterations)

HDFE Linear regression                            Number of obs   =    106,315
Absorbing 4 HDFE groups                           F(  50,   2561) =       2.86
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9840
                                                  Adj R-squared   =     0.9835
                                                  Within R-sq.    =     0.0282
Number of clusters (zipcode) =      2,562         Root MSE        =   112.9104

                            (Std. Err. adjusted for 2,562 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
rent2br_me~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
last_min_~24 |
          0  |  -100.5151     18.439    -5.45   0.000    -136.6719   -64.35818
          1  |  -46.58544   15.02321    -3.10   0.002    -76.04431   -17.12657
          2  |  -47.33304   16.01223    -2.96   0.003    -78.73128    -15.9348
          3  |    -32.635   15.08151    -2.16   0.031    -62.20819   -3.061809
          4  |  -36.84371    14.6691    -2.51   0.012    -65.60822   -8.079214
          5  |  -39.27195   13.71888    -2.86   0.004    -66.17318   -12.37073
          6  |  -34.43965   13.94211    -2.47   0.014     -61.7786   -7.100699
          7  |   -49.2344   13.99418    -3.52   0.000    -76.67546   -21.79333
          8  |  -61.67617   13.92054    -4.43   0.000    -88.97283   -34.37951
          9  |  -52.38272   13.30827    -3.94   0.000    -78.47879   -26.28666
         10  |  -47.58784   12.45655    -3.82   0.000    -72.01376   -23.16192
         11  |  -44.32377   12.31354    -3.60   0.000    -68.46928   -20.17827
         12  |  -44.32124   12.52512    -3.54   0.000    -68.88164   -19.76085
         13  |    -37.779   12.08742    -3.13   0.002    -61.48112   -14.07689
         14  |  -29.99595   12.19053    -2.46   0.014    -53.90026    -6.09165
         15  |  -24.40674   12.70008    -1.92   0.055    -49.31021    .4967335
         16  |  -24.84937   12.94845    -1.92   0.055    -50.23987    .5411263
         17  |  -33.82314   12.05361    -2.81   0.005    -57.45895   -10.18732
         18  |  -37.76496   10.53854    -3.58   0.000    -58.42989   -17.10004
         19  |  -7.586056   9.892705    -0.77   0.443    -26.98457    11.81246
         20  |   .9560372   8.970381     0.11   0.915     -16.6339    18.54597
         21  |  -.2795558   8.231554    -0.03   0.973    -16.42073    15.86162
         22  |  -.8548789   7.910228    -0.11   0.914    -16.36597    14.65621
         23  |    5.23182   6.383923     0.82   0.413    -7.286355       17.75
         25  |   13.57049   6.955543     1.95   0.051    -.0685726    27.20955
         26  |   18.22166   7.701358     2.37   0.018     3.120137    33.32318
         27  |   27.05688   8.369509     3.23   0.001     10.64519    43.46858
         28  |   36.31984   8.864494     4.10   0.000     18.93754    53.70215
         29  |   28.97568   8.942576     3.24   0.001     11.44026    46.51109
         30  |    18.6535   8.695898     2.15   0.032     1.601796    35.70521
         31  |   16.53111   9.600152     1.72   0.085     -2.29374    35.35596
         32  |   30.73259   9.946649     3.09   0.002     11.22829    50.23688
         33  |   35.01398   9.783068     3.58   0.000     15.83045    54.19751
         34  |   33.64116   9.828838     3.42   0.001     14.36788    52.91444
         35  |   23.51849   9.884854     2.38   0.017     4.135367     42.9016
         36  |    31.5983   9.313303     3.39   0.001     13.33593    49.86067
         37  |   30.29863   9.647327     3.14   0.002     11.38127    49.21598
         38  |   38.53062    9.93747     3.88   0.000     19.04433    58.01692
         39  |     36.843   9.766897     3.77   0.000     17.69119    55.99482
         40  |   36.83597   9.684458     3.80   0.000      17.8458    55.82613
         41  |   33.76407   9.821539     3.44   0.001      14.5051    53.02303
         42  |   29.73709   9.937898     2.99   0.003     10.24996    49.22422
         43  |   30.27032   10.26877     2.95   0.003     10.13438    50.40626
         44  |    39.2632   10.38925     3.78   0.000     18.89102    59.63539
         45  |   37.30344   10.37758     3.59   0.000     16.95414    57.65274
         46  |   40.33571   10.55044     3.82   0.000     19.64745    61.02396
         47  |    44.2575   10.72478     4.13   0.000     23.22738    65.28763
         48  |   43.44764   10.35397     4.20   0.000     23.14463    63.75064
         49  |   57.33639   10.67388     5.37   0.000     36.40609     78.2667
       1000  |    50.2995   11.03533     4.56   0.000     28.66042    71.93859
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |      2562        2562           0    *|
                    msa |       254           0         254     |
   calendar_month#state |       612          30         582     |
             year_month |       112          12         100    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/rent2br_median_last_min_event_rel_months24.png not found)
(file ../output/rent2br_median_last_min_event_rel_months24.png written in PNG f
> ormat)
(dropped 8 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =     92,442
Absorbing 4 HDFE groups                           F(  50,   2380) =       3.36
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9861
                                                  Adj R-squared   =     0.9856
                                                  Within R-sq.    =     0.0393
Number of clusters (zipcode) =      2,381         Root MSE        =     0.0964

                            (Std. Err. adjusted for 2,381 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
rent2br_ps~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
last_min_~24 |
          0  |  -.0827177   .0215303    -3.84   0.000    -.1249378   -.0404976
          1  |  -.0204726   .0174704    -1.17   0.241    -.0547314    .0137862
          2  |  -.0294614    .018369    -1.60   0.109    -.0654822    .0065595
          3  |  -.0256698    .018418    -1.39   0.164    -.0617867    .0104471
          4  |  -.0341324   .0168024    -2.03   0.042    -.0670812   -.0011836
          5  |  -.0326008    .014994    -2.17   0.030    -.0620034   -.0031981
          6  |  -.0262255   .0153591    -1.71   0.088    -.0563441    .0038932
          7  |     -.0154   .0153109    -1.01   0.315     -.045424    .0146241
          8  |  -.0241659   .0134972    -1.79   0.074    -.0506333    .0023016
          9  |  -.0387168   .0144511    -2.68   0.007     -.067055   -.0103787
         10  |  -.0184778   .0144197    -1.28   0.200    -.0467543    .0097987
         11  |  -.0046782   .0148728    -0.31   0.753    -.0338431    .0244868
         12  |  -.0062711   .0128801    -0.49   0.626    -.0315285    .0189863
         13  |   .0125531   .0119443     1.05   0.293    -.0108693    .0359755
         14  |   .0046051   .0116135     0.40   0.692    -.0181685    .0273787
         15  |   .0052445   .0119356     0.44   0.660    -.0181609    .0286498
         16  |  -.0138555   .0124658    -1.11   0.266    -.0383005    .0105895
         17  |  -.0139532   .0114604    -1.22   0.224    -.0364266    .0085202
         18  |  -.0162956   .0107854    -1.51   0.131    -.0374454    .0048542
         19  |   .0035152   .0105559     0.33   0.739    -.0171845    .0242149
         20  |   .0091939   .0097759     0.94   0.347    -.0099762    .0283641
         21  |   .0040683   .0087736     0.46   0.643    -.0131364     .021273
         22  |  -.0012478   .0087975    -0.14   0.887    -.0184994    .0160039
         23  |   .0009484   .0074151     0.13   0.898    -.0135922    .0154891
         25  |    .010176   .0084147     1.21   0.227    -.0063249    .0266769
         26  |   .0204378   .0086086     2.37   0.018     .0035566     .037319
         27  |   .0182588    .009258     1.97   0.049     .0001042    .0364134
         28  |   .0221785   .0107066     2.07   0.038     .0011834    .0431737
         29  |   .0114582   .0114679     1.00   0.318    -.0110299    .0339463
         30  |   .0107565   .0116742     0.92   0.357    -.0121362    .0336493
         31  |   .0138109   .0121949     1.13   0.258    -.0101028    .0377246
         32  |   .0394399   .0113972     3.46   0.001     .0170905    .0617893
         33  |   .0386548   .0117323     3.29   0.001     .0156483    .0616614
         34  |   .0432276   .0115333     3.75   0.000     .0206112     .065844
         35  |   .0416582   .0114315     3.64   0.000     .0192415     .064075
         36  |   .0421256   .0118807     3.55   0.000     .0188279    .0654232
         37  |   .0418543   .0120844     3.46   0.001     .0181573    .0655513
         38  |   .0480173   .0117635     4.08   0.000     .0249495     .071085
         39  |   .0525636   .0120638     4.36   0.000     .0289069    .0762203
         40  |   .0496009   .0124835     3.97   0.000     .0251213    .0740805
         41  |   .0583638   .0129119     4.52   0.000      .033044    .0836835
         42  |   .0609942    .012894     4.73   0.000     .0357096    .0862788
         43  |   .0637569   .0130355     4.89   0.000     .0381948     .089319
         44  |   .0656876   .0126231     5.20   0.000     .0409342    .0904409
         45  |   .0688916   .0127507     5.40   0.000      .043888    .0938953
         46  |   .0735633    .013034     5.64   0.000     .0480041    .0991226
         47  |   .0770293   .0128436     6.00   0.000     .0518434    .1022152
         48  |   .0789511   .0130776     6.04   0.000     .0533065    .1045957
         49  |   .0920264   .0133056     6.92   0.000     .0659346    .1181181
       1000  |   .0931893   .0133807     6.96   0.000     .0669502    .1194285
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |      2381        2381           0    *|
                    msa |       223           0         223     |
   calendar_month#state |       594          31         563     |
             year_month |       117          12         105    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/rent2br_psqft_median_last_min_event_rel_months24.png not 
> found)
(file ../output/rent2br_psqft_median_last_min_event_rel_months24.png written in
>  PNG format)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =  4,629,892
Absorbing 4 HDFE groups                           F(  50,  20990) =      85.74
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8933
                                                  Adj R-squared   =     0.8928
                                                  Within R-sq.    =     0.0087
Number of clusters (zipcode) =     20,991         Root MSE        = 45898.3934

                           (Std. Err. adjusted for 20,991 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
     zhvi2br |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
last_min_~24 |
          0  |   737.7818    460.647     1.60   0.109    -165.1219    1640.685
          1  |  -8624.249   264.0979   -32.66   0.000    -9141.902   -8106.597
          2  |  -9493.722   269.8728   -35.18   0.000    -10022.69    -8964.75
          3  |  -9150.876   260.8301   -35.08   0.000    -9662.123   -8639.629
          4  |  -8463.903   248.6831   -34.03   0.000    -8951.341   -7976.465
          5  |   -8226.08   239.9907   -34.28   0.000     -8696.48   -7755.679
          6  |   -8333.02   235.7521   -35.35   0.000    -8795.112   -7870.928
          7  |  -8081.002   220.6395   -36.63   0.000    -8513.472   -7648.531
          8  |  -7746.788   210.0346   -36.88   0.000    -8158.472   -7335.104
          9  |  -7328.817   199.2682   -36.78   0.000    -7719.398   -6938.236
         10  |  -6867.581   188.1972   -36.49   0.000    -7236.462     -6498.7
         11  |   -6370.06   178.7604   -35.63   0.000    -6720.444   -6019.676
         12  |  -5834.419   167.1967   -34.90   0.000    -6162.138   -5506.701
         13  |   -5212.92   146.1032   -35.68   0.000    -5499.294   -4926.547
         14  |  -5824.396   146.1517   -39.85   0.000    -6110.865   -5537.928
         15  |  -5074.869   132.4861   -38.30   0.000    -5334.552   -4815.186
         16  |  -3954.544   117.2661   -33.72   0.000    -4184.395   -3724.694
         17  |    -3388.5   105.2941   -32.18   0.000    -3594.885   -3182.116
         18  |  -2985.513     94.477   -31.60   0.000    -3170.695   -2800.331
         19  |   -3227.63   84.85677   -38.04   0.000    -3393.956   -3061.304
         20  |  -2702.714   72.82467   -37.11   0.000    -2845.456   -2559.972
         21  |  -2109.799    58.9312   -35.80   0.000    -2225.309   -1994.289
         22  |  -1356.833   41.33469   -32.83   0.000    -1437.852   -1275.814
         23  |  -718.6489   21.21996   -33.87   0.000    -760.2416   -677.0562
         25  |  -150.7915   39.76664    -3.79   0.000    -228.7372   -72.84582
         26  |  -1124.423   70.16234   -16.03   0.000    -1261.946   -986.8992
         27  |   -547.553   77.41136    -7.07   0.000    -699.2853   -395.8208
         28  |   402.5582   83.83469     4.80   0.000     238.2357    566.8806
         29  |   847.3934   89.40694     9.48   0.000     672.1489    1022.638
         30  |   1003.674   95.90806    10.46   0.000     815.6869    1191.661
         31  |   1199.801   99.89758    12.01   0.000     1003.994    1395.608
         32  |   1203.774   109.4232    11.00   0.000     989.2963    1418.252
         33  |   1466.997    117.105    12.53   0.000     1237.462    1696.531
         34  |   1827.803   124.7826    14.65   0.000     1583.219    2072.386
         35  |   2400.204   134.6745    17.82   0.000     2136.232    2664.177
         36  |   3001.671   141.4075    21.23   0.000     2724.501     3278.84
         37  |   3471.655   157.3187    22.07   0.000     3163.298    3780.012
         38  |    2422.87   160.4254    15.10   0.000     2108.424    2737.317
         39  |   2766.129   167.0741    16.56   0.000     2438.651    3093.607
         40  |   3778.132   173.8776    21.73   0.000     3437.318    4118.945
         41  |   4377.643   179.6099    24.37   0.000     4025.594    4729.693
         42  |   4627.639    182.146    25.41   0.000     4270.618    4984.659
         43  |   5057.641   187.8896    26.92   0.000     4689.363    5425.919
         44  |   5062.429   191.0123    26.50   0.000     4688.031    5436.828
         45  |   5336.335    196.086    27.21   0.000     4951.991    5720.679
         46  |   5850.463   203.4173    28.76   0.000     5451.749    6249.176
         47  |   6364.166   210.7449    30.20   0.000     5951.089    6777.242
         48  |   6960.902   218.5425    31.85   0.000     6532.542    7389.262
         49  |   7481.848   235.0197    31.83   0.000     7021.191    7942.504
       1000  |  -14540.91   609.3599   -23.86   0.000     -15735.3   -13346.51
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |     20991       20991           0    *|
                    msa |       859           0         859     |
   calendar_month#state |       612           8         604     |
             year_month |       285          12         273    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/zhvi2br_last_min_event_rel_months24.png not found)
(file ../output/zhvi2br_last_min_event_rel_months24.png written in PNG format)

. 
end of do-file


Execute:  StataMP-64 /e do "./event_study.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./event_study.do 

. clear all

. set more off

. adopath + ../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/mental_coupons/ado"

. adopath + ../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/mental_coupons/ado"
  [8]              "../../lib/stata/gslab_misc/ado"

. adopath + ../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../lib/stata/mental_coupons/ado"
  [8]              "../../lib/stata/gslab_misc/ado"
  [9]              "../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         use ../temp/zipcode_year_month_panel.dta, clear
  2. 
.         foreach window in 12 24 {
  3.                 create_event_plot, depvar(rent2br_median) event_var(rel_mo
> nths_min_event`window')      ///
>                         controls(" ") window(`window') ///
>                         absorb(zipcode msa calendar_month##state year_month)
  4. 
.                 create_event_plot, depvar(rent2br_psqft_median) event_var(rel
> _months_min_event`window')      ///
>                         controls(" ") window(`window') ///
>                         absorb(zipcode msa calendar_month##state year_month)
  5. 
.                 create_event_plot, depvar(zhvi2br) event_var(rel_months_min_e
> vent`window')      ///
>                         controls(" ") window(`window') ///
>                         absorb(zipcode msa calendar_month##state year_month)
  6.         }
  7. end

. 
. main
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =    106,315
Absorbing 4 HDFE groups                           F(  25,   2561) =       3.02
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9836
                                                  Adj R-squared   =     0.9830
                                                  Within R-sq.    =     0.0040
Number of clusters (zipcode) =      2,562         Root MSE        =   114.2907

                            (Std. Err. adjusted for 2,562 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
rent2br_me~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
rel_month~12 |
          1  |  -10.16174   11.68475    -0.87   0.385    -33.07425    12.75078
          2  |  -11.58554   11.14634    -1.04   0.299    -33.44228    10.27121
          3  |   -4.99894   11.66375    -0.43   0.668    -27.87029    17.87241
          4  |  -5.396079   11.58811    -0.47   0.642     -28.1191    17.32694
          5  |  -.6986448   10.52916    -0.07   0.947    -21.34517    19.94788
          6  |  -1.380373   9.186401    -0.15   0.881     -19.3939    16.63316
          7  |  -8.039743   9.181425    -0.88   0.381    -26.04351    9.964028
          8  |  -13.97757   9.158827    -1.53   0.127    -31.93703    3.981886
          9  |    1.07144    8.59089     0.12   0.901    -15.77436    17.91724
         10  |  -4.454282   7.870445    -0.57   0.571    -19.88736     10.9788
         11  |  -.9629255   6.364565    -0.15   0.880    -13.44314    11.51729
         13  |  -13.99374   6.265873    -2.23   0.026    -26.28044   -1.707052
         14  |  -4.349303   7.627452    -0.57   0.569     -19.3059     10.6073
         15  |    4.21678   7.736535     0.55   0.586    -10.95372    19.38728
         16  |  -.4144239   7.331939    -0.06   0.955    -14.79156    13.96271
         17  |   4.010231   9.198537     0.44   0.663    -14.02709    22.04756
         18  |   20.83999   10.46738     1.99   0.047     .3146075    41.36537
         19  |   32.03157   10.76505     2.98   0.003     10.92249    53.14066
         20  |   29.53269   10.43837     2.83   0.005     9.064185    50.00119
         21  |   25.99843   10.04236     2.59   0.010     6.306458    45.69041
         22  |   24.20032    9.91938     2.44   0.015     4.749498    43.65114
         23  |   18.76281   10.62417     1.77   0.078    -2.070017    39.59564
         24  |   26.07903   10.54987     2.47   0.014     5.391892    46.76617
         25  |   29.10099      10.46     2.78   0.005     8.590077    49.61191
       1000  |   43.40366   9.292853     4.67   0.000     25.18139    61.62593
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |      2562        2562           0    *|
                    msa |       254           0         254     |
   calendar_month#state |       612          30         582     |
             year_month |       112          12         100    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/rent2br_median_rel_months_min_event12.png not found)
(file ../output/rent2br_median_rel_months_min_event12.png written in PNG format
> )
(dropped 8 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =     92,442
Absorbing 4 HDFE groups                           F(  25,   2380) =       3.69
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9856
                                                  Adj R-squared   =     0.9851
                                                  Within R-sq.    =     0.0068
Number of clusters (zipcode) =      2,381         Root MSE        =     0.0980

                            (Std. Err. adjusted for 2,381 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
rent2br_ps~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
rel_month~12 |
          1  |  -.0094198   .0146373    -0.64   0.520     -.038123    .0192834
          2  |  -.0074097   .0157125    -0.47   0.637    -.0382212    .0234018
          3  |  -.0062583   .0144771    -0.43   0.666    -.0346473    .0221306
          4  |  -.0239936   .0152397    -1.57   0.116    -.0538781    .0058908
          5  |  -.0195956    .014953    -1.31   0.190    -.0489179    .0097267
          6  |   -.013849   .0121438    -1.14   0.254    -.0376625    .0099645
          7  |  -.0035139   .0124729    -0.28   0.778    -.0279728    .0209449
          8  |  -.0183338   .0109547    -1.67   0.094    -.0398156     .003148
          9  |  -.0197653   .0109216    -1.81   0.070     -.041182    .0016515
         10  |  -.0192572   .0100768    -1.91   0.056    -.0390174    .0005031
         11  |  -.0105523   .0091957    -1.15   0.251    -.0285848    .0074802
         13  |  -.0016976   .0084193    -0.20   0.840    -.0182076    .0148123
         14  |  -.0121901   .0096211    -1.27   0.205    -.0310567    .0066764
         15  |  -.0103302   .0101372    -1.02   0.308    -.0302088    .0095484
         16  |  -.0173523   .0098916    -1.75   0.080    -.0367493    .0020447
         17  |  -.0095325     .00965    -0.99   0.323    -.0284558    .0093908
         18  |   .0076747    .011321     0.68   0.498    -.0145252    .0298747
         19  |   .0019937    .011744     0.17   0.865    -.0210359    .0250232
         20  |    .006931   .0107132     0.65   0.518    -.0140771    .0279391
         21  |   .0196952   .0106848     1.84   0.065    -.0012573    .0406478
         22  |    .012871   .0110968     1.16   0.246    -.0088894    .0346315
         23  |   .0066341   .0108631     0.61   0.541     -.014668    .0279362
         24  |   .0151198   .0107425     1.41   0.159    -.0059457    .0361854
         25  |   .0185267   .0109974     1.68   0.092    -.0030389    .0400922
       1000  |   .0486995   .0108389     4.49   0.000     .0274449    .0699541
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |      2381        2381           0    *|
                    msa |       223           0         223     |
   calendar_month#state |       594          31         563     |
             year_month |       117          12         105    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/rent2br_psqft_median_rel_months_min_event12.png not found
> )
(file ../output/rent2br_psqft_median_rel_months_min_event12.png written in PNG 
> format)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =  4,629,892
Absorbing 4 HDFE groups                           F(  25,  20990) =      89.72
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8925
                                                  Adj R-squared   =     0.8920
                                                  Within R-sq.    =     0.0012
Number of clusters (zipcode) =     20,991         Root MSE        = 46072.5249

                           (Std. Err. adjusted for 20,991 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
     zhvi2br |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
rel_month~12 |
          1  |  -3598.264   114.6357   -31.39   0.000    -3822.959   -3373.569
          2  |  -3387.161   116.5383   -29.06   0.000    -3615.585   -3158.737
          3  |  -3036.599   108.1484   -28.08   0.000    -3248.578   -2824.619
          4  |  -2307.653   96.39848   -23.94   0.000    -2496.601   -2118.704
          5  |  -1959.353    89.9212   -21.79   0.000    -2135.605     -1783.1
          6  |  -1726.569   83.15209   -20.76   0.000    -1889.554   -1563.585
          7  |  -1204.567   72.18755   -16.69   0.000     -1346.06   -1063.074
          8  |  -1304.562   65.49577   -19.92   0.000    -1432.939   -1176.185
          9  |  -1072.793   53.44205   -20.07   0.000    -1177.543    -968.042
         10  |   -556.433   38.39706   -14.49   0.000    -631.6942   -481.1718
         11  |  -331.2167   19.34662   -17.12   0.000    -369.1376   -293.2958
         13  |   481.5311   32.77739    14.69   0.000     417.2849    545.7773
         14  |   875.0328   38.87414    22.51   0.000     798.8365    951.2291
         15  |   1303.549   52.13829    25.00   0.000     1201.354    1405.744
         16  |   2149.529    70.1344    30.65   0.000      2012.06    2286.998
         17  |   2680.473     90.389    29.65   0.000     2503.304    2857.643
         18  |   2780.964   100.0989    27.78   0.000     2584.762    2977.165
         19  |   3443.668   109.5208    31.44   0.000     3228.999    3658.337
         20  |   3726.149    119.746    31.12   0.000     3491.438     3960.86
         21  |   4101.427    127.146    32.26   0.000     3852.211    4350.643
         22  |   4690.324   139.0205    33.74   0.000     4417.833    4962.815
         23  |    5039.72   149.8706    33.63   0.000     4745.962    5333.478
         24  |   5260.626     157.58    33.38   0.000     4951.757    5569.495
         25  |    5055.52   163.5553    30.91   0.000     4734.939    5376.101
       1000  |   5362.997    203.041    26.41   0.000     4965.021    5760.973
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |     20991       20991           0    *|
                    msa |       859           0         859     |
   calendar_month#state |       612           8         604     |
             year_month |       285          12         273    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/zhvi2br_rel_months_min_event12.png not found)
(file ../output/zhvi2br_rel_months_min_event12.png written in PNG format)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =    106,315
Absorbing 4 HDFE groups                           F(  49,   2561) =       2.58
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9837
                                                  Adj R-squared   =     0.9831
                                                  Within R-sq.    =     0.0104
Number of clusters (zipcode) =      2,562         Root MSE        =   113.9388

                            (Std. Err. adjusted for 2,562 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
rent2br_me~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
rel_month~24 |
          1  |  -41.39048   16.88851    -2.45   0.014    -74.50701   -8.273956
          2  |  -14.92641   15.80566    -0.94   0.345    -45.91959    16.06677
          3  |  -15.39811   15.41793    -1.00   0.318    -45.63099    14.83477
          4  |  -23.77762   15.43288    -1.54   0.124     -54.0398    6.484565
          5  |   -23.1415   15.08711    -1.53   0.125    -52.72568    6.442685
          6  |  -14.74602   14.35893    -1.03   0.305    -42.90231    13.41027
          7  |  -24.38558   15.13678    -1.61   0.107    -54.06715    5.295993
          8  |  -15.64665   14.45451    -1.08   0.279    -43.99037    12.69707
          9  |  -20.99301   14.47705    -1.45   0.147    -49.38091    7.394897
         10  |  -17.20352   13.27403    -1.30   0.195    -43.23245    8.825405
         11  |   -5.88043   12.37602    -0.48   0.635    -30.14846     18.3876
         12  |  -3.464325    11.2331    -0.31   0.758    -25.49122    18.56257
         13  |  -21.14002   12.03656    -1.76   0.079    -44.74239    2.462355
         14  |  -19.41694   11.75055    -1.65   0.099    -42.45848    3.624598
         15  |  -12.16432   12.27238    -0.99   0.322    -36.22911    11.90047
         16  |  -12.93139   12.17636    -1.06   0.288    -36.80789    10.94512
         17  |  -7.747832   11.05086    -0.70   0.483    -29.41736     13.9217
         18  |  -7.667618   9.687874    -0.79   0.429    -26.66448    11.32924
         19  |  -13.18446   9.657517    -1.37   0.172     -32.1218    5.752872
         20  |  -16.75398   9.778052    -1.71   0.087    -35.92768    2.419708
         21  |   -1.02047   9.190909    -0.11   0.912    -19.04284     17.0019
         22  |  -5.719953   8.319952    -0.69   0.492    -22.03447    10.59456
         23  |   -.719047   6.818557    -0.11   0.916    -14.08949     12.6514
         25  |  -16.81222   6.464935    -2.60   0.009    -29.48925   -4.135192
         26  |  -5.702616    7.93183    -0.72   0.472    -21.25607    9.850836
         27  |   4.197224   7.948757     0.53   0.598    -11.38942    19.78387
         28  |  -.7128344    7.69294    -0.09   0.926    -15.79785    14.37218
         29  |   3.121208   9.646179     0.32   0.746     -15.7939    22.03631
         30  |   19.99792   10.95208     1.83   0.068    -1.477903    41.47375
         31  |   31.89034   11.34566     2.81   0.005     9.642745    54.13793
         32  |   30.11737   11.47268     2.63   0.009     7.620706    52.61403
         33  |   31.07374   11.15983     2.78   0.005     9.190523    52.95695
         34  |   31.97881   10.99674     2.91   0.004     10.41542    53.54221
         35  |   32.71865   11.11997     2.94   0.003     10.91361     54.5237
         36  |   34.90113   11.15586     3.13   0.002      13.0257    56.77656
         37  |      31.09   11.01313     2.82   0.005     9.494457    52.68555
         38  |   50.81505   11.14364     4.56   0.000     28.96358    72.66651
         39  |   55.38805   11.47062     4.83   0.000     32.89541    77.88069
         40  |   54.85048    11.3358     4.84   0.000     32.62222    77.07874
         41  |   53.53576   11.25761     4.76   0.000     31.46081    75.61071
         42  |   51.28697   10.80894     4.74   0.000     30.09182    72.48212
         43  |   52.68363   11.30406     4.66   0.000     30.51761    74.84965
         44  |   59.08383   11.42717     5.17   0.000     36.67639    81.49127
         45  |   60.79981   11.23429     5.41   0.000      38.7706    82.82903
         46  |    61.4474   11.35292     5.41   0.000     39.18556    83.70925
         47  |   57.48368   10.95985     5.24   0.000      35.9926    78.97475
         48  |   57.06642   10.51606     5.43   0.000     36.44559    77.68725
         49  |   59.50393   11.05514     5.38   0.000       37.826    81.18185
       1000  |   54.88579   10.91137     5.03   0.000      33.4898    76.28179
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |      2562        2562           0    *|
                    msa |       254           0         254     |
   calendar_month#state |       612          30         582     |
             year_month |       112          12         100    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/rent2br_median_rel_months_min_event24.png not found)
(file ../output/rent2br_median_rel_months_min_event24.png written in PNG format
> )
(dropped 8 singleton observations)
(MWFE estimator converged in 7 iterations)

HDFE Linear regression                            Number of obs   =     92,442
Absorbing 4 HDFE groups                           F(  49,   2380) =       2.60
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9857
                                                  Adj R-squared   =     0.9852
                                                  Within R-sq.    =     0.0147
Number of clusters (zipcode) =      2,381         Root MSE        =     0.0976

                            (Std. Err. adjusted for 2,381 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
rent2br_ps~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
rel_month~24 |
          1  |   .0009575   .0211602     0.05   0.964    -.0405368    .0424518
          2  |  -.0105356   .0189665    -0.56   0.579    -.0477283     .026657
          3  |  -.0049748   .0183501    -0.27   0.786    -.0409586    .0310091
          4  |  -.0021675   .0158179    -0.14   0.891    -.0331858    .0288509
          5  |  -.0120384   .0159282    -0.76   0.450    -.0432729    .0191961
          6  |  -.0088308   .0170228    -0.52   0.604    -.0422119    .0245503
          7  |   -.011366   .0169521    -0.67   0.503    -.0446084    .0218765
          8  |  -.0086495   .0162903    -0.53   0.595    -.0405942    .0232951
          9  |  -.0147109   .0161837    -0.91   0.363    -.0464465    .0170246
         10  |  -.0068306   .0153468    -0.45   0.656    -.0369251     .023264
         11  |  -.0079896   .0156674    -0.51   0.610    -.0387129    .0227336
         12  |  -.0141944   .0149433    -0.95   0.342    -.0434977     .015109
         13  |  -.0122616   .0149846    -0.82   0.413    -.0416457    .0171226
         14  |  -.0128761    .016127    -0.80   0.425    -.0445006    .0187484
         15  |  -.0111118   .0148799    -0.75   0.455    -.0402906     .018067
         16  |  -.0284587   .0155678    -1.83   0.068    -.0589867    .0020692
         17  |  -.0235201   .0152897    -1.54   0.124    -.0535027    .0064624
         18  |   -.018078   .0125711    -1.44   0.151    -.0427294    .0065735
         19  |  -.0060181   .0126722    -0.47   0.635    -.0308678    .0188316
         20  |  -.0192425   .0112017    -1.72   0.086    -.0412086    .0027236
         21  |  -.0209292   .0110154    -1.90   0.058    -.0425299    .0006715
         22  |  -.0195836   .0102256    -1.92   0.056    -.0396356    .0004683
         23  |    -.00925   .0093501    -0.99   0.323    -.0275851    .0090851
         25  |   -.001274   .0085165    -0.15   0.881    -.0179746    .0154266
         26  |  -.0159972   .0097508    -1.64   0.101    -.0351182    .0031238
         27  |  -.0133164   .0102679    -1.30   0.195    -.0334513    .0068185
         28  |  -.0203574   .0100749    -2.02   0.043    -.0401138    -.000601
         29  |   -.013578   .0099691    -1.36   0.173     -.033127     .005971
         30  |   .0041986    .011283     0.37   0.710    -.0179269    .0263241
         31  |   .0072718   .0111733     0.65   0.515    -.0146387    .0291822
         32  |   .0115458    .011187     1.03   0.302    -.0103914    .0334831
         33  |    .019898   .0115015     1.73   0.084    -.0026561    .0424521
         34  |   .0145759   .0109463     1.33   0.183    -.0068895    .0360412
         35  |   .0161159   .0109011     1.48   0.139    -.0052608    .0374926
         36  |   .0155956   .0113665     1.37   0.170    -.0066937     .037885
         37  |    .018403    .012183     1.51   0.131    -.0054874    .0422934
         38  |   .0345838   .0121303     2.85   0.004     .0107968    .0583708
         39  |    .038882    .012227     3.18   0.001     .0149054    .0628586
         40  |    .034584   .0123532     2.80   0.005     .0103599    .0588081
         41  |   .0408897   .0121581     3.36   0.001     .0170481    .0647313
         42  |   .0414298   .0120948     3.43   0.001     .0177125    .0651472
         43  |   .0444299   .0122088     3.64   0.000     .0204889    .0683708
         44  |   .0497814   .0119457     4.17   0.000     .0263562    .0732065
         45  |   .0512046   .0121879     4.20   0.000     .0273046    .0751045
         46  |   .0527976   .0124944     4.23   0.000     .0282966    .0772985
         47  |   .0558271   .0121081     4.61   0.000     .0320836    .0795705
         48  |   .0549464   .0117495     4.68   0.000     .0319061    .0779866
         49  |   .0623166   .0122418     5.09   0.000      .038311    .0863223
       1000  |   .0715821   .0127055     5.63   0.000     .0466671    .0964971
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |      2381        2381           0    *|
                    msa |       223           0         223     |
   calendar_month#state |       594          31         563     |
             year_month |       117          12         105    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/rent2br_psqft_median_rel_months_min_event24.png not found
> )
(file ../output/rent2br_psqft_median_rel_months_min_event24.png written in PNG 
> format)
(MWFE estimator converged in 6 iterations)

HDFE Linear regression                            Number of obs   =  4,629,892
Absorbing 4 HDFE groups                           F(  49,  20990) =      40.24
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.8930
                                                  Adj R-squared   =     0.8924
                                                  Within R-sq.    =     0.0054
Number of clusters (zipcode) =     20,991         Root MSE        = 45975.3105

                           (Std. Err. adjusted for 20,991 clusters in zipcode)
------------------------------------------------------------------------------
             |               Robust
     zhvi2br |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
rel_month~24 |
          1  |  -7268.311   259.6456   -27.99   0.000    -7777.237   -6759.386
          2  |  -8337.975   282.5267   -29.51   0.000    -8891.749   -7784.201
          3  |  -8233.355   275.2123   -29.92   0.000    -8772.793   -7693.918
          4  |  -7744.814   260.2841   -29.76   0.000    -8254.991   -7234.637
          5  |  -7617.692   251.5318   -30.29   0.000    -8110.713    -7124.67
          6  |  -7439.501    241.834   -30.76   0.000    -7913.514   -6965.488
          7  |  -6668.703   217.5168   -30.66   0.000    -7095.053   -6242.353
          8  |  -6412.438   205.6261   -31.18   0.000    -6815.481   -6009.395
          9  |  -5990.253   193.2303   -31.00   0.000    -6368.999   -5611.507
         10  |  -5053.816   174.5073   -28.96   0.000    -5395.864   -4711.769
         11  |  -4767.485   167.0444   -28.54   0.000    -5094.905   -4440.065
         12  |  -4427.094   155.7478   -28.42   0.000    -4732.371   -4121.816
         13  |  -3640.345   139.9976   -26.00   0.000    -3914.751   -3365.938
         14  |  -4398.953    146.819   -29.96   0.000    -4686.729   -4111.176
         15  |  -3957.333    134.361   -29.45   0.000    -4220.691   -3693.976
         16  |   -3190.81   118.9086   -26.83   0.000    -3423.881    -2957.74
         17  |  -2781.729   109.6463   -25.37   0.000    -2996.644   -2566.814
         18  |  -2486.712    100.879   -24.65   0.000    -2684.443   -2288.981
         19  |  -1699.693   85.24422   -19.94   0.000    -1866.778   -1532.607
         20  |  -1320.277   75.14797   -17.57   0.000    -1467.573   -1172.981
         21  |  -1051.413    58.6822   -17.92   0.000    -1166.435   -936.3916
         22  |  -328.9655   43.62149    -7.54   0.000     -414.467    -243.464
         23  |  -153.6107    22.5374    -6.82   0.000    -197.7857   -109.4356
         25  |    1053.98   53.25379    19.79   0.000     949.5983    1158.361
         26  |   85.04294   42.01074     2.02   0.043     2.698662    167.3872
         27  |   547.7527    55.3872     9.89   0.000     439.1895    656.3159
         28  |    1342.12   77.03922    17.42   0.000     1191.118    1493.123
         29  |    1903.07   90.40462    21.05   0.000      1725.87     2080.27
         30  |   2148.022   106.0785    20.25   0.000       1940.1    2355.944
         31  |   2527.694   114.5193    22.07   0.000     2303.227    2752.161
         32  |   6150.218   212.6982    28.92   0.000     5733.313    6567.123
         33  |   6429.354    220.311    29.18   0.000     5997.527     6861.18
         34  |   7253.907   239.0574    30.34   0.000     6785.336    7722.478
         35  |   7486.083   246.9888    30.31   0.000     7001.966      7970.2
         36  |   8076.103   266.1586    30.34   0.000     7554.412    8597.794
         37  |    9053.72   298.6804    30.31   0.000     8468.283    9639.156
         38  |   5696.934   249.7389    22.81   0.000     5207.426    6186.441
         39  |   5944.504   259.9722    22.87   0.000     5434.939     6454.07
         40  |   6684.646   278.5873    23.99   0.000     6138.594    7230.699
         41  |    6968.89   285.6028    24.40   0.000     6409.087    7528.694
         42  |   7058.429   291.8291    24.19   0.000     6486.422    7630.437
         43  |   7112.725   287.8788    24.71   0.000     6548.461     7676.99
         44  |   7245.963   286.6815    25.28   0.000     6684.045    7807.881
         45  |   7094.645   292.1111    24.29   0.000     6522.084    7667.205
         46  |    7573.16   298.7408    25.35   0.000     6987.605    8158.715
         47  |   7767.685   306.5095    25.34   0.000     7166.903    8368.467
         48  |   8060.663   315.6371    25.54   0.000      7441.99    8679.336
         49  |   8899.735    329.288    27.03   0.000     8254.305    9545.165
       1000  |  -5153.225   462.2188   -11.15   0.000    -6059.209    -4247.24
------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------+
            Absorbed FE | Categories  - Redundant  = Num. Coefs |
------------------------+---------------------------------------|
                zipcode |     20991       20991           0    *|
                    msa |       859           0         859     |
   calendar_month#state |       612           8         604     |
             year_month |       285          12         273    ?|
----------------------------------------------------------------+
? = number of redundant parameters may be higher
* = FE nested within cluster; treated as redundant for DoF computation
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/zhvi2br_rel_months_min_event24.png not found)
(file ../output/zhvi2br_rel_months_min_event24.png written in PNG format)

. 
end of do-file

 make.py ended: 2020-03-12 19:28:41
