
 make.py started: 2022-03-22 17:06:00 C:\Users\shermo\Documents\GitHub\min_wage_rent\descriptive\estimation_samples\code 




Execute:  StataMP-64 /e do "./plot_mw.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./plot_mw.do 

. clear all

. set more off

. 
. program main
  1.     local instub "../../../drive/derived_large/estimation_samples"
  2.     local outstub "../output"
  3. 
.     use zipcode zipcode_num year_month statutory_mw ///
>         using "`instub'/zipcode_months.dta", clear
  4.     xtset zipcode_num year_month
  5.     gen pct_ch_MW = 100*(statutory_mw/L.statutory_mw - 1)
  6.     drop if missing(pct_ch_MW)
  7.     
.     plot_mw_dist, outstub(`outstub')
  8. end

. 
. program plot_mw_dist
  1.     syntax, outstub(str)
  2. 
.     keep if pct_ch_MW > 0
  3.     twoway (hist pct_ch_MW, color(navy%80) lcolor(white) lw(vthin)),      
>  ///
>         xtitle("Minimum wage increase (%)") ytitle("Relative frequency")   //
> /
>         xlabel(, labsize(small)) ylabel(, labsize(small))                  //
> /
>         graphregion(color(white)) bgcolor(white)
  4.     graph export `outstub'/pct_ch_mw_dist.png, replace 
  5.     graph export `outstub'/pct_ch_mw_dist.eps, replace
  6. 
.     twoway (hist year_month, color(navy%80) lcolor(white) lw(vthin)),       /
> //
>         xtitle("Monthly date") ytitle("Relative frequency")                 /
> //
>         xlabel(`=mofd(td(01jun2010))'(6)`=mofd(td(01dec2019))',             /
> //
>                labsize(small) angle(45))                                    /
> //
>         graphregion(color(white)) bgcolor(white)
  7.     graph export `outstub'/pct_ch_mw_date_dist.png, replace 
  8.     graph export `outstub'/pct_ch_mw_date_dist.eps, replace 
  9. end

. 
. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month
(3,316 missing values generated)
(3,316 observations deleted)
(187,097 observations deleted)
(note: file ../output/pct_ch_mw_dist.png not found)
(file ../output/pct_ch_mw_dist.png written in PNG format)
(note: file ../output/pct_ch_mw_dist.eps not found)
(file ../output/pct_ch_mw_dist.eps written in EPS format)
(note: file ../output/pct_ch_mw_date_dist.png not found)
(file ../output/pct_ch_mw_date_dist.png written in PNG format)
(note: file ../output/pct_ch_mw_date_dist.eps not found)
(file ../output/pct_ch_mw_date_dist.eps written in EPS format)

. 
end of do-file


Execute:  StataMP-64 /e do "./zillow_entry.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./zillow_entry.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local outstub "../output"
  3.     
.     local rent_var  "medrentpricepsqft_SFCC"
  4.     local target_ym "2015m1"
  5.      
.     build_entry_plot, instub(`instub') rent_var(`rent_var') ///
>         target_ym(`target_ym') geo(zipcode) geo_name(zipcode)
  6.     build_entry_plot, instub(`instub') rent_var(`rent_var') ///
>         target_ym(`target_ym') geo(county) geo_name(countyfips)
  7. end

. 
. program build_entry_plot
  1.     syntax, instub(str) rent_var(str) target_ym(str) ///
>         geo(str) geo_name(str)
  2.     
.     use "`instub'/`geo'_months.dta", clear
  3.     keep if !missing(`rent_var')
  4.     gcollapse (min) min_year_month = year_month, by(`geo_name')
  5.     
.     unique `geo_name'
  6.     local total_geo = r(N)
  7.     
.     bysort min_year_month: egen nbr_entrant = count(`geo_name')
  8.     drop `geo_name'
  9.     by min_year_month: keep if _n == 1
 10.     gen share_entrant = nbr_entrant/`total_geo'
 11.     gen cum_share_entrant = sum(share_entrant)
 12.     
.     sum cum_share_entrant if min_year_month >= `=tm(`target_ym')'
 13.     local cum_share_at_target = r(min)
 14.     local cum_share_at_target : di %6.3f `cum_share_at_target'
 15.     
.     label var nbr_entrant        "Number of entrants"
 16.     label var cum_share_entrant  "Cumulative share of entrants"
 17.     label var min_year_month     "Monthly date"
 18.     
.     twoway (line nbr_entrant min_year_month, yaxis(1)) ///
>            (line cum_share_entrant min_year_month, yaxis(2)), ///
>         text(0.8 `=tm(`target_ym')' "`cum_share_at_target'", yaxis(2)) ///
>         xline(`=tm(`target_ym')') legend(row(2)) ///
>         graphregion(color(white)) bgcolor(white)
 19.     graph export "../output/`geo'_entrants.png", replace
 20. end

. 
. main
(0 observations deleted)
Number of unique values of zipcode is  3316
Number of records is  3316
(3,214 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cum_share_~t |         45    .6910736    .2417033   .4056092          1
(note: file ../output/zipcode_entrants.png not found)
(file ../output/zipcode_entrants.png written in PNG format)
(0 observations deleted)
Number of unique values of countyfips is  703
Number of records is  703
(608 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cum_share_~t |         42    .8295739    .1264094   .6642959          1
(note: file ../output/county_entrants.png not found)
(file ../output/county_entrants.png written in PNG format)

. 
end of do-file


Execute:  StataMP-64 /e do "./preclean_summary_tables.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean_summary_tables.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000


. 
. program main
  1.     local instub_demo      "../../../drive/derived_large/demographics_at_b
> aseline"
  2.     local instub_irs       "../../../drive/base_large/irs_soi"
  3.     local instub_safmr     "../../../base/safmr/output"
  4.     local instub_zip_mth   "../../../drive/derived_large/zipcode_month"   
  5.     local instub_est_samp  "../../../drive/derived_large/estimation_sample
> s"    
  6. 
.     * Cross-sections
.     clean_demo, instub(`instub_demo')
  7.     save_data "../temp/demo_clean.dta",  log(none)      ///
>         key(zipcode) replace
  8.     
.     clean_irs, instub(`instub_irs')
  9.     save_data "../temp/irs_2010_clean.dta",  log(none)      ///
>         key(zipcode) replace
 10.     
.     clean_safmr, instub(`instub_safmr')
 11.     save_data "../temp/safmr_clean.dta",     log(none)      ///
>         key(zipcode countyfips cbsa year) replace
 12.     
.     keep if year == 2012
 13.     drop year
 14.     save_data "../temp/safmr_2012_clean.dta", log(none)     ///
>         key(zipcode countyfips cbsa)  replace
 15.     
.     use zipcode countyfips cbsa statefips year_month year  ///
>         month medrentprice_SFCC medrentprice_2BR           ///
>         medrentpricepsqft_* statutory_mw                   ///
>         using "`instub_zip_mth'/zipcode_month_panel.dta", clear
 16.     
.     merge m:1 zipcode using "../temp/demo_clean.dta", nogen ///
>         assert(2 3)
 17.     merge 1:1 zipcode year_month using "`instub_est_samp'/zipcode_months.d
> ta", ///
>         nogen assert(1 3) keepusing(baseline_sample)
 18. 
.     build_zip_lvl_samples, instub(`instub_est_samp')
 19.     foreach data in "all"              "all_urban"          ///
>                     "all_zillow_rents" "baseline" {
 20.         
.         use "../temp/`data'_zipcodes.dta", clear
 21.         merge 1:1 zipcode using "../temp/demo_clean.dta", nogen ///
>             assert(2 3) keep(3)
 22.         merge 1:1 zipcode using "../temp/statutory_mw_feb2010.dta",  ///
>             nogen keep(1 3)
 23.         merge 1:1 zipcode using "../temp/statutory_mw_dec2019.dta",  ///
>             nogen keep(1 3)
 24.         merge 1:1 zipcode using "../temp/rents_jan2015.dta",      ///
>             nogen keep(1 3)
 25.         merge 1:1 zipcode using "../temp/irs_2010_clean.dta",     ///
>             nogen keep(1 3)
 26.         merge 1:1 zipcode countyfips cbsa                       ///
>             using "../temp/safmr_2012_clean.dta", nogen keep(1 3)
 27.         
.         drop countyfips cbsa statefips
 28. 
.         save_data "../output/`data'_zipcode_lvl_data.dta",        ///
>             key(zipcode) replace
 29.         export delimited "../output/`data'_zipcode_lvl_data.csv", replace
 30.     }
 31.     
.     * Panel
.     use zipcode countyfips cbsa statefips year_month year month    ///
>         statutory_mw mw_wkp_tot_17 mw_res  *_SFCC  ln_rent*        ///
>         ln_emp_bizserv ln_emp_info ln_emp_fin                      ///
>         ln_estcount_bizserv ln_estcount_info ln_estcount_fin       ///
>         ln_avgwwage_bizserv ln_avgwwage_info ln_avgwwage_fin baseline_sample 
> ///
>         using "`instub_est_samp'/zipcode_months.dta", clear
 32.     
.     keep if baseline_sample == 1
 33. 
.     merge m:1 zipcode countyfips cbsa year using "../temp/safmr_clean.dta", /
> //
>         nogen keep(1 3)
 34.     
.     save_data "../output/baseline_zillow_rents_zipcode_months.dta", ///
>             key(zipcode year_month) replace
 35.     export delimited "../output/baseline_zillow_rents_zipcode_months.csv",
>  replace
 36. end

. 
. program clean_demo
  1.     syntax, instub(str) [urban_thresh(real 0.8)]
  2.     
.     use "`instub'/zipcode.dta", clear
  3. 
.     gen sh_urban_pop_2010 = 1 - sh_rural_pop_2010    if !missing(sh_rural_pop
> _2010)
  4. 
.     gen urban = (sh_urban_pop_2010 > `urban_thresh') if !missing(sh_urban_pop
> _2010)
  5.     gen rural = 1 - urban
  6. end

. 
. program clean_irs 
  1.     syntax, instub(str)
  2.     
.     use "`instub'/irs_zip.dta", clear
  3. 
.     drop if inlist(zipcode, "0", "00000")    
  4.     keep if year == 2010
  5.     
.     keep zipcode statefips share_wage_hhlds share_bussiness_hhlds /// 
>          share_farmer_hhlds agi_per_hhld wage_per_wage_hhld       ///
>          wage_per_hhld bussines_rev_per_owner
  6. end

. 
. program clean_safmr 
  1.     syntax, instub(str)
  2.     
.     use "`instub'/safmr_2012_2016_by_zipcode_county_cbsa.dta", clear
  3.     keep zipcode countyfips cbsa year safmr1br safmr2br safmr3br    
  4. end

. 
. program build_zip_lvl_samples
  1.     syntax, instub(str)
  2.     
.     preserve
  3.         keep if year == 2015 & month == 1
  4.         keep zipcode medrentprice_SFCC medrentpricepsqft_SFCC     ///
>             medrentprice_2BR medrentpricepsqft_2BR
  5.         save "../temp/rents_jan2015.dta", replace
  6.     restore
  7.     
.     preserve
  8.         keep if year == 2010 & month == 2
  9.         keep zipcode statutory_mw
 10.         rename statutory_mw statutory_mw_feb2010
 11.         save "../temp/statutory_mw_feb2010.dta", replace
 12.     restore
 13.     
.     preserve
 14.         keep if year == 2019 & month == 12
 15.         keep zipcode statutory_mw
 16.         rename statutory_mw statutory_mw_dec2019
 17.         save "../temp/statutory_mw_dec2019.dta", replace
 18.     restore
 19.     
.     preserve
 20.         keep zipcode countyfips cbsa statefips rural
 21.         duplicates drop zipcode, force
 22.         save "../temp/all_zipcodes.dta", replace
 23.     restore 
 24.     
.     preserve
 25.         keep if rural == 0
 26.         keep zipcode countyfips cbsa statefips rural
 27.         duplicates drop zipcode, force
 28.         save "../temp/all_urban_zipcodes.dta", replace
 29.     restore 
 30.     
.     preserve
 31.         keep if !missing(medrentpricepsqft_SFCC)
 32.         keep zipcode countyfips cbsa statefips rural
 33.         duplicates drop zipcode, force
 34.         save "../temp/all_zillow_rents_zipcodes.dta", replace
 35.     restore 
 36. 
.     preserve
 37.         keep if baseline_sample == 1
 38.         keep zipcode countyfips cbsa statefips rural
 39.         duplicates drop zipcode, force
 40.         save "../temp/baseline_zipcodes.dta", replace
 41.     restore 
 42. end

. 
. main
(222 missing values generated)
(222 missing values generated)
(222 missing values generated)
(data now sorted by zipcode)
  variable urban was float now byte
  variable rural was float now byte
  variable population_acs2011 was double now long
  variable n_workers_acs2011 was double now long
  variable n_mw_wkrs_statutory was double now int
  variable n_mw_wkrs_state was double now int
  variable n_mw_wkrs_fed was double now int
  (1,018,432 bytes saved)
===============================================================================
File: ../temp/demo_clean.dta
Key: zipcode
===============================================================================
  31826:27(97699):1810732878:3435753193

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
populat~2010 |     31,826    9681.695    13753.56          0     115182
n_male_~2010 |     31,826    4759.893    6725.643          0      57965
n_white~2010 |     31,826    7016.612    9524.533          0      91407
n_black~2010 |     31,826    1213.561    3811.352          0      79984
-------------+---------------------------------------------------------
urb_pop~2010 |     31,604     .390969    .4367148          0          1
n_hhlds_ce~0 |     31,826    4128.574    5580.337          0      48073
n_hhlds_ur~0 |     31,826    3258.792    5559.654          0      48073
n_hhlds_re~0 |     31,826    1274.883    2374.503          0      33601
sh_rura~2010 |     31,604     .609031    .4367148          0          1
-------------+---------------------------------------------------------
populat~2011 |     31,212    9404.425    13415.51          0     114694
n_worke~2011 |     31,212    4279.787     6232.33          0      51551
n_mw_wkrs_~y |     31,212    705.6674     1056.35          0      11010
n_mw_wkrs_~e |     31,212    705.0645    1054.671          0      11010
n_mw_wkrs_~d |     31,212    680.9874    1008.076          0      10539
-------------+---------------------------------------------------------
med_hhl~2011 |     31,168       28689    24386.72          9   225461.9
sh_whit~2010 |     31,604    .8344599    .2032514          0          1
sh_blac~2010 |     31,604    .0753265    .1550807          0          1
sh_male~2010 |     31,604    .5017386    .0423811          0          1
sh_hhlds_u~0 |     31,547    .3872851    .4356147          0          1
-------------+---------------------------------------------------------
sh_hhlds_r~0 |     31,547    .2240798    .1448693          0          1
sh_mw_wkrs~y |     30,972    .1778826    .0620079          0          1
sh_mw_wkrs~e |     30,972    .1778438    .0620143          0          1
sh_mw_wkrs~d |     30,972    .1732351    .0609171          0          1
sh_urba~2010 |     31,604     .390969    .4367148          0          1
-------------+---------------------------------------------------------
       urban |     31,604    .3056575    .4606926          0          1
       rural |     31,604    .6943425    .4606926          0          1




(note: file ../temp/demo_clean.dta not found)
file ../temp/demo_clean.dta saved
(561 observations deleted)
(279,503 observations deleted)
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../temp/irs_2010_clean.dta
Key: zipcode
===============================================================================
  27786:9(21818):3234447388:1567084687

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
   statefips |          0
agi_per_hhld |     27,786    53228.92    38257.82   5001.689    2368675
wage_per_w~d |     27,786    44242.83     22759.7   9360.238   554989.5
wage_per_h~d |     27,786     36237.6     17402.5   2959.625   351137.3
-------------+---------------------------------------------------------
bussines_r~r |     27,211    10923.95    8321.206  -42985.53   515220.8
share_wage~s |     27,786    .8224208    .0596334   .0782161          1
share_buss~s |     27,786    .1594272    .0500167          0   .6312504
share_farm~s |     27,786     .049988    .0772806          0   .6884065




(note: file ../temp/irs_2010_clean.dta not found)
file ../temp/irs_2010_clean.dta saved
(data now sorted by zipcode countyfips cbsa year)
  (0 bytes saved)
===============================================================================
File: ../temp/safmr_clean.dta
Key: zipcode countyfips cbsa year
===============================================================================
  121696:7(80564):1001697157:2638936076

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
        cbsa |          0
        year |    121,696    2014.043    1.431673       2012       2016
    safmr1br |    121,696    749.0634     270.163        310       2370
-------------+---------------------------------------------------------
    safmr2br |    121,696    926.0885    322.9981        370       2960
    safmr3br |    121,696    1237.018    434.3868        510       4090




(note: file ../temp/safmr_clean.dta not found)
file ../temp/safmr_clean.dta saved
(98,005 observations deleted)
(data now sorted by zipcode countyfips cbsa)
  (0 bytes saved)
===============================================================================
File: ../temp/safmr_2012_clean.dta
Key: zipcode countyfips cbsa
===============================================================================
  23691:6(81559):3722580878:3198509310

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
        cbsa |          0
    safmr1br |     23,691    725.2433    276.3298        370       2060
    safmr2br |     23,691    868.6003    317.7878        430       2340
-------------+---------------------------------------------------------
    safmr3br |     23,691    1138.101    416.9569        540       3340




(note: file ../temp/safmr_2012_clean.dta not found)
file ../temp/safmr_2012_clean.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         4,041,902  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                     3,843,924
        from master                 3,843,924  
        from using                          0  

    matched                           197,978  
    -----------------------------------------
(4,010,076 observations deleted)
(note: file ../temp/rents_jan2015.dta not found)
file ../temp/rents_jan2015.dta saved
(4,010,076 observations deleted)
(note: file ../temp/statutory_mw_feb2010.dta not found)
file ../temp/statutory_mw_feb2010.dta saved
(4,010,076 observations deleted)
(note: file ../temp/statutory_mw_dec2019.dta not found)
file ../temp/statutory_mw_dec2019.dta saved

Duplicates in terms of zipcode

(4,010,076 observations deleted)
(note: file ../temp/all_zipcodes.dta not found)
file ../temp/all_zipcodes.dta saved
(2,815,082 observations deleted)

Duplicates in terms of zipcode

(1,217,160 observations deleted)
(note: file ../temp/all_urban_zipcodes.dta not found)
file ../temp/all_urban_zipcodes.dta saved
(3,843,924 observations deleted)

Duplicates in terms of zipcode

(194,662 observations deleted)
(note: file ../temp/all_zillow_rents_zipcodes.dta not found)
file ../temp/all_zillow_rents_zipcodes.dta saved
(3,908,302 observations deleted)

Duplicates in terms of zipcode

(132,255 observations deleted)
(note: file ../temp/baseline_zipcodes.dta not found)
file ../temp/baseline_zipcodes.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,071
        from master                     4,071  
        from using                          0  

    matched                            27,755  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        16,078
        from master                    16,078  
        from using                          0  

    matched                            15,748  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/all_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  31826:43(35233):3277180575:3103222731

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
       rural |     31,604    .6943425    .4606926          0          1
populat~2010 |     31,826    9681.695    13753.56          0     115182
n_male_~2010 |     31,826    4759.893    6725.643          0      57965
n_white~2010 |     31,826    7016.612    9524.533          0      91407
-------------+---------------------------------------------------------
n_black~2010 |     31,826    1213.561    3811.352          0      79984
urb_pop~2010 |     31,604     .390969    .4367148          0          1
n_hhlds_ce~0 |     31,826    4128.574    5580.337          0      48073
n_hhlds_ur~0 |     31,826    3258.792    5559.654          0      48073
n_hhlds_re~0 |     31,826    1274.883    2374.503          0      33601
-------------+---------------------------------------------------------
sh_rura~2010 |     31,604     .609031    .4367148          0          1
populat~2011 |     31,212    9404.425    13415.51          0     114694
n_worke~2011 |     31,212    4279.787     6232.33          0      51551
n_mw_wkrs_~y |     31,212    705.6674     1056.35          0      11010
n_mw_wkrs_~e |     31,212    705.0645    1054.671          0      11010
-------------+---------------------------------------------------------
n_mw_wkrs_~d |     31,212    680.9874    1008.076          0      10539
med_hhl~2011 |     31,168       28689    24386.72          9   225461.9
sh_whit~2010 |     31,604    .8344599    .2032514          0          1
sh_blac~2010 |     31,604    .0753265    .1550807          0          1
sh_male~2010 |     31,604    .5017386    .0423811          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |     31,547    .3872851    .4356147          0          1
sh_hhlds_r~0 |     31,547    .2240798    .1448693          0          1
sh_mw_wkrs~y |     30,972    .1778826    .0620079          0          1
sh_mw_wkrs~e |     30,972    .1778438    .0620143          0          1
sh_mw_wkrs~d |     30,972    .1732351    .0609171          0          1
-------------+---------------------------------------------------------
sh_urba~2010 |     31,604     .390969    .4367148          0          1
       urban |     31,604    .3056575    .4606926          0          1
statuto~2010 |     31,826    7.407216    .3329186       7.25   10.09876
statuto~2019 |     31,826    8.829018    1.886564       7.25         16
medren~e_2BR |        485    1909.961    970.7352        495       6595
-------------+---------------------------------------------------------
medre~e_SFCC |      1,253    1607.497    701.1304        630       6000
medren~t_2BR |        368    1.763289    .8660091   .5687694   5.653199
medre~t_SFCC |      1,345    1.224143    1.038714   .4660688   18.86792
agi_per_hhld |     27,755    53233.43    38256.66   5001.689    2368675
wage_per_w~d |     27,755    44242.08    22737.76   9360.238   554989.5
-------------+---------------------------------------------------------
wage_per_h~d |     27,755    36237.78    17388.54   2959.625   351137.3
bussines_r~r |     27,193    10924.03    8316.472  -42985.53   515220.8
share_wage~s |     27,755    .8224265    .0595268   .0782161          1
share_buss~s |     27,755    .1594844    .0498914          0   .6312504
share_farm~s |     27,755    .0500256    .0773002          0   .6884065
-------------+---------------------------------------------------------
    safmr1br |     15,748    742.3184    281.8481        370       2060
    safmr2br |     15,748    887.2308    319.0067        490       2340
    safmr3br |     15,748    1160.834    415.8786        620       3240




(note: file ../output/all_zipcode_lvl_data.dta not found)
file ../output/all_zipcode_lvl_data.dta saved
(note: file ../output/all_zipcode_lvl_data.csv not found)
file ../output/all_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,660  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,660  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,660  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             9,660  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           744
        from master                       744  
        from using                          0  

    matched                             8,916  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,419
        from master                     1,419  
        from using                          0  

    matched                             8,241  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/all_urban_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  9660:43(35233):482443897:2512373400

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
       rural |      9,660           0           0          0          0
populat~2010 |      9,660    22626.11    17032.65          1     115182
n_male_~2010 |      9,660    11056.51    8328.874          0      57965
n_white~2010 |      9,660     15229.2    11713.33          0      91407
-------------+---------------------------------------------------------
n_black~2010 |      9,660    3270.002    6198.457          0      79984
urb_pop~2010 |      9,660    .9674524    .0545359   .8001256          1
n_hhlds_ce~0 |      9,660    9397.708    6757.354          0      48073
n_hhlds_ur~0 |      9,660    9131.908    6675.269          0      48073
n_hhlds_re~0 |      9,660    3318.455    3358.348          0      33601
-------------+---------------------------------------------------------
sh_rura~2010 |      9,660    .0325476    .0545359          0   .1998744
populat~2011 |      9,290    22186.16    16745.84          0     114694
n_worke~2011 |      9,290    10294.03    7823.929          0      51551
n_mw_wkrs_~y |      9,290     1650.88    1366.927          0      11010
n_mw_wkrs_~e |      9,290    1648.861    1363.966          0      11010
-------------+---------------------------------------------------------
n_mw_wkrs_~d |      9,290    1581.816    1292.406          0      10539
med_hhl~2011 |      9,301    49083.13    26600.11         13   225461.9
sh_whit~2010 |      9,660     .718595    .2250199          0          1
sh_blac~2010 |      9,660    .1333967    .1957751          0          1
sh_male~2010 |      9,660    .4930063    .0517709          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |      9,569    .9647843    .0647525          0          1
sh_hhlds_r~0 |      9,569    .3406666    .1844134          0          1
sh_mw_wkrs~y |      9,204    .1704054    .0871433          0          1
sh_mw_wkrs~e |      9,204    .1702757    .0871473          0          1
sh_mw_wkrs~d |      9,204    .1644929    .0864056          0          1
-------------+---------------------------------------------------------
sh_urba~2010 |      9,660    .9674524    .0545359   .8001255          1
       urban |      9,660           1           0          1          1
statuto~2010 |      9,660    7.472808    .3880585       7.25   10.09876
statuto~2019 |      9,660    9.473084    2.269937       7.25         16
medren~e_2BR |        478    1902.975      969.73        495       6595
-------------+---------------------------------------------------------
medre~e_SFCC |      1,208    1615.045    706.3366        630       6000
medren~t_2BR |        360    1.748822     .859465   .5687694   5.653199
medre~t_SFCC |      1,288    1.205448    .8174825   .4660688   6.418485
agi_per_hhld |      8,916     65176.8    57278.97   5001.689    2368675
wage_per_w~d |      8,916    53904.35    32479.78   9360.238   554989.5
-------------+---------------------------------------------------------
wage_per_h~d |      8,916    44328.87    24205.11   2959.625   351137.3
bussines_r~r |      8,873    13733.52    9849.093  -41635.98   158995.4
share_wage~s |      8,916    .8343307    .0623934   .0782161          1
share_buss~s |      8,916    .1519973    .0452228          0   .4844075
share_farm~s |      8,916    .0033006    .0087451          0   .1420476
-------------+---------------------------------------------------------
    safmr1br |      8,241    839.2622    308.2454        400       2060
    safmr2br |      8,241    995.8173    347.2054        500       2340
    safmr3br |      8,241    1301.062    451.5608        620       3240




(note: file ../output/all_urban_zipcode_lvl_data.dta not found)
file ../output/all_urban_zipcode_lvl_data.dta saved
(note: file ../output/all_urban_zipcode_lvl_data.csv not found)
file ../output/all_urban_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             9
        from master                         9  
        from using                          0  

    matched                             3,307  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           360
        from master                       360  
        from using                          0  

    matched                             2,956  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/all_zillow_rents_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  3316:43(35233):1698072878:2398195623

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
       rural |      3,298    .0582171     .234189          0          1
populat~2010 |      3,316    33687.93    14948.33          0     110682
n_male_~2010 |      3,316    16456.21    7341.985          0      53020
n_white~2010 |      3,316    22200.04    11123.57          0      91407
-------------+---------------------------------------------------------
n_black~2010 |      3,316    5231.483    7512.326          0      71202
urb_pop~2010 |      3,298    .9601275    .0945332          0          1
n_hhlds_ce~0 |      3,316    14301.71    5637.275          0      48073
n_hhlds_ur~0 |      3,316    13821.47    5719.315          0      48073
n_hhlds_re~0 |      3,316    5020.075    3321.408          0      33601
-------------+---------------------------------------------------------
sh_rura~2010 |      3,298    .0398725    .0945332          0          1
populat~2011 |      3,134    33526.55    14610.28        422     114694
n_worke~2011 |      3,134    15866.13    7020.908        194      51551
n_mw_wkrs_~y |      3,134    2405.985    1286.701         21      10539
n_mw_wkrs_~e |      3,134    2401.551      1281.1         21      10539
-------------+---------------------------------------------------------
n_mw_wkrs_~d |      3,134    2312.145    1220.811         21      10539
med_hhl~2011 |      3,189    57139.45    22946.85   8853.411   189868.7
sh_whit~2010 |      3,298    .6791784    .2089788   .0048626   .9844657
sh_blac~2010 |      3,298    .1534291    .1969505   .0023229   .9808114
sh_male~2010 |      3,298    .4888367    .0216543   .3554951   .8231398
-------------+---------------------------------------------------------
sh_hhlds_u~0 |      3,298    .9592807    .0968126          0          1
sh_hhlds_r~0 |      3,298     .340291    .1479458    .032175   .8815922
sh_mw_wkrs~y |      3,134    .1524342    .0499767   .0114365   .5270913
sh_mw_wkrs~e |      3,134     .152234    .0499782   .0114365   .5270913
sh_mw_wkrs~d |      3,134    .1471996    .0495421   .0114365   .5270913
-------------+---------------------------------------------------------
sh_urba~2010 |      3,298    .9601275    .0945332          0          1
       urban |      3,298    .9417829     .234189          0          1
statuto~2010 |      3,316     7.47653     .405294       7.25   10.09876
statuto~2019 |      3,316    9.384948    2.323413       7.25         16
medren~e_2BR |        383    1890.483    1014.196        495       6595
-------------+---------------------------------------------------------
medre~e_SFCC |      1,184    1592.807    695.0302        630       6000
medren~t_2BR |        341    1.776714    .8886875   .5687694   5.653199
medre~t_SFCC |      1,345    1.224143    1.038714   .4660688   18.86792
agi_per_hhld |      3,307    70264.37    55843.32   18965.92   736585.5
wage_per_w~d |      3,307    57777.44    34414.34    17918.5   373157.3
-------------+---------------------------------------------------------
wage_per_h~d |      3,307    47469.64    25860.23   8523.639   302129.2
bussines_r~r |      3,307    13959.97    9641.045  -9688.676   130250.2
share_wage~s |      3,307    .8328935    .0656901   .2685518    .951295
share_buss~s |      3,307    .1660188     .041824   .0519342   .3421915
share_farm~s |      3,307    .0029139    .0054401          0   .0980049
-------------+---------------------------------------------------------
    safmr1br |      2,956    878.4777    291.0567        420       1980
    safmr2br |      2,956    1039.499    334.6062        520       2340
    safmr3br |      2,956    1383.244    446.1662        690       3170




(note: file ../output/all_zillow_rents_zipcode_lvl_data.dta not found)
file ../output/all_zillow_rents_zipcode_lvl_data.dta saved
(note: file ../output/all_zillow_rents_zipcode_lvl_data.csv not found)
file ../output/all_zillow_rents_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         2  
        from using                          0  

    matched                             1,343  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           130
        from master                       130  
        from using                          0  

    matched                             1,215  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/baseline_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  1345:43(35233):3381896651:187393683

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
       rural |      1,336    .0359281    .1861807          0          1
populat~2010 |      1,345    38052.87    15415.13          0     110682
n_male_~2010 |      1,345    18544.72    7531.331          0      53020
n_white~2010 |      1,345     24638.4    11497.71          0      91407
-------------+---------------------------------------------------------
n_black~2010 |      1,345    6465.306    8930.621          0      71202
urb_pop~2010 |      1,336    .9717187    .0703948          0          1
n_hhlds_ce~0 |      1,345    16080.83    5903.241          0      48073
n_hhlds_ur~0 |      1,345    15693.95    5998.335          0      48073
n_hhlds_re~0 |      1,345    5495.526    3576.813          0      33601
-------------+---------------------------------------------------------
sh_rura~2010 |      1,336    .0282813    .0703948          0          1
populat~2011 |      1,258    37870.35     14946.5        422     114694
n_worke~2011 |      1,258    18136.86    7198.836        194      51551
n_mw_wkrs_~y |      1,258    2550.886    1253.553         21       9787
n_mw_wkrs_~e |      1,258    2548.045    1249.137         21       9787
-------------+---------------------------------------------------------
n_mw_wkrs_~d |      1,258    2469.946    1201.324         21       9787
med_hhl~2011 |      1,286    59944.08    21689.62      16481   165594.9
sh_whit~2010 |      1,336    .6673737    .1980062   .0048626   .9642324
sh_blac~2010 |      1,336    .1612541    .1939937   .0040479   .9808114
sh_male~2010 |      1,336    .4880788     .019867   .3554951    .616951
-------------+---------------------------------------------------------
sh_hhlds_u~0 |      1,336    .9708522    .0729391          0          1
sh_hhlds_r~0 |      1,336    .3328068    .1435928    .032175   .8815922
sh_mw_wkrs~y |      1,258    .1402221    .0423791   .0114365   .5270913
sh_mw_wkrs~e |      1,258    .1401205    .0424523   .0114365   .5270913
sh_mw_wkrs~d |      1,258    .1361262    .0421562   .0114365   .5270913
-------------+---------------------------------------------------------
sh_urba~2010 |      1,336    .9717187    .0703948          0          1
       urban |      1,336    .9640719    .1861807          0          1
statuto~2010 |      1,345    7.426178    .3520287       7.25       9.79
statuto~2019 |      1,345    9.214129    2.205615       7.25         16
medren~e_2BR |        302    1915.675    1036.769        495       6495
-------------+---------------------------------------------------------
medre~e_SFCC |      1,098     1598.47    704.5947        630       6000
medren~t_2BR |        281    1.806776    .9461427   .5687694   5.653199
medre~t_SFCC |      1,345    1.224143    1.038714   .4660688   18.86792
agi_per_hhld |      1,343    71150.59    53351.11   21344.37   736585.5
wage_per_w~d |      1,343    59167.87    32022.06   19957.67   318527.1
-------------+---------------------------------------------------------
wage_per_h~d |      1,343    49287.63    25170.34   10554.06   269083.4
bussines_r~r |      1,343    13372.91    9268.477  -9688.676   93661.72
share_wage~s |      1,343    .8398445    .0622921   .3109279    .951295
share_buss~s |      1,343    .1700053    .0426119   .0619388   .3283778
share_farm~s |      1,343    .0021612    .0036782          0   .0385341
-------------+---------------------------------------------------------
    safmr1br |      1,215    913.4074    274.9634        440       1940
    safmr2br |      1,215    1076.716    318.0459        560       2280
    safmr3br |      1,215    1438.551    421.3531        760       3090




(note: file ../output/baseline_zipcode_lvl_data.dta not found)
file ../output/baseline_zipcode_lvl_data.dta saved
(note: file ../output/baseline_zipcode_lvl_data.csv not found)
file ../output/baseline_zipcode_lvl_data.csv saved
(64,378 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                        63,922
        from master                    63,922  
        from using                          0  

    matched                            69,678  
    -----------------------------------------
(data now sorted by zipcode year_month)
  (0 bytes saved)
===============================================================================
File: ../output/baseline_zillow_rents_zipcode_months.dta
Key: zipcode year_month
===============================================================================
  133600:41(56902):3610025580:3517805889

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |    133,600     669.086    29.80335        601        719
        year |    133,600    2015.291    2.479625       2010       2019
       month |    133,600    6.596939    3.445591          1         12
  countyfips |          0
-------------+---------------------------------------------------------
   statefips |          0
        cbsa |          0
statutory_mw |    133,600    8.196815     1.34155       7.25         16
      mw_res |    133,600    2.092484    .1440398   1.981001   2.772589
mw_wkp_to~17 |    133,600    2.094474    .1399356   1.981055    2.69263
-------------+---------------------------------------------------------
medDailyli~C |     97,029    201.5024    133.9045         14       2234
medli~e_SFCC |    112,430    349541.3    322437.7      17800    5625000
medli~t_SFCC |    125,774    198.4998    208.4492   15.76577   2695.917
medre~e_SFCC |    114,525    1658.782    822.4141        595      30000
medre~t_SFCC |    133,600    1.233179    .9003418   .4180214       22.2
-------------+---------------------------------------------------------
Monthlylis~C |    101,193    261.4214    159.2048         18       2540
NewMonthly~C |     36,626     70.5122    36.46302         11        609
    ln_rents |    133,600    .0763131    .4611457  -.8722227   3.100092
ln_rents_1BR |     25,947    .7334506    .3990526  -.3089421   1.899293
ln_rents_2BR |     43,770    .4322217    .4338087  -.6901123   1.872875
-------------+---------------------------------------------------------
ln_rents_3BR |     48,672    .0540333    .3907662  -.6811742   1.866231
ln_rents_4BR |      7,484   -.1031694    .3857442  -.5992154   2.967022
ln_rents_5BR |        236     .720768    1.339416  -.3874369   2.972244
 ln_rents_CC |     24,735    .6346005    .4727326  -.5386367   1.918392
ln_rents_M~x |      6,241    .8752579    .5538619  -.6632233   1.900493
-------------+---------------------------------------------------------
ln_rents_M~s |     55,640     .444075    .4438746  -.6719947   1.895206
 ln_rents_SF |     99,783   -.0428344    .3731326  -.8722227   3.100092
ln_rents_S~o |     14,545    .3107219    .7543911  -.8465384   1.971606
ln_emp_biz~v |    133,600    11.14873    1.361126   5.796058   13.38876
 ln_emp_info |    132,909     9.00392    1.531522   2.397895   12.38988
-------------+---------------------------------------------------------
  ln_emp_fin |    133,576    10.20114    1.417736    4.75359   12.89542
ln_estcoun~v |    133,600    8.687532    1.241487   4.127134   10.96353
ln_estcoun~o |    133,600    6.105153     1.33047   1.386294   9.531191
ln_estcoun~n |    133,600     7.98384     1.19824   3.496508   10.33748
ln_avgwwag~v |    133,600    7.092097    .3077541   5.420535   8.432724
-------------+---------------------------------------------------------
ln_avgwwag~o |    132,909    7.274275    .3440752   5.891644   8.906665
ln_avgwwag~n |    133,576    7.248412    .3672322   6.216606   9.163982
baseline_s~e |    133,600           1           0          1          1
    safmr1br |     69,678    937.4269     273.676        440       2370
    safmr2br |     69,678    1148.645    334.2447        560       2960
-------------+---------------------------------------------------------
    safmr3br |     69,678    1561.929    452.8844        760       4090




(note: file ../output/baseline_zillow_rents_zipcode_months.dta not found)
file ../output/baseline_zillow_rents_zipcode_months.dta saved
(note: file ../output/baseline_zillow_rents_zipcode_months.csv not found)
file ../output/baseline_zillow_rents_zipcode_months.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./build_summary_tables.R" build_summary_tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(dplyr)

Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

> source("../../../lib/R/save_data.R")

Please cite as: 

 Hlavac, Marek (2018). stargazer: Well-Formatted Regression and Summary Statistics Tables.
 R package version 5.2.2. https://CRAN.R-project.org/package=stargazer 


Attaching package: 'data.table'

The following objects are masked from 'package:dplyr':

    between, first, last

> 
> main <- function() {
+   
+   ## ZIP level stats
+   all_zipcodes      <- load_data("all_zipcode_lvl_data.csv")
+   urban_zipcodes    <- load_data("all_urban_zipcode_lvl_data.csv")
+   zillow_zipcodes   <- load_data("all_zillow_rents_zipcode_lvl_data.csv")
+   baseline_zipcodes <- load_data("baseline_zipcode_lvl_data.csv")
+ 
+   all_zipcodes_stats      <- build_basic_stats(all_zipcodes)
+   urban_zipcodes_stats    <- build_basic_stats(urban_zipcodes)
+   zillow_zipcodes_stats   <- build_basic_stats(zillow_zipcodes)
+   baseline_zipcodes_stats <- build_basic_stats(baseline_zipcodes)
+   
+   zip_lvl_stats <- t(rbind(all_zipcodes_stats, urban_zipcodes_stats, 
+                            zillow_zipcodes_stats, baseline_zipcodes_stats))
+   
+   txt <- c("<tab:stats_zip_samples>")
+   writeLines(txt, "../output/stats_zip_samples.txt")
+   write.table(zip_lvl_stats, "../output/stats_zip_samples.txt", 
+               append = TRUE, sep = "\t", dec = ".",
+               row.names = FALSE, col.names = FALSE)
+   
+   ## ZIP-month stats of baseline panel
+   baseline_panel <- load_data("baseline_zillow_rents_zipcode_months.csv")
+   
+   vars_for_table <- c("statutory_mw", "mw_res", "mw_wkp_tot_17",
+                       "medrentprice_SFCC", "medrentpricepsqft_SFCC", "ln_rents", 
+                       paste0("ln_rents_", c("SF", "CC", "Studio", "1BR", "2BR", "3BR", "Mfr5Plus")), 
+                       "ln_emp_bizserv", "ln_estcount_bizserv", "ln_avgwwage_bizserv", 
+                       "ln_emp_info", "ln_estcount_info", "ln_avgwwage_info", 
+                       "ln_emp_fin", "ln_estcount_fin", "ln_avgwwage_fin")
+ 
+   txt <- c("<tab:stats_est_panel>")
+   writeLines(txt, "../output/stats_est_panel.txt")
+   for (var in vars_for_table) {
+    var_row <- build_panel_stats_row(baseline_panel, var)
+    write.table(var_row, "../output/stats_est_panel.txt",
+                append = TRUE, sep = "\t", dec = ".",
+                row.names = FALSE, col.names = FALSE)
+   }
+ }
> 
> load_data <- function(filename, instub = "../output") {
+   return(data.table::fread(file.path(instub, filename),
+                            colClasses = c(zipcode = "character")))
+ }
> 
> build_basic_stats <- function(df) {
+   df %>%
+     summarise(population_cens2010           = mean(population_cens2010, na.rm = T),
+               n_hhlds_cens2010              = mean(n_hhlds_cens2010, na.rm = T),
+               sh_urban_pop_2010             = mean(sh_urban_pop_2010, na.rm = T),
+               sh_hhlds_renteroccup_cens2010 = mean(sh_hhlds_renteroccup_cens2010, na.rm = T),
+               sh_black_cens2010             = mean(sh_black_cens2010, na.rm = T),
+               sh_white_cens2010             = mean(sh_white_cens2010, na.rm = T),
+               sh_male_cens2010              = mean(sh_male_cens2010, na.rm = T),
+               share_wage_hhlds_irs2010      = mean(share_wage_hhlds, na.rm = T),
+               share_bussiness_hhlds_irs2010 = mean(share_bussiness_hhlds, na.rm = T),
+               agi_per_hhld_irs_2010         = mean(agi_per_hhld, na.rm = T),
+               wage_per_hhld_irs2010         = mean(wage_per_hhld, na.rm = T),
+               rent40thperc_2br_safmr2012    = mean(safmr2br, na.rm = T),
+               min_binding_mw_feb2010        = min(statutory_mw_feb2010, na.rm = T),
+               avg_binding_mw_feb2010        = mean(statutory_mw_feb2010, na.rm = T),
+               max_binding_mw_feb2010        = max(statutory_mw_feb2010, na.rm = T),
+               min_binding_mw_dec2019        = min(statutory_mw_dec2019, na.rm = T),
+               avg_binding_mw_dec2019        = mean(statutory_mw_dec2019, na.rm = T),
+               max_binding_mw_dec2019        = max(statutory_mw_dec2019, na.rm = T),
+               zip_count                     = n_distinct(zipcode))
+ }
> 
> build_panel_stats_row <-  function(panel, var){
+   panel %>% 
+     summarise(across(.cols = all_of(var),
+                      .fns  = list(n    = ~ sum(!is.na(.x)), 
+                                   mean = ~ mean(.x, na.rm = T), 
+                                   sd   = ~ sd(.x, na.rm = T), 
+                                   min  = ~ min(.x, na.rm = T), 
+                                   max  = ~ max(.x, na.rm = T))))
+ }
> 
> 
> main()
> 
> proc.time()
   user  system elapsed 
   2.12    0.84    2.37 

 make.py ended: 2022-03-22 17:07:30
