
 make.py started: 2022-05-04 20:59:45 C:\Users\diegog\Desktop\Diego\min_wage_rent\descriptive\estimation_samples\code 




Execute:  StataMP-64 /e do "./plot_mw.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./plot_mw.do 

. clear all

. set more off

. 
. program main
  1.     local instub "../../../drive/derived_large/estimation_samples"
  2.     local outstub "../output"
  3. 
.     use zipcode zipcode_num year_month statutory_mw ///
>         using "`instub'/zipcode_months.dta", clear
  4.     xtset zipcode_num year_month
  5.     gen pct_ch_MW = 100*(statutory_mw/L.statutory_mw - 1)
  6.     drop if missing(pct_ch_MW)
  7.     
.     plot_mw_dist, outstub(`outstub')
  8. end

. 
. program plot_mw_dist
  1.     syntax, outstub(str)
  2. 
.     keep if pct_ch_MW > 0
  3.     twoway (hist pct_ch_MW, color(navy%80) lcolor(white) lw(vthin)),      
>  ///
>         xtitle("Minimum wage increase (%)") ytitle("Relative frequency")   //
> /
>         xlabel(, labsize(small)) ylabel(, labsize(small))                  //
> /
>         graphregion(color(white)) bgcolor(white)
  4.     graph export `outstub'/pct_ch_mw_dist.png, replace 
  5.     graph export `outstub'/pct_ch_mw_dist.eps, replace
  6. 
.     twoway (hist year_month, color(navy%80) lcolor(white) lw(vthin)),       /
> //
>         xtitle("Monthly date") ytitle("Relative frequency")                 /
> //
>         xlabel(`=mofd(td(01jun2010))'(6)`=mofd(td(01dec2019))',             /
> //
>                labsize(small) angle(45))                                    /
> //
>         graphregion(color(white)) bgcolor(white)
  7.     graph export `outstub'/pct_ch_mw_date_dist.png, replace 
  8.     graph export `outstub'/pct_ch_mw_date_dist.eps, replace 
  9. end

. 
. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(4,632 missing values generated)
(4,632 observations deleted)
(271,966 observations deleted)
(note: file ../output/pct_ch_mw_dist.png not found)
(file ../output/pct_ch_mw_dist.png written in PNG format)
(note: file ../output/pct_ch_mw_dist.eps not found)
(file ../output/pct_ch_mw_dist.eps written in EPS format)
(note: file ../output/pct_ch_mw_date_dist.png not found)
(file ../output/pct_ch_mw_date_dist.png written in PNG format)
(note: file ../output/pct_ch_mw_date_dist.eps not found)
(file ../output/pct_ch_mw_date_dist.eps written in EPS format)

. 
end of do-file


Execute:  StataMP-64 /e do "./zillow_entry.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./zillow_entry.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local outstub "../output"
  3.     
.     local rent_var  "medrentpricepsqft_SFCC"
  4.     local target_ym "2015m1"
  5.      
.     build_entry_plot, instub(`instub') rent_var(`rent_var') ///
>         target_ym(`target_ym') geo(zipcode) geo_name(zipcode)
  6.     build_entry_plot, instub(`instub') rent_var(`rent_var') ///
>         target_ym(`target_ym') geo(county) geo_name(countyfips)
  7. end

. 
. program build_entry_plot
  1.     syntax, instub(str) rent_var(str) target_ym(str) ///
>         geo(str) geo_name(str)
  2.     
.     use "`instub'/`geo'_months.dta", clear
  3.     keep if !missing(`rent_var')
  4.     gcollapse (min) min_year_month = year_month, by(`geo_name')
  5.     
.     unique `geo_name'
  6.     local total_geo = r(N)
  7.     
.     bysort min_year_month: egen nbr_entrant = count(`geo_name')
  8.     drop `geo_name'
  9.     by min_year_month: keep if _n == 1
 10.     gen share_entrant = nbr_entrant/`total_geo'
 11.     gen cum_share_entrant = sum(share_entrant)
 12.     
.     sum cum_share_entrant if min_year_month >= `=tm(`target_ym')'
 13.     local cum_share_at_target = r(min)
 14.     local cum_share_at_target : di %6.3f `cum_share_at_target'
 15.     
.     label var nbr_entrant        "Number of entrants"
 16.     label var cum_share_entrant  "Cumulative share of entrants"
 17.     label var min_year_month     "Monthly date"
 18.     
.     twoway (line nbr_entrant min_year_month, yaxis(1)) ///
>            (line cum_share_entrant min_year_month, yaxis(2)), ///
>         text(0.8 `=tm(`target_ym')' "`cum_share_at_target'", yaxis(2)) ///
>         xline(`=tm(`target_ym')') legend(row(2)) ///
>         graphregion(color(white)) bgcolor(white)
 19.     graph export "../output/`geo'_entrants.png", replace
 20. end

. 
. main
(90,412 observations deleted)
Number of unique values of zipcode is  3316
Number of records is  3316
(3,214 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cum_share_~t |         45    .6910736    .2417033   .4056092          1
(note: file ../output/zipcode_entrants.png not found)
(file ../output/zipcode_entrants.png written in PNG format)
(0 observations deleted)
Number of unique values of countyfips is  703
Number of records is  703
(608 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cum_share_~t |         42    .8295739    .1264094   .6642959          1
(note: file ../output/county_entrants.png not found)
(file ../output/county_entrants.png written in PNG format)

. 
end of do-file


Execute:  StataMP-64 /e do "./preclean_summary_tables.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean_summary_tables.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000


. 
. program main
  1.     local instub_zipcode   "../../../drive/derived_large/zipcode"
  2.     local instub_irs       "../../../drive/base_large/irs_soi"
  3.     local instub_safmr     "../../../base/safmr/output"
  4.     local instub_zip_mth   "../../../drive/derived_large/zipcode_month"   
  5.     local instub_est_samp  "../../../drive/derived_large/estimation_sample
> s"    
  6. 
.     * Cross-sections    
.     clean_irs, instub(`instub_irs')
  7.     save_data "../temp/irs_2010_clean.dta",  log(none)      ///
>         key(zipcode) replace
  8.     
.     clean_safmr, instub(`instub_safmr')
  9.     save_data "../temp/safmr_clean.dta",     log(none)      ///
>         key(zipcode countyfips cbsa year) replace
 10.     
.     keep if year == 2012
 11.     drop year
 12.     save_data "../temp/safmr_2012_clean.dta", log(none)     ///
>         key(zipcode countyfips cbsa)  replace
 13.     
.     use zipcode countyfips cbsa statefips year_month year  ///
>         month medrentprice_SFCC medrentprice_2BR           ///
>         medrentpricepsqft_* statutory_mw                   ///
>         using "`instub_zip_mth'/zipcode_month_panel.dta", clear
 14.     
.     merge m:1 zipcode using "`instub_zipcode'/zipcode_cross.dta", nogen ///
>         assert(2 3)
 15.     merge 1:1 zipcode year_month using "`instub_est_samp'/zipcode_months.d
> ta", ///
>         nogen assert(1 3) keepusing(fullbal_sample_SFCC)
 16. 
.     build_zip_lvl_samples, instub(`instub_est_samp')
 17.     foreach data in "all"              "all_urban"          ///
>                     "all_zillow_rents" "baseline" {
 18.         
.         use "../temp/`data'_zipcodes.dta", clear
 19.         merge 1:1 zipcode using "`instub_zipcode'/zipcode_cross.dta", noge
> n ///
>             assert(2 3) keep(3)
 20.         merge 1:1 zipcode using "../temp/statutory_mw_feb2010.dta",  ///
>             nogen keep(1 3)
 21.         merge 1:1 zipcode using "../temp/statutory_mw_dec2019.dta",  ///
>             nogen keep(1 3)
 22.         merge 1:1 zipcode using "../temp/rents_jan2015.dta",      ///
>             nogen keep(1 3)
 23.         merge 1:1 zipcode using "../temp/irs_2010_clean.dta",     ///
>             nogen keep(1 3)
 24.         merge 1:1 zipcode countyfips cbsa                       ///
>             using "../temp/safmr_2012_clean.dta", nogen keep(1 3)
 25.         
.         save_data "../output/`data'_zipcode_lvl_data.dta",        ///
>             key(zipcode) replace
 26.         export delimited "../output/`data'_zipcode_lvl_data.csv", replace
 27.     }
 28.     
.     * Panel
.     use zipcode countyfips cbsa statefips year_month year month    ///
>         statutory_mw mw_wkp_tot_17 mw_res  *_SFCC  ln_rent*        ///
>         mw_wkp_earn_under1250_17 mw_wkp_age_under29_17             ///
>         ln_emp_bizserv ln_emp_info ln_emp_fin                      ///
>         ln_estcount_bizserv ln_estcount_info ln_estcount_fin       ///
>         ln_avgwwage_bizserv ln_avgwwage_info ln_avgwwage_fin fullbal_sample_S
> FCC ///
>         using "`instub_est_samp'/zipcode_months.dta", clear
 29.     
.     keep if fullbal_sample_SFCC == 1
 30. 
.     merge m:1 zipcode countyfips cbsa year using "../temp/safmr_clean.dta", /
> //
>         nogen keep(1 3)
 31.     
.     save_data "../output/baseline_zillow_rents_zipcode_months.dta", ///
>             key(zipcode year_month) replace
 32.     export delimited "../output/baseline_zillow_rents_zipcode_months.csv",
>  replace
 33. end

. 
. program clean_irs 
  1.     syntax, instub(str)
  2.     
.     use "`instub'/irs_zip.dta", clear
  3. 
.     drop if inlist(zipcode, "0", "00000")    
  4.     keep if year == 2010
  5.     
.     keep zipcode statefips share_wage_hhlds share_bussiness_hhlds /// 
>          share_farmer_hhlds agi_per_hhld wage_per_wage_hhld       ///
>          wage_per_hhld bussines_rev_per_owner
  6. end

. 
. program clean_safmr 
  1.     syntax, instub(str)
  2.     
.     use "`instub'/safmr_2012_2016_by_zipcode_county_cbsa.dta", clear
  3.     keep zipcode countyfips cbsa year safmr1br safmr2br safmr3br    
  4. end

. 
. program build_zip_lvl_samples
  1.     syntax, instub(str)
  2.     
.     preserve
  3.         keep if year == 2015 & month == 1
  4.         keep zipcode medrentprice_SFCC medrentpricepsqft_SFCC     ///
>             medrentprice_2BR medrentpricepsqft_2BR
  5.         save "../temp/rents_jan2015.dta", replace
  6.     restore
  7.     
.     preserve
  8.         keep if year == 2010 & month == 2
  9.         keep zipcode statutory_mw
 10.         rename statutory_mw statutory_mw_feb2010
 11.         save "../temp/statutory_mw_feb2010.dta", replace
 12.     restore
 13.     
.     preserve
 14.         keep if year == 2019 & month == 12
 15.         keep zipcode statutory_mw
 16.         rename statutory_mw statutory_mw_dec2019
 17.         save "../temp/statutory_mw_dec2019.dta", replace
 18.     restore
 19.     
.     preserve
 20.         keep zipcode countyfips cbsa statefips urban_cbsa urban_zip
 21.         duplicates drop zipcode, force
 22.         save "../temp/all_zipcodes.dta", replace
 23.     restore 
 24.     
.     preserve
 25.         keep if urban_cbsa == 1
 26.         keep zipcode countyfips cbsa statefips urban_cbsa urban_zip
 27.         duplicates drop zipcode, force
 28.         save "../temp/all_urban_zipcodes.dta", replace
 29.     restore 
 30.     
.     preserve
 31.         keep if !missing(medrentpricepsqft_SFCC)
 32.         keep zipcode countyfips cbsa statefips urban_cbsa urban_zip
 33.         duplicates drop zipcode, force
 34.         save "../temp/all_zillow_rents_zipcodes.dta", replace
 35.     restore 
 36. 
.     preserve
 37.         keep if fullbal_sample_SFCC == 1
 38.         keep zipcode countyfips cbsa statefips urban_cbsa urban_zip
 39.         duplicates drop zipcode, force
 40.         save "../temp/baseline_zipcodes.dta", replace
 41.     restore 
 42. end

. 
. main
(561 observations deleted)
(279,503 observations deleted)
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../temp/irs_2010_clean.dta
Key: zipcode
===============================================================================
  27786:9(21818):3234447388:1567084687

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
   statefips |          0
agi_per_hhld |     27,786    53228.92    38257.82   5001.689    2368675
wage_per_w~d |     27,786    44242.83     22759.7   9360.238   554989.5
wage_per_h~d |     27,786     36237.6     17402.5   2959.625   351137.3
-------------+---------------------------------------------------------
bussines_r~r |     27,211    10923.95    8321.206  -42985.53   515220.8
share_wage~s |     27,786    .8224208    .0596334   .0782161          1
share_buss~s |     27,786    .1594272    .0500167          0   .6312504
share_farm~s |     27,786     .049988    .0772806          0   .6884065




(note: file ../temp/irs_2010_clean.dta not found)
file ../temp/irs_2010_clean.dta saved
(data now sorted by zipcode countyfips cbsa year)
  (0 bytes saved)
===============================================================================
File: ../temp/safmr_clean.dta
Key: zipcode countyfips cbsa year
===============================================================================
  121696:7(80564):1001697157:2638936076

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
        cbsa |          0
        year |    121,696    2014.043    1.431673       2012       2016
    safmr1br |    121,696    749.0634     270.163        310       2370
-------------+---------------------------------------------------------
    safmr2br |    121,696    926.0885    322.9981        370       2960
    safmr3br |    121,696    1237.018    434.3868        510       4090




(note: file ../temp/safmr_clean.dta not found)
file ../temp/safmr_clean.dta saved
(98,005 observations deleted)
(data now sorted by zipcode countyfips cbsa)
  (0 bytes saved)
===============================================================================
File: ../temp/safmr_2012_clean.dta
Key: zipcode countyfips cbsa
===============================================================================
  23691:6(81559):3722580878:3198509310

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
        cbsa |          0
    safmr1br |     23,691    725.2433    276.3298        370       2060
    safmr2br |     23,691    868.6003    317.7878        430       2340
-------------+---------------------------------------------------------
    safmr3br |     23,691    1138.101    416.9569        540       3340




(note: file ../temp/safmr_2012_clean.dta not found)
file ../temp/safmr_2012_clean.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         3,819,120  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                     3,530,730
        from master                 3,530,730  
        from using                          0  

    matched                           288,390  
    -----------------------------------------
(3,787,294 observations deleted)
(note: file ../temp/rents_jan2015.dta not found)
file ../temp/rents_jan2015.dta saved
(3,787,294 observations deleted)
(note: file ../temp/statutory_mw_feb2010.dta not found)
file ../temp/statutory_mw_feb2010.dta saved
(3,787,294 observations deleted)
(note: file ../temp/statutory_mw_dec2019.dta not found)
file ../temp/statutory_mw_dec2019.dta saved

Duplicates in terms of zipcode

(3,787,294 observations deleted)
(note: file ../temp/all_zipcodes.dta not found)
file ../temp/all_zipcodes.dta saved
(2,456,640 observations deleted)

Duplicates in terms of zipcode

(1,351,126 observations deleted)
(note: file ../temp/all_urban_zipcodes.dta not found)
file ../temp/all_urban_zipcodes.dta saved
(3,621,142 observations deleted)

Duplicates in terms of zipcode

(194,662 observations deleted)
(note: file ../temp/all_zillow_rents_zipcodes.dta not found)
file ../temp/all_zillow_rents_zipcodes.dta saved
(3,739,765 observations deleted)

Duplicates in terms of zipcode

(78,010 observations deleted)
(note: file ../temp/baseline_zipcodes.dta not found)
file ../temp/baseline_zipcodes.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,071
        from master                     4,071  
        from using                          0  

    matched                            27,755  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        16,078
        from master                    16,078  
        from using                          0  

    matched                            15,748  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/all_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  31826:130(69736):4247677520:3314428492

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
   statefips |          0
        cbsa |          0
  urban_cbsa |     31,826    .3567523    .4790483          0          1
-------------+---------------------------------------------------------
   urban_zip |     31,826    .3105008     .462706          0          1
n_census_b~s |     31,826    347.5485    355.6261          1       9067
n_blockgro~s |     31,826    10.53764    11.06662          1        101
    n_tracts |     31,826    5.120656    4.595078          1         47
    n_places |     31,826    2.566864       1.694          1         81
-------------+---------------------------------------------------------
  n_counties |     31,826    1.451643     .701879          1          7
      n_cbsa |     31,826    1.248288    .5038121          1          5
    n_states |     31,826    1.016119    .1259348          1          2
  num_houses |     31,826    4137.897    5588.921          0      48073
  population |     31,826    9700.601    13766.08          0     115182
-------------+---------------------------------------------------------
    sh_rural |     31,826    .5668876    .3567429          0          1
sh_rural_w~s |     31,574    .4790736     .363997          0          1
       tract |          0
  place_code |          0
n_months_z~s |      3,316    59.70386    34.21254         12        119
-------------+---------------------------------------------------------
populat~2010 |     31,826    9681.695    13753.56          0     115182
n_male_~2010 |     31,826    4759.893    6725.643          0      57965
n_white~2010 |     31,826    7016.612    9524.533          0      91407
n_black~2010 |     31,826    1213.561    3811.352          0      79984
urb_pop~2010 |     31,826    7812.452    13652.63          0     115182
-------------+---------------------------------------------------------
n_hhlds_ce~0 |     31,826    4128.574    5580.337          0      48073
n_hhlds_ur~0 |     31,826    3258.792    5559.654          0      48073
n_hhlds_re~0 |     31,826    1274.883    2374.503          0      33601
rural_p~2010 |     31,826    1869.243    2541.051          0      26907
populat~2011 |     31,212    9404.425    13415.51          0     114694
-------------+---------------------------------------------------------
n_worke~2011 |     31,212    4279.787     6232.33          0      51551
n_mw_wkrs_~y |     31,212    705.6674     1056.35          0      11010
n_mw_wkrs_~e |     31,212    705.0645    1054.671          0      11010
n_mw_wkrs_~d |     31,212    680.9874    1008.076          0      10539
med_hhl~2011 |     31,168       28689    24386.72          9   225461.9
-------------+---------------------------------------------------------
sh_whit~2010 |     31,604    .8344599    .2032514          0          1
sh_blac~2010 |     31,604    .0753265    .1550807          0          1
sh_male~2010 |     31,604    .5017386    .0423811          0          1
sh_urb_~2010 |     31,604     .390969    .4367148          0          1
sh_rura~2010 |     31,604     .609031    .4367148          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |     31,547    .3872851    .4356147          0          1
sh_hhlds_r~0 |     31,547    .2240798    .1448693          0          1
sh_mw_wkrs~y |     30,972    .1778826    .0620079          0          1
sh_mw_wkrs~e |     30,972    .1778438    .0620143          0          1
sh_mw_wkrs~d |     30,972    .1732351    .0609171          0          1
-------------+---------------------------------------------------------
sh_re~9_2013 |     31,603     .215515    .0462962          0          1
sh_re~4_2013 |     31,603    .5475061    .0511009          0          1
sh_re~5_2013 |     31,603    .2369789    .0527138          0          1
sh_re~0_2013 |     31,603    .2637654    .0569687          0          1
sh_residen.. |     31,603    .3736977    .0805164          0          1
-------------+---------------------------------------------------------
sh_residen.. |     31,603    .3625369    .1052486          0          1
sh_re~S_2013 |     31,603    .0877186    .0394532          0          1
sh_residen.. |     31,603    .2391548    .0543874          0          1
sh_residen.. |     31,603     .258141    .0400944          0          1
sh_r~ge_2013 |     31,603    .1994706    .0658469          0          1
-------------+---------------------------------------------------------
sh_re~f_2013 |     31,603    .1100031     .069186          0   .6666667
sh_r~il_2013 |     31,603    .1137292    .0333422          0          1
sh_r~ce_2013 |     31,603    .0355028    .0220698          0          1
sh_re~d_2013 |     31,603    .0842159    .0391991          0          1
sh_wo~9_2013 |     30,770    .2117696    .0887404          0          1
-------------+---------------------------------------------------------
sh_wo~4_2013 |     30,770    .5409905    .0943871          0          1
sh_wo~5_2013 |     30,770    .2472399    .0948825          0          1
sh_wo~0_2013 |     30,770    .3045117    .1429267          0          1
sh_workers.. |     30,770    .3827977    .1258923          0          1
sh_workers.. |     30,770    .3126905    .1586489          0          1
-------------+---------------------------------------------------------
sh_wo~S_2013 |     30,770    .0989215    .0610894          0          1
sh_workers.. |     30,770    .2570484    .0909343          0          1
sh_workers.. |     30,770    .2538444    .0730954          0          1
sh_w~ge_2013 |     30,770    .1784161    .0844473          0          1
sh_wo~f_2013 |     30,770    .0984303    .1545642          0          1
-------------+---------------------------------------------------------
sh_w~il_2013 |     30,770    .1100396    .1184553          0          1
sh_w~ce_2013 |     30,770    .0269109    .0559106          0          1
sh_wo~d_2013 |     30,770     .083209     .116872          0          1
sh_re~9_2017 |     31,539     .223932     .048058          0          1
sh_re~4_2017 |     31,539    .5230601    .0548097          0          1
-------------+---------------------------------------------------------
sh_re~5_2017 |     31,539    .2530078    .0579319          0          1
sh_re~0_2017 |     31,539    .2435743    .0561917          0          1
sh_residen.. |     31,539    .3496767     .081093          0          1
sh_residen.. |     31,539     .406749    .1058708          0          1
sh_re~S_2017 |     31,539     .089734    .0405314          0          1
-------------+---------------------------------------------------------
sh_residen.. |     31,539    .2323392     .053887          0          1
sh_residen.. |     31,539    .2549181    .0461318          0          1
sh_r~ge_2017 |     31,539    .1990766    .0664623          0          1
sh_re~f_2017 |     31,539     .105875    .0679906          0          1
sh_r~il_2017 |     31,539    .1155329    .0339016          0          1
-------------+---------------------------------------------------------
sh_r~ce_2017 |     31,539    .0348457     .021443          0         .5
sh_re~d_2017 |     31,539    .0879353    .0421151          0          1
sh_wo~9_2017 |     30,745    .2154053    .0868001          0          1
sh_wo~4_2017 |     30,745    .5157884    .0944545          0          1
sh_wo~5_2017 |     30,745    .2688063    .0997894          0          1
-------------+---------------------------------------------------------
sh_wo~0_2017 |     30,745    .2814243    .1359782          0          1
sh_workers.. |     30,745    .3642706    .1209817          0          1
sh_workers.. |     30,745    .3543051    .1595226          0          1
sh_wo~S_2017 |     30,745    .1008578    .0611871          0          1
sh_workers.. |     30,745    .2523721    .0910078          0          1
-------------+---------------------------------------------------------
sh_workers.. |     30,745    .2526431    .0756963          0          1
sh_w~ge_2017 |     30,745    .1787217    .0846085          0          1
sh_wo~f_2017 |     30,745    .0955913    .1514867          0          1
sh_w~il_2017 |     30,745    .1087085    .1186967          0          1
sh_w~ce_2017 |     30,745     .025094    .0561649          0          1
-------------+---------------------------------------------------------
sh_wo~d_2017 |     30,745    .0864658     .119429          0          1
sh_od_resi.. |     28,315    .2167551    .0418881          0          1
sh_od_resi.. |     28,315    .2645526    .0516992          0          1
sh_od_work.. |     28,409     .211905    .0896265          0          1
sh_od_work.. |     28,409    .3055705    .1445638          0          1
-------------+---------------------------------------------------------
sh_work_sa~o |     25,183    .0937492     .112636   .0000654   .9689469
sh_od_work.. |     25,183    .0194598    .0249502          0   .3157895
sh_od_work.. |     25,183    .0298162    .0347914          0   .4063906
sh_od_resi.. |     28,459    .2249602    .0411901          0   .7762431
sh_od_resi.. |     28,459    .2446687    .0496904          0          1
-------------+---------------------------------------------------------
sh_od_work.. |     28,552    .2156865    .0881378          0          1
sh_od_work.. |     28,552    .2823066    .1376744          0          1
sh_od_work.. |     25,558    .0207173    .0262185          0   .3162583
sh_od_work.. |     25,558    .0289729    .0337249          0   .3595969
statuto~2010 |     31,826    7.408498    .3338752       7.25   10.09876
-------------+---------------------------------------------------------
statuto~2019 |     31,826    8.842151    1.891423       7.25      16.09
medren~e_2BR |        485    1909.961    970.7352        495       6595
medre~e_SFCC |      1,253    1607.497    701.1304        630       6000
medren~t_2BR |        368    1.763289    .8660091   .5687694   5.653199
medre~t_SFCC |      1,345    1.224143    1.038714   .4660688   18.86792
-------------+---------------------------------------------------------
agi_per_hhld |     27,755    53233.43    38256.66   5001.689    2368675
wage_per_w~d |     27,755    44242.08    22737.76   9360.238   554989.5
wage_per_h~d |     27,755    36237.78    17388.54   2959.625   351137.3
bussines_r~r |     27,193    10924.03    8316.472  -42985.53   515220.8
share_wage~s |     27,755    .8224265    .0595268   .0782161          1
-------------+---------------------------------------------------------
share_buss~s |     27,755    .1594844    .0498914          0   .6312504
share_farm~s |     27,755    .0500256    .0773002          0   .6884065
    safmr1br |     15,748    742.3184    281.8481        370       2060
    safmr2br |     15,748    887.2308    319.0067        490       2340
    safmr3br |     15,748    1160.834    415.8786        620       3240




(note: file ../output/all_zipcode_lvl_data.dta not found)
file ../output/all_zipcode_lvl_data.dta saved
(note: file ../output/all_zipcode_lvl_data.csv not found)
file ../output/all_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            11,354  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            11,354  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            11,354  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            11,354  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,010
        from master                     1,010  
        from using                          0  

    matched                            10,344  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,189
        from master                     1,189  
        from using                          0  

    matched                            10,165  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/all_urban_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  11354:130(69736):553746589:3775250879

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
   statefips |          0
        cbsa |          0
  urban_cbsa |     11,354           1           0          1          1
-------------+---------------------------------------------------------
   urban_zip |     11,354    .6617932    .4731201          0          1
n_census_b~s |     11,354    385.0749    325.6016          1       3775
n_blockgro~s |     11,354    16.65748    13.52875          1        101
    n_tracts |     11,354    7.707856    5.544102          1         47
    n_places |     11,354    2.963009    1.948434          1         24
-------------+---------------------------------------------------------
  n_counties |     11,354    1.304298    .5841238          1          6
      n_cbsa |     11,354    1.121455    .3634293          1          4
    n_states |     11,354    1.011714    .1075999          1          2
  num_houses |     11,354     7417.33    6868.101          0      48073
  population |     11,354    18071.83    17340.35          0     115182
-------------+---------------------------------------------------------
    sh_rural |     11,354    .3434178    .3629637          0          1
sh_rural_w~s |     11,216    .2882475    .3558462          0          1
       tract |          0
  place_code |          0
n_months_z~s |      2,864    61.92039    34.57791         12        119
-------------+---------------------------------------------------------
populat~2010 |     11,354    18018.83    17338.05          0     115182
n_male_~2010 |     11,354    8833.255    8477.333          0      57965
n_white~2010 |     11,354    12272.35    11613.01          0      91407
n_black~2010 |     11,354    2390.286    5571.724          0      79984
urb_pop~2010 |     11,354    16688.15    17583.79          0     115182
-------------+---------------------------------------------------------
n_hhlds_ce~0 |     11,354    7391.196    6860.979          0      48073
n_hhlds_ur~0 |     11,354    6831.503    6991.749          0      48073
n_hhlds_re~0 |     11,354    2492.006    3263.764          0      33601
rural_p~2010 |     11,354    1330.676    2357.118          0      22729
populat~2011 |     10,929    17623.66    17005.46          0     114694
-------------+---------------------------------------------------------
n_worke~2011 |     10,929    8169.298    7911.697          0      51551
n_mw_wkrs_~y |     10,929    1268.905    1318.713          0      11010
n_mw_wkrs_~e |     10,929    1267.401    1316.037          0      11010
n_mw_wkrs_~d |     10,929    1211.371    1241.408          0      10484
med_hhl~2011 |     10,935    45430.71    28218.98          9   225461.9
-------------+---------------------------------------------------------
sh_whit~2010 |     11,224    .7648088    .2192516          0          1
sh_blac~2010 |     11,224    .0999477    .1722957          0          1
sh_male~2010 |     11,224     .497022    .0449199          0          1
sh_urb_~2010 |     11,224    .7253919    .3926132          0          1
sh_rura~2010 |     11,224    .2746081    .3926132          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |     11,189    .7225478    .3934959          0          1
sh_hhlds_r~0 |     11,189    .2827434    .1775689          0          1
sh_mw_wkrs~y |     10,799    .1611036    .0670074          0          1
sh_mw_wkrs~e |     10,799     .161007    .0670084          0          1
sh_mw_wkrs~d |     10,799    .1548721    .0652829          0          1
-------------+---------------------------------------------------------
sh_re~9_2013 |     11,245    .2177406    .0443947          0          1
sh_re~4_2013 |     11,245    .5570448    .0455309          0          1
sh_re~5_2013 |     11,245    .2252147    .0494774          0          1
sh_re~0_2013 |     11,245    .2444734    .0527328          0          1
sh_residen.. |     11,245    .3331573    .0833197          0          1
-------------+---------------------------------------------------------
sh_residen.. |     11,245    .4223693    .1166732          0          1
sh_re~S_2013 |     11,245    .0928765    .0458018          0          1
sh_residen.. |     11,245    .2023208    .0439626          0          1
sh_residen.. |     11,245    .2481206    .0354198          0          1
sh_r~ge_2013 |     11,245    .2389415    .0760945          0          1
-------------+---------------------------------------------------------
sh_re~f_2013 |     11,245     .082454    .0484471          0   .3846154
sh_r~il_2013 |     11,245    .1087883    .0289342          0          1
sh_r~ce_2013 |     11,245    .0442922    .0257752          0          1
sh_re~d_2013 |     11,245    .0898181    .0367551          0          1
sh_wo~9_2013 |     11,191    .2224237    .0708373          0          1
-------------+---------------------------------------------------------
sh_wo~4_2013 |     11,191    .5488393    .0666373          0          1
sh_wo~5_2013 |     11,191     .228737    .0654922          0          1
sh_wo~0_2013 |     11,191    .2815271    .1138433          0          1
sh_workers.. |     11,191     .355755    .0940794          0          1
sh_workers.. |     11,191    .3627178    .1455005          0          1
-------------+---------------------------------------------------------
sh_wo~S_2013 |     11,191    .1031575    .0522914          0          1
sh_workers.. |     11,191    .2160249     .063625          0          1
sh_workers.. |     11,191    .2462509     .051242          0          1
sh_w~ge_2013 |     11,191     .212143    .0799758          0          1
sh_wo~f_2013 |     11,191    .0818576    .1220408          0          1
-------------+---------------------------------------------------------
sh_w~il_2013 |     11,191    .1142389    .0993087          0          1
sh_w~ce_2013 |     11,191    .0308135    .0540108          0          1
sh_wo~d_2013 |     11,191    .0965395    .1038889          0          1
sh_re~9_2017 |     11,253    .2256169     .047671          0          1
sh_re~4_2017 |     11,253    .5341768    .0469515          0          1
-------------+---------------------------------------------------------
sh_re~5_2017 |     11,253    .2402064    .0521541          0          1
sh_re~0_2017 |     11,253    .2239433    .0485072          0          1
sh_residen.. |     11,253     .312031    .0835389          0          1
sh_residen.. |     11,253    .4640257    .1144644          0          1
sh_re~S_2017 |     11,253    .0975467    .0437104          0          1
-------------+---------------------------------------------------------
sh_residen.. |     11,253    .1991538    .0404897          0          1
sh_residen.. |     11,253     .242723    .0356154          0          1
sh_r~ge_2017 |     11,253    .2349596    .0747802          0          1
sh_re~f_2017 |     11,253    .0792641     .047298          0          1
sh_r~il_2017 |     11,253    .1087098    .0293133          0          1
-------------+---------------------------------------------------------
sh_r~ce_2017 |     11,253    .0434088    .0246907          0   .3333333
sh_re~d_2017 |     11,253    .0930895    .0377297          0          1
sh_wo~9_2017 |     11,186    .2280261     .071201          0          1
sh_wo~4_2017 |     11,186    .5245217    .0683726          0          1
sh_wo~5_2017 |     11,186    .2474521    .0707809          0          1
-------------+---------------------------------------------------------
sh_wo~0_2017 |     11,186    .2579024    .1055137          0          1
sh_workers.. |     11,186    .3395161    .0939751          0          1
sh_workers.. |     11,186    .4025815    .1438776          0          1
sh_wo~S_2017 |     11,186    .1082851    .0548089          0          1
sh_workers.. |     11,186    .2129894    .0643797          0          1
-------------+---------------------------------------------------------
sh_workers.. |     11,186    .2412629    .0489136          0          1
sh_w~ge_2017 |     11,186    .2094366    .0780641          0          1
sh_wo~f_2017 |     11,186    .0772053    .1161446          0          1
sh_w~il_2017 |     11,186    .1119083     .096914          0          1
sh_w~ce_2017 |     11,186    .0282217    .0515733          0          1
-------------+---------------------------------------------------------
sh_wo~d_2017 |     11,186    .1006603    .1049143          0          1
sh_od_resi.. |      9,882    .2191224    .0427445          0          1
sh_od_resi.. |      9,882    .2459971    .0506355          0          1
sh_od_work.. |      9,951    .2229522    .0716927          0          1
sh_od_work.. |      9,951    .2833278    .1161106          0          1
-------------+---------------------------------------------------------
sh_work_sa~o |      9,312    .0731747    .0714045   .0002968   .7736322
sh_od_work.. |      9,312     .015907    .0170178          0   .3157895
sh_od_work.. |      9,312    .0233477    .0220896          0   .2662142
sh_od_resi.. |      9,903    .2270837    .0443456          0   .6158358
sh_od_resi.. |      9,903    .2253808    .0471732          0          1
-------------+---------------------------------------------------------
sh_od_work.. |      9,972    .2289389    .0728624          0          1
sh_od_work.. |      9,972    .2589464    .1074788          0          1
sh_od_work.. |      9,392    .0164403    .0178401          0   .3162583
sh_od_work.. |      9,392    .0213794    .0204966          0   .3378839
statuto~2010 |     11,354    7.490283    .3928162       7.25   10.09876
-------------+---------------------------------------------------------
statuto~2019 |     11,354    9.506121    2.225098       7.25      16.09
medren~e_2BR |        473    1936.783    967.5188        495       6595
medre~e_SFCC |      1,166    1643.943    709.8301        630       6000
medren~t_2BR |        361    1.780904    .8646463   .5687694   5.653199
medre~t_SFCC |      1,244    1.262195    1.070246   .4660688   18.86792
-------------+---------------------------------------------------------
agi_per_hhld |     10,344    66539.31    56322.53   5001.689    2368675
wage_per_w~d |     10,344    55097.28    32131.38      13748   554989.5
wage_per_h~d |     10,344       45136    23983.67   2959.625   351137.3
bussines_r~r |     10,275    13492.34    9895.394  -42985.53   158995.4
share_wage~s |     10,344    .8291297    .0622013   .0782161          1
-------------+---------------------------------------------------------
share_buss~s |     10,344    .1595168    .0459584          0   .4844075
share_farm~s |     10,344    .0155124    .0380139          0   .4183703
    safmr1br |     10,165    828.9385    304.0469        410       2060
    safmr2br |     10,165    985.3576    342.2176        520       2340
    safmr3br |     10,165    1293.096    442.3344        660       3240




(note: file ../output/all_urban_zipcode_lvl_data.dta not found)
file ../output/all_urban_zipcode_lvl_data.dta saved
(note: file ../output/all_urban_zipcode_lvl_data.csv not found)
file ../output/all_urban_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             9
        from master                         9  
        from using                          0  

    matched                             3,307  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           360
        from master                       360  
        from using                          0  

    matched                             2,956  
    -----------------------------------------
(data already sorted by zipcode)
  variable n_blockgroups was int now byte
  (3,316 bytes saved)
===============================================================================
File: ../output/all_zillow_rents_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  3316:130(69736):4281504604:3817161572

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
   statefips |          0
        cbsa |          0
  urban_cbsa |      3,316    .8636912    .3431679          0          1
-------------+---------------------------------------------------------
   urban_zip |      3,316    .9420989    .2335915          0          1
n_census_b~s |      3,316    606.7708    352.2224          2       5451
n_blockgro~s |      3,316    27.71713    11.64457          1         82
    n_tracts |      3,316    12.30217    4.728567          1         42
    n_places |      3,316    3.378468    2.134259          1         24
-------------+---------------------------------------------------------
  n_counties |      3,316    1.275332    .5605487          1          5
      n_cbsa |      3,316    1.061218    .2555995          1          3
    n_states |      3,316    1.006634     .081194          1          2
  num_houses |      3,316    14386.66    5565.609        637      48073
  population |      3,316    33856.99    14789.11        387     110682
-------------+---------------------------------------------------------
    sh_rural |      3,316    .1669437    .2425524          0          1
sh_rural_w~s |      3,316    .1346825    .2411732          0          1
       tract |          0
  place_code |          0
n_months_z~s |      3,316    59.70386    34.21254         12        119
-------------+---------------------------------------------------------
populat~2010 |      3,316    33687.93    14948.33          0     110682
n_male_~2010 |      3,316    16456.21    7341.985          0      53020
n_white~2010 |      3,316    22200.04    11123.57          0      91407
n_black~2010 |      3,316    5231.483    7512.326          0      71202
urb_pop~2010 |      3,316    32562.38    14995.86          0     110682
-------------+---------------------------------------------------------
n_hhlds_ce~0 |      3,316    14301.71    5637.275          0      48073
n_hhlds_ur~0 |      3,316    13821.47    5719.315          0      48073
n_hhlds_re~0 |      3,316    5020.075    3321.408          0      33601
rural_p~2010 |      3,316    1125.549    2448.338          0      19862
populat~2011 |      3,134    33526.55    14610.28        422     114694
-------------+---------------------------------------------------------
n_worke~2011 |      3,134    15866.13    7020.908        194      51551
n_mw_wkrs_~y |      3,134    2405.985    1286.701         21      10539
n_mw_wkrs_~e |      3,134    2401.551      1281.1         21      10539
n_mw_wkrs_~d |      3,134    2312.145    1220.811         21      10539
med_hhl~2011 |      3,189    57139.45    22946.85   8853.411   189868.7
-------------+---------------------------------------------------------
sh_whit~2010 |      3,298    .6791784    .2089788   .0048626   .9844657
sh_blac~2010 |      3,298    .1534291    .1969505   .0023229   .9808114
sh_male~2010 |      3,298    .4888367    .0216543   .3554951   .8231398
sh_urb_~2010 |      3,298    .9601275    .0945332          0          1
sh_rura~2010 |      3,298    .0398725    .0945332          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |      3,298    .9592807    .0968126          0          1
sh_hhlds_r~0 |      3,298     .340291    .1479458    .032175   .8815922
sh_mw_wkrs~y |      3,134    .1524342    .0499767   .0114365   .5270913
sh_mw_wkrs~e |      3,134     .152234    .0499782   .0114365   .5270913
sh_mw_wkrs~d |      3,134    .1471996    .0495421   .0114365   .5270913
-------------+---------------------------------------------------------
sh_re~9_2013 |      3,316    .2229729     .038629   .1043165   .4475389
sh_re~4_2013 |      3,316    .5672854    .0372372   .3170925   .7929856
sh_re~5_2013 |      3,316    .2097417    .0404019   .0945915    .556942
sh_re~0_2013 |      3,316    .2366843    .0482344    .081473   .4304474
sh_residen.. |      3,316    .3347302    .0826064   .1024166   .5698879
-------------+---------------------------------------------------------
sh_residen.. |      3,316    .4285855    .1228052   .1266855   .8161105
sh_re~S_2013 |      3,316    .0980844    .0328851   .0415621   .2423261
sh_residen.. |      3,316    .1913614    .0315335   .0881473   .2704435
sh_residen.. |      3,316    .2441748    .0208164    .146145   .3127352
sh_r~ge_2013 |      3,316    .2434064     .070923   .0872503   .5086409
-------------+---------------------------------------------------------
sh_re~f_2013 |      3,316    .0642988    .0344036   .0047896   .2302058
sh_r~il_2013 |      3,316    .1084445    .0217348   .0318166   .2178375
sh_r~ce_2013 |      3,316    .0479934    .0236965    .011919   .2379747
sh_re~d_2013 |      3,316    .1006553    .0367388     .04625   .4088557
sh_wo~9_2013 |      3,316    .2391224    .0499696   .0976698      .4656
-------------+---------------------------------------------------------
sh_wo~4_2013 |      3,316    .5534196    .0389263   .3424658   .7009695
sh_wo~5_2013 |      3,316     .207458    .0330277   .0777262   .3311203
sh_wo~0_2013 |      3,316    .2724262    .0782093   .0508635   .5526825
sh_workers.. |      3,316    .3596215    .0639002   .0971667    .615748
sh_workers.. |      3,316    .3679523    .1196946   .0869565   .8472778
-------------+---------------------------------------------------------
sh_wo~S_2013 |      3,316    .1049254    .0342205   .0349401   .3313758
sh_workers.. |      3,316    .1955626    .0331835   .0914991   .3947741
sh_workers.. |      3,316    .2400015    .0221006   .1445288   .3318452
sh_w~ge_2013 |      3,316    .2203881    .0656222   .0628211   .5333765
sh_wo~f_2013 |      3,316    .0593424    .0820179          0   .7810701
-------------+---------------------------------------------------------
sh_w~il_2013 |      3,316    .1369803    .0784743          0   .5414013
sh_w~ce_2013 |      3,316     .039214     .046903          0   .5770493
sh_wo~d_2013 |      3,316    .1149985    .0718919          0   .7659544
sh_re~9_2017 |      3,316    .2317039     .043641   .1149316   .5027715
sh_re~4_2017 |      3,316    .5466451    .0377563   .3133708   .7714187
-------------+---------------------------------------------------------
sh_re~5_2017 |      3,316    .2216509    .0425595   .0835913   .5419213
sh_re~0_2017 |      3,316    .2192983     .046283   .0763664   .3917885
sh_residen.. |      3,316    .3137962    .0832348   .0854917   .5313962
sh_residen.. |      3,316    .4669055    .1228907   .1664881   .8252264
sh_re~S_2017 |      3,316    .1043216    .0325645    .040891   .2702693
-------------+---------------------------------------------------------
sh_residen.. |      3,316     .188564    .0293739   .0961573    .271939
sh_residen.. |      3,316    .2378026    .0223212   .1310313   .3120655
sh_r~ge_2017 |      3,316    .2376078    .0698314   .0942029   .4850746
sh_re~f_2017 |      3,316    .0616982    .0325589    .005814   .2177266
sh_r~il_2017 |      3,316    .1073627    .0217567   .0283525   .2845158
-------------+---------------------------------------------------------
sh_r~ce_2017 |      3,316    .0468093    .0238468          0   .2581369
sh_re~d_2017 |      3,316     .104597    .0349545   .0489156   .3666597
sh_wo~9_2017 |      3,309    .2455185     .048096   .1123348   .4871833
sh_wo~4_2017 |      3,309    .5335403    .0368875   .3728814   .6800871
sh_wo~5_2017 |      3,309    .2209412     .034191   .0760911   .4911894
-------------+---------------------------------------------------------
sh_wo~0_2017 |      3,309    .2502581    .0708414   .0401723   .5352423
sh_workers.. |      3,309    .3448133    .0667768   .0660942    .591314
sh_workers.. |      3,309    .4049286    .1203724   .1224052   .8880573
sh_wo~S_2017 |      3,309     .111077    .0339634    .043345   .3147471
sh_workers.. |      3,309    .1924792    .0312964   .0887432   .4482219
-------------+---------------------------------------------------------
sh_workers.. |      3,309    .2350395    .0217218   .1393807   .3220339
sh_w~ge_2017 |      3,309    .2158857    .0639791    .061535   .5022355
sh_wo~f_2017 |      3,309     .055325    .0761292          0   .7677997
sh_w~il_2017 |      3,309    .1349788    .0766796   .0033874   .7472644
sh_w~ce_2017 |      3,309    .0373275     .048044          0   .7147541
-------------+---------------------------------------------------------
sh_wo~d_2017 |      3,309    .1200021    .0728993          0   .7501325
sh_od_resi.. |      3,143    .2229418    .0375922   .1043165   .4415175
sh_od_resi.. |      3,143    .2379928    .0483268    .081473   .4304474
sh_od_work.. |      3,143    .2401866     .050211   .0976698      .4656
sh_od_work.. |      3,143    .2743106    .0781393   .0508635   .5526825
-------------+---------------------------------------------------------
sh_work_sa~o |      3,143    .0926373    .0844145   .0002968   .7212093
sh_od_work.. |      3,143    .0209597    .0207653          0     .18642
sh_od_work.. |      3,143     .027382    .0246013          0   .2141728
sh_od_resi.. |      3,143    .2314234     .041996   .1149316   .4919482
sh_od_resi.. |      3,143    .2202188    .0461853   .0763664   .3917885
-------------+---------------------------------------------------------
sh_od_work.. |      3,143    .2465974    .0483363   .1123348   .4871833
sh_od_work.. |      3,143     .251605    .0706934   .0401723   .5352423
sh_od_work.. |      3,142    .0213936    .0210564          0    .208455
sh_od_work.. |      3,142    .0247382    .0219387          0   .2167781
statuto~2010 |      3,316     7.47653     .405294       7.25   10.09876
-------------+---------------------------------------------------------
statuto~2019 |      3,316    9.384948    2.323413       7.25         16
medren~e_2BR |        383    1890.483    1014.196        495       6595
medre~e_SFCC |      1,184    1592.807    695.0302        630       6000
medren~t_2BR |        341    1.776714    .8886875   .5687694   5.653199
medre~t_SFCC |      1,345    1.224143    1.038714   .4660688   18.86792
-------------+---------------------------------------------------------
agi_per_hhld |      3,307    70264.37    55843.32   18965.92   736585.5
wage_per_w~d |      3,307    57777.44    34414.34    17918.5   373157.3
wage_per_h~d |      3,307    47469.64    25860.23   8523.639   302129.2
bussines_r~r |      3,307    13959.97    9641.045  -9688.676   130250.2
share_wage~s |      3,307    .8328935    .0656901   .2685518    .951295
-------------+---------------------------------------------------------
share_buss~s |      3,307    .1660188     .041824   .0519342   .3421915
share_farm~s |      3,307    .0029139    .0054401          0   .0980049
    safmr1br |      2,956    878.4777    291.0567        420       1980
    safmr2br |      2,956    1039.499    334.6062        520       2340
    safmr3br |      2,956    1383.244    446.1662        690       3170




(note: file ../output/all_zillow_rents_zipcode_lvl_data.dta not found)
file ../output/all_zillow_rents_zipcode_lvl_data.dta saved
(note: file ../output/all_zillow_rents_zipcode_lvl_data.csv not found)
file ../output/all_zillow_rents_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         2  
        from using                          0  

    matched                             1,343  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           130
        from master                       130  
        from using                          0  

    matched                             1,215  
    -----------------------------------------
(data already sorted by zipcode)
  variable n_blockgroups was int now byte
  (1,345 bytes saved)
===============================================================================
File: ../output/baseline_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  1345:130(69736):2410238232:323884173

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
   statefips |          0
        cbsa |          0
  urban_cbsa |      1,345    .9249071    .2636393          0          1
-------------+---------------------------------------------------------
   urban_zip |      1,345    .9643123    .1855794          0          1
n_census_b~s |      1,345    609.3338    335.5577          2       3153
n_blockgro~s |      1,345    28.56059    12.02098          1         82
    n_tracts |      1,345     12.7368    4.750065          1         42
    n_places |      1,345    3.260223    2.022368          1         19
-------------+---------------------------------------------------------
  n_counties |      1,345    1.266171    .5568237          1          5
      n_cbsa |      1,345    1.040892    .2018348          1          3
    n_states |      1,345    1.006691    .0815575          1          2
  num_houses |      1,345     16206.9    5783.221        777      48073
  population |      1,345    38297.84    15137.98        458     110682
-------------+---------------------------------------------------------
    sh_rural |      1,345    .1620164    .2445389          0          1
sh_rural_w~s |      1,345    .1358236    .2481849          0          1
       tract |          0
  place_code |          0
n_months_z~s |      1,345    99.33086    12.19923         60        119
-------------+---------------------------------------------------------
populat~2010 |      1,345    38052.87    15415.13          0     110682
n_male_~2010 |      1,345    18544.72    7531.331          0      53020
n_white~2010 |      1,345     24638.4    11497.71          0      91407
n_black~2010 |      1,345    6465.306    8930.621          0      71202
urb_pop~2010 |      1,345    37107.07    15460.31          0     110682
-------------+---------------------------------------------------------
n_hhlds_ce~0 |      1,345    16080.83    5903.241          0      48073
n_hhlds_ur~0 |      1,345    15693.95    5998.335          0      48073
n_hhlds_re~0 |      1,345    5495.526    3576.813          0      33601
rural_p~2010 |      1,345    945.7985    2141.596          0      18977
populat~2011 |      1,258    37870.35     14946.5        422     114694
-------------+---------------------------------------------------------
n_worke~2011 |      1,258    18136.86    7198.836        194      51551
n_mw_wkrs_~y |      1,258    2550.886    1253.553         21       9787
n_mw_wkrs_~e |      1,258    2548.045    1249.137         21       9787
n_mw_wkrs_~d |      1,258    2469.946    1201.324         21       9787
med_hhl~2011 |      1,286    59944.08    21689.62      16481   165594.9
-------------+---------------------------------------------------------
sh_whit~2010 |      1,336    .6673737    .1980062   .0048626   .9642324
sh_blac~2010 |      1,336    .1612541    .1939937   .0040479   .9808114
sh_male~2010 |      1,336    .4880788     .019867   .3554951    .616951
sh_urb_~2010 |      1,336    .9717187    .0703948          0          1
sh_rura~2010 |      1,336    .0282813    .0703948          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |      1,336    .9708522    .0729391          0          1
sh_hhlds_r~0 |      1,336    .3328068    .1435928    .032175   .8815922
sh_mw_wkrs~y |      1,258    .1402221    .0423791   .0114365   .5270913
sh_mw_wkrs~e |      1,258    .1401205    .0424523   .0114365   .5270913
sh_mw_wkrs~d |      1,258    .1361262    .0421562   .0114365   .5270913
-------------+---------------------------------------------------------
sh_re~9_2013 |      1,345    .2216767    .0388453   .1043165   .4475389
sh_re~4_2013 |      1,345    .5771217    .0386471   .3170925   .7929856
sh_re~5_2013 |      1,345    .2012016    .0393511   .0945915    .556942
sh_re~0_2013 |      1,345    .2276163    .0471229    .081473   .4113271
sh_residen.. |      1,345    .3307915    .0859078   .1024166   .5665943
-------------+---------------------------------------------------------
sh_residen.. |      1,345    .4415922    .1256165   .1504181   .8161105
sh_re~S_2013 |      1,345    .1007825    .0315989    .045693   .2423261
sh_residen.. |      1,345    .1890688    .0305319   .0881473   .2683365
sh_residen.. |      1,345    .2441426    .0229168    .146145   .3127352
sh_r~ge_2013 |      1,345    .2443293    .0687882   .0997796   .5086409
-------------+---------------------------------------------------------
sh_re~f_2013 |      1,345    .0572173    .0306413   .0049915    .229259
sh_r~il_2013 |      1,345    .1087749    .0231046   .0322764   .1792371
sh_r~ce_2013 |      1,345    .0515003    .0260298   .0148148   .2379747
sh_re~d_2013 |      1,345    .1037891    .0424611   .0471225   .4085447
sh_wo~9_2013 |      1,345    .2446284    .0498803   .1058208   .4565147
-------------+---------------------------------------------------------
sh_wo~4_2013 |      1,345    .5563877    .0393583   .4274167   .7009695
sh_wo~5_2013 |      1,345    .1989839    .0312993   .1160685   .3311203
sh_wo~0_2013 |      1,345    .2739518    .0799006   .0534571   .5345912
sh_workers.. |      1,345    .3626421    .0685655   .0971667    .615748
sh_workers.. |      1,345    .3634061    .1270799   .0983713   .8472778
-------------+---------------------------------------------------------
sh_wo~S_2013 |      1,345    .1093832    .0331808   .0450641   .3313758
sh_workers.. |      1,345    .1924014    .0314169   .0914991   .2862146
sh_workers.. |      1,345    .2367812    .0221275   .1445288   .3118134
sh_w~ge_2013 |      1,345    .2168058    .0673928   .0771745   .4909934
sh_wo~f_2013 |      1,345    .0530165    .0789239          0   .7127416
-------------+---------------------------------------------------------
sh_w~il_2013 |      1,345    .1460697    .0833817          0   .5099668
sh_w~ce_2013 |      1,345    .0428253    .0525607          0    .570525
sh_wo~d_2013 |      1,345    .1219119    .0726743          0   .7659544
sh_re~9_2017 |      1,345     .230249    .0440097   .1149316   .5027715
sh_re~4_2017 |      1,345    .5562973    .0383084   .3361656   .7714187
-------------+---------------------------------------------------------
sh_re~5_2017 |      1,345    .2134537    .0410643   .0835913   .5235594
sh_re~0_2017 |      1,345    .2118172    .0444956   .0763664   .3917885
sh_residen.. |      1,345     .310743    .0872692   .0854917   .5282834
sh_residen.. |      1,345    .4774398    .1258987   .1688096   .8252264
sh_re~S_2017 |      1,345    .1074978    .0319334   .0414658   .2702693
-------------+---------------------------------------------------------
sh_residen.. |      1,345    .1868724    .0284306   .0961573   .2593532
sh_residen.. |      1,345    .2376017     .024178   .1310313   .3120655
sh_r~ge_2017 |      1,345    .2377792    .0681624   .1024648   .4850746
sh_re~f_2017 |      1,345    .0546291    .0284542   .0065308   .1894767
sh_r~il_2017 |      1,345    .1075862     .023697   .0283525   .2845158
-------------+---------------------------------------------------------
sh_r~ce_2017 |      1,345    .0507136    .0265165   .0153323   .2581369
sh_re~d_2017 |      1,345    .1071651    .0394618   .0511364   .3617381
sh_wo~9_2017 |      1,343    .2510646     .047173   .1184052   .4515854
sh_wo~4_2017 |      1,343    .5370417    .0372478   .4128551   .6715788
sh_wo~5_2017 |      1,343    .2118938    .0313564   .0970492   .3570053
-------------+---------------------------------------------------------
sh_wo~0_2017 |      1,343    .2522849    .0726177   .0458484   .5345794
sh_workers.. |      1,343      .35008    .0713215   .0660942    .591314
sh_workers.. |      1,343     .397635    .1273987   .1224052   .8880573
sh_wo~S_2017 |      1,343    .1157688    .0327828   .0499089   .3147471
sh_workers.. |      1,343    .1894876    .0292483   .0887432   .2763074
-------------+---------------------------------------------------------
sh_workers.. |      1,343    .2315612    .0211954   .1393807   .2861793
sh_w~ge_2017 |      1,343    .2121178    .0657955   .0730337   .5022355
sh_wo~f_2017 |      1,343    .0485139     .071148          0    .714326
sh_w~il_2017 |      1,343    .1443048    .0802307   .0033874    .512011
sh_w~ce_2017 |      1,343    .0408032    .0545627          0   .7147541
-------------+---------------------------------------------------------
sh_wo~d_2017 |      1,343    .1266246    .0721966   .0036842   .7501325
sh_od_resi.. |      1,290    .2203546    .0365063   .1043165   .3944059
sh_od_resi.. |      1,290    .2287104    .0472324    .081473   .4113271
sh_od_work.. |      1,290    .2454285    .0502288   .1058208   .4565147
sh_od_work.. |      1,290     .276242    .0795633   .0534571   .5345912
-------------+---------------------------------------------------------
sh_work_sa~o |      1,290    .0805244    .0679232   .0012953   .6033747
sh_od_work.. |      1,290     .018422    .0175301          0     .18642
sh_od_work.. |      1,290    .0232627    .0195671          0   .1771363
sh_od_resi.. |      1,290    .2285187    .0408629   .1149316   .4476933
sh_od_resi.. |      1,290    .2127592    .0443127   .0763664   .3917885
-------------+---------------------------------------------------------
sh_od_work.. |      1,290     .251879    .0475221   .1184052   .4514894
sh_od_work.. |      1,290    .2543156    .0720213   .0459653   .5345795
sh_od_work.. |      1,289     .018867     .017303          0   .1801208
sh_od_work.. |      1,289    .0212357     .017169          0   .1539802
statuto~2010 |      1,345    7.426178    .3520287       7.25       9.79
-------------+---------------------------------------------------------
statuto~2019 |      1,345    9.214129    2.205615       7.25         16
medren~e_2BR |        302    1915.675    1036.769        495       6495
medre~e_SFCC |      1,098     1598.47    704.5947        630       6000
medren~t_2BR |        281    1.806776    .9461427   .5687694   5.653199
medre~t_SFCC |      1,345    1.224143    1.038714   .4660688   18.86792
-------------+---------------------------------------------------------
agi_per_hhld |      1,343    71150.59    53351.11   21344.37   736585.5
wage_per_w~d |      1,343    59167.87    32022.06   19957.67   318527.1
wage_per_h~d |      1,343    49287.63    25170.34   10554.06   269083.4
bussines_r~r |      1,343    13372.91    9268.477  -9688.676   93661.72
share_wage~s |      1,343    .8398445    .0622921   .3109279    .951295
-------------+---------------------------------------------------------
share_buss~s |      1,343    .1700053    .0426119   .0619388   .3283778
share_farm~s |      1,343    .0021612    .0036782          0   .0385341
    safmr1br |      1,215    913.4074    274.9634        440       1940
    safmr2br |      1,215    1076.716    318.0459        560       2280
    safmr3br |      1,215    1438.551    421.3531        760       3090




(note: file ../output/baseline_zipcode_lvl_data.dta not found)
file ../output/baseline_zipcode_lvl_data.dta saved
(note: file ../output/baseline_zipcode_lvl_data.csv not found)
file ../output/baseline_zipcode_lvl_data.csv saved
(209,035 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                        49,970
        from master                    49,970  
        from using                          0  

    matched                            29,385  
    -----------------------------------------
(data now sorted by zipcode year_month)
  (0 bytes saved)
===============================================================================
File: ../output/baseline_zillow_rents_zipcode_months.dta
Key: zipcode year_month
===============================================================================
  79355:42(68090):1492956751:602478594

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |     79,355         690    17.02949        661        719
        year |     79,355    2017.034    1.401777       2015       2019
       month |     79,355     6.59322    3.405494          1         12
  countyfips |          0
-------------+---------------------------------------------------------
   statefips |          0
        cbsa |          0
statutory_mw |     79,355    8.569371    1.592362       7.25         16
      mw_res |     79,355    2.133054    .1687241   1.981001   2.772589
mw_wkp_to~17 |     79,355    2.136992    .1640135   1.981412   2.694137
-------------+---------------------------------------------------------
mw_wkp_ag~17 |     79,355    2.135894    .1633381   1.981337   2.707357
mw_wkp_ea~17 |     79,355    2.134622    .1619802   1.981312   2.681366
medpctpric~C |     73,160    2.884855    1.356853   .0003726   23.35717
medre~e_SFCC |     72,914    1760.287    903.9307        625      30000
medre~t_SFCC |     79,355    1.321531    1.011903   .4662344       22.2
-------------+---------------------------------------------------------
    ln_rents |     79,355    .1382903    .4705438  -.7630667   3.100092
 ln_rents_SF |     64,445    .0281706    .3861198  -.7630667   3.100092
 ln_rents_CC |     17,478    .6737936    .4679196  -.5386367   1.918392
ln_rents_S~o |     10,527    .4406625    .7629223  -.7601444   1.971606
ln_rents_1BR |     21,864    .7231234    .3986666   -.308494   1.899293
-------------+---------------------------------------------------------
ln_rents_2BR |     34,364    .4406946    .4293204  -.6901123   1.872875
ln_rents_3BR |     36,755    .1135014    .3950134  -.6811742   1.866231
ln_rents_4BR |      6,322   -.0709814    .4031833   -.562713   2.967022
ln_rents_5BR |        200    .9144299    1.368005  -.3413863   2.972244
ln_rents_M~x |      5,340    .8509387     .571982  -.6632233   1.900493
-------------+---------------------------------------------------------
ln_rents_M~s |     41,747     .471192    .4389063  -.6719947   1.895206
ln_emp_biz~v |     79,355    11.19503    1.376171   6.021023   13.38876
 ln_emp_info |     79,007    9.012035    1.567829   2.397895   12.38988
  ln_emp_fin |     79,343    10.22971    1.434194    4.75359   12.89542
ln_estcoun~v |     79,355    8.714563    1.247151   4.356709   10.96353
-------------+---------------------------------------------------------
ln_estcoun~o |     79,355    6.126465    1.351347   1.609438   9.531191
ln_estcoun~n |     79,355     8.00897    1.208559   3.663562   10.33748
ln_avgwwag~v |     79,355    7.143613    .3073234   5.726848   8.178078
ln_avgwwag~o |     79,007    7.327706    .3550875   5.891644   8.906665
ln_avgwwag~n |     79,343    7.310497    .3664702   6.326149   9.163982
-------------+---------------------------------------------------------
yr_entry_t~C |     79,355    2011.395    .9874228       2010       2015
qtr_entry_~C |     79,355    206.6022    4.066773        200        220
fullbal_sa~C |     79,355           1           0          1          1
unbalanced~C |     79,355           1           0          1          1
    safmr1br |     29,385    973.1312    297.0449        450       2370
-------------+---------------------------------------------------------
    safmr2br |     29,385    1200.636    365.1657        610       2960
    safmr3br |     29,385    1635.044    491.3243        870       4090




(note: file ../output/baseline_zillow_rents_zipcode_months.dta not found)
file ../output/baseline_zillow_rents_zipcode_months.dta saved
(note: file ../output/baseline_zillow_rents_zipcode_months.csv not found)
file ../output/baseline_zillow_rents_zipcode_months.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./build_summary_tables.R" build_summary_tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(dplyr)

Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

> source("../../../lib/R/save_data.R")

Please cite as: 

 Hlavac, Marek (2018). stargazer: Well-Formatted Regression and Summary Statistics Tables.
 R package version 5.2.2. https://CRAN.R-project.org/package=stargazer 


Attaching package: 'data.table'

The following objects are masked from 'package:dplyr':

    between, first, last

> 
> main <- function() {
+   
+   ## ZIP level stats
+   all_zipcodes      <- load_data("all_zipcode_lvl_data.csv")
+   urban_zipcodes    <- load_data("all_urban_zipcode_lvl_data.csv")
+   zillow_zipcodes   <- load_data("all_zillow_rents_zipcode_lvl_data.csv")
+   baseline_zipcodes <- load_data("baseline_zipcode_lvl_data.csv")
+ 
+   all_zipcodes_stats      <- build_basic_stats(all_zipcodes)
+   urban_zipcodes_stats    <- build_basic_stats(urban_zipcodes)
+   zillow_zipcodes_stats   <- build_basic_stats(zillow_zipcodes)
+   baseline_zipcodes_stats <- build_basic_stats(baseline_zipcodes)
+   
+   zip_lvl_stats <- t(rbind(all_zipcodes_stats, urban_zipcodes_stats, 
+                            zillow_zipcodes_stats, baseline_zipcodes_stats))
+   
+   txt <- c("<tab:stats_zip_samples>")
+   writeLines(txt, "../output/stats_zip_samples.txt")
+   write.table(zip_lvl_stats, "../output/stats_zip_samples.txt", 
+               append = TRUE, sep = "\t", dec = ".",
+               row.names = FALSE, col.names = FALSE)
+   
+   ## ZIP-month stats of baseline panel
+   baseline_panel <- load_data("baseline_zillow_rents_zipcode_months.csv")
+   
+   vars_for_table <- c("statutory_mw", "mw_res", "mw_wkp_tot_17",
+                       "mw_wkp_earn_under1250_17", "mw_wkp_age_under29_17",
+                       "medrentprice_SFCC", "medrentpricepsqft_SFCC", "ln_rents", 
+                       paste0("ln_rents_", c("SF", "CC", "Studio", "1BR", "2BR", "3BR", "Mfr5Plus")), 
+                       "ln_emp_bizserv", "ln_estcount_bizserv", "ln_avgwwage_bizserv", 
+                       "ln_emp_info", "ln_estcount_info", "ln_avgwwage_info", 
+                       "ln_emp_fin", "ln_estcount_fin", "ln_avgwwage_fin")
+ 
+   txt <- c("<tab:stats_est_panel>")
+   writeLines(txt, "../output/stats_est_panel.txt")
+   for (var in vars_for_table) {
+    var_row <- build_panel_stats_row(baseline_panel, var)
+    write.table(var_row, "../output/stats_est_panel.txt",
+                append = TRUE, sep = "\t", dec = ".",
+                row.names = FALSE, col.names = FALSE)
+   }
+ }
> 
> load_data <- function(filename, instub = "../output") {
+   return(data.table::fread(file.path(instub, filename),
+                            colClasses = c(zipcode = "character")))
+ }
> 
> build_basic_stats <- function(df) {
+   df %>%
+     summarise(tot_pop_cens2010              = sum(population_cens2010, na.rm = T)/1000,
+               tot_hhlds_cens2010            = sum(n_hhlds_cens2010, na.rm = T)/1000,
+               mean_pop_cens2010             = mean(population_cens2010, na.rm = T),
+               mean_hhlds_cens2010           = mean(n_hhlds_cens2010, na.rm = T),
+               sh_urb_pop_cens2010           = mean(sh_urb_pop_cens2010, na.rm = T),
+               sh_hhlds_renteroccup_cens2010 = mean(sh_hhlds_renteroccup_cens2010, na.rm = T),
+               sh_black_cens2010             = mean(sh_black_cens2010, na.rm = T),
+               sh_white_cens2010             = mean(sh_white_cens2010, na.rm = T),
+               share_wage_hhlds_irs2010      = mean(share_wage_hhlds, na.rm = T),
+               share_bussiness_hhlds_irs2010 = mean(share_bussiness_hhlds, na.rm = T),
+               agi_per_hhld_irs_2010         = mean(agi_per_hhld, na.rm = T)/1000,
+               wage_per_hhld_irs2010         = mean(wage_per_hhld, na.rm = T)/1000,
+               rent40thperc_2br_safmr2012    = mean(safmr2br, na.rm = T),
+               min_binding_mw_feb2010        = min(statutory_mw_feb2010, na.rm = T),
+               avg_binding_mw_feb2010        = mean(statutory_mw_feb2010, na.rm = T),
+               max_binding_mw_feb2010        = max(statutory_mw_feb2010, na.rm = T),
+               min_binding_mw_dec2019        = min(statutory_mw_dec2019, na.rm = T),
+               avg_binding_mw_dec2019        = mean(statutory_mw_dec2019, na.rm = T),
+               max_binding_mw_dec2019        = max(statutory_mw_dec2019, na.rm = T),
+               zip_count                     = n_distinct(zipcode),
+               county_count                  = n_distinct(countyfips),
+               state_count                   = n_distinct(statefips))
+ }
> 
> build_panel_stats_row <-  function(panel, var){
+   panel %>% 
+     summarise(across(.cols = all_of(var),
+                      .fns  = list(n    = ~ sum(!is.na(.x)), 
+                                   mean = ~ mean(.x, na.rm = T), 
+                                   sd   = ~ sd(.x, na.rm = T), 
+                                   min  = ~ min(.x, na.rm = T), 
+                                   max  = ~ max(.x, na.rm = T))))
+ }
> 
> 
> main()
> 
> proc.time()
   user  system elapsed 
   2.71    1.00    6.92 

 make.py ended: 2022-05-04 21:04:32
