
 make.py started: 2022-07-05 13:17:24 C:\Users\shermo\Documents\GitHub\min_wage_rent\descriptive\estimation_samples\code 




Execute:  StataMP-64 /e do "./plot_mw.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./plot_mw.do 

. clear all

. set more off

. 
. program main
  1.     local instub         "../../../drive/derived_large/estimation_samples"
  2.     local outstub        "../output"
  3. 
.     use zipcode zipcode_num year_month statutory_mw unbalanced_sample_SFCC //
> /
>         using "`instub'/zipcode_months.dta" if unbalanced_sample_SFCC == 1, c
> lear
  4.     xtset zipcode_num year_month
  5.     gen pct_ch_MW = 100*(statutory_mw/L.statutory_mw - 1)
  6.     drop if missing(pct_ch_MW)
  7.     
.     plot_mw_dist, outstub(`outstub')
  8. end

. 
. program plot_mw_dist
  1.     syntax, outstub(str) [width(int 2221) height(int 1615)]
  2. 
.     keep if pct_ch_MW > 0
  3.     twoway (hist pct_ch_MW, color(navy%80) lcolor(white) lw(vthin)),      
>  ///
>         xtitle("Minimum wage increase (%)") ytitle("Relative frequency")   //
> /
>         xlabel(, labsize(small)) ylabel(, labsize(small))                  //
> /
>         graphregion(color(white)) bgcolor(white)
  4.     
.     graph export `outstub'/pct_ch_mw_dist.png, replace width(`width') height(
> `height')
  5.     graph export `outstub'/pct_ch_mw_dist.eps, replace
  6. 
.     twoway (hist year_month, color(navy%80) lcolor(white) lw(vthin)),       /
> //
>         xtitle("Monthly date") ytitle("Relative frequency")                 /
> //
>         xlabel(`=mofd(td(01jun2010))'(6)`=mofd(td(01dec2019))',             /
> //
>                labsize(small) angle(45))                                    /
> //
>         graphregion(color(white)) bgcolor(white)
  7.     
.     graph export `outstub'/pct_ch_mw_date_dist.png, replace width(`width') he
> ight(`height')
  8.     graph export `outstub'/pct_ch_mw_date_dist.eps, replace 
  9. end

. 
. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month
(3,316 missing values generated)
(3,316 observations deleted)
(187,036 observations deleted)
(note: file ../output/pct_ch_mw_dist.png not found)
(file ../output/pct_ch_mw_dist.png written in PNG format)
(note: file ../output/pct_ch_mw_dist.eps not found)
(file ../output/pct_ch_mw_dist.eps written in EPS format)
(note: file ../output/pct_ch_mw_date_dist.png not found)
(file ../output/pct_ch_mw_date_dist.png written in PNG format)
(note: file ../output/pct_ch_mw_date_dist.eps not found)
(file ../output/pct_ch_mw_date_dist.eps written in EPS format)

. 
end of do-file


Execute:  StataMP-64 /e do "./zillow_entry.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./zillow_entry.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local outstub "../output"
  3.     
.     local rent_var  "medrentpricepsqft_SFCC"
  4.     local target_ym "2015m1"
  5.      
.     build_entry_plot, instub(`instub') rent_var(`rent_var') ///
>         target_ym(`target_ym') geo(zipcode) geo_name(zipcode)
  6.     build_entry_plot, instub(`instub') rent_var(`rent_var') ///
>         target_ym(`target_ym') geo(county) geo_name(countyfips)
  7. end

. 
. program build_entry_plot
  1.     syntax, instub(str) rent_var(str) target_ym(str) ///
>         geo(str) geo_name(str) [width(int 2221) height(int 1615)]
  2.     
.     use "`instub'/`geo'_months.dta", clear
  3.     keep if !missing(`rent_var')
  4.     gcollapse (min) min_year_month = year_month, by(`geo_name')
  5.     
.     unique `geo_name'
  6.     local total_geo = r(N)
  7.     
.     bysort min_year_month: egen nbr_entrant = count(`geo_name')
  8.     drop `geo_name'
  9.     by min_year_month: keep if _n == 1
 10.     gen share_entrant = nbr_entrant/`total_geo'
 11.     gen cum_share_entrant = sum(share_entrant)
 12.     
.     sum cum_share_entrant if min_year_month >= `=tm(`target_ym')'
 13.     local cum_share_at_target = r(min)
 14.     local cum_share_at_target : di %6.3f `cum_share_at_target'
 15.     
.     label var nbr_entrant        "Number of entrants"
 16.     label var cum_share_entrant  "Cumulative share of entrants"
 17.     label var min_year_month     "Monthly date"
 18.     
.     twoway (line nbr_entrant min_year_month, yaxis(1))                  ///
>            (line cum_share_entrant min_year_month, yaxis(2)),           ///
>         text(0.8 `=tm(`target_ym')' "`cum_share_at_target'", yaxis(2))  ///
>         xline(`=tm(`target_ym')') legend(row(2))                        ///
>         graphregion(color(white)) bgcolor(white)
 19.     
.     graph export "../output/`geo'_entrants.png", replace width(`width') heigh
> t(`height')
 20. end

. 
. main
(118,204 observations deleted)
Number of unique values of zipcode is  3316
Number of records is  3316
(3,214 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cum_share_~t |         45    .6910736    .2417033   .4056092          1
(note: file ../output/zipcode_entrants.png not found)
(file ../output/zipcode_entrants.png written in PNG format)
(0 observations deleted)
Number of unique values of countyfips is  703
Number of records is  703
(608 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cum_share_~t |         42    .8295739    .1264094   .6642959          1
(note: file ../output/county_entrants.png not found)
(file ../output/county_entrants.png written in PNG format)

. 
end of do-file


Execute:  StataMP-64 /e do "./preclean_summary_tables.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean_summary_tables.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000


. 
. program main
  1.     local instub_zipcode   "../../../drive/derived_large/zipcode"
  2.     local instub_irs       "../../../drive/base_large/irs_soi"
  3.     local instub_safmr     "../../../base/safmr/output"
  4.     local instub_zip_mth   "../../../drive/derived_large/zipcode_month"   
  5.     local instub_est_samp  "../../../drive/derived_large/estimation_sample
> s"    
  6. 
.     local base_year = 2014
  7. 
.     * Cross-sections    
.     clean_irs, instub(`instub_irs') base_year(`base_year')
  8.     save_data "../temp/irs_`base_year'_clean.dta",  log(none)      ///
>         key(zipcode) replace
  9.     
.     clean_safmr, instub(`instub_safmr')
 10.     save_data "../temp/safmr_clean.dta",     log(none)      ///
>         key(zipcode countyfips cbsa year) replace
 11.     
.     keep if year == `base_year'
 12.     drop year
 13.     save_data "../temp/safmr_`base_year'_clean.dta", log(none)     ///
>         key(zipcode countyfips cbsa)  replace
 14.     
.     use zipcode countyfips cbsa statefips year_month year  ///
>         month medrentprice_SFCC medrentprice_2BR           ///
>         medrentpricepsqft_* statutory_mw                   ///
>         using "`instub_zip_mth'/zipcode_month_panel.dta", clear
 15.     
.     merge m:1 zipcode using "`instub_zipcode'/zipcode_cross.dta", nogen ///
>         assert(2 3)
 16.     merge 1:1 zipcode year_month using "`instub_est_samp'/zipcode_months.d
> ta", ///
>         nogen assert(1 3) keepusing(fullbal_sample_SFCC)
 17. 
.     build_zip_lvl_samples, instub(`instub_est_samp') base_year(`base_year')
 18.     foreach data in "all"              "all_urban"          ///
>                     "all_zillow_rents" "baseline" {
 19.         
.         use "../temp/`data'_zipcodes.dta", clear
 20.         merge 1:1 zipcode using "`instub_zipcode'/zipcode_cross.dta", noge
> n ///
>             assert(2 3) keep(3)
 21.         merge 1:1 zipcode using "../temp/statutory_mw_dec`base_year'.dta",
>   ///
>             nogen keep(1 3)
 22.         merge 1:1 zipcode using "../temp/statutory_mw_dec2019.dta",  ///
>             nogen keep(1 3)
 23.         merge 1:1 zipcode using "../temp/rents_dec`base_year'.dta",      /
> //
>             nogen keep(1 3)
 24.         merge 1:1 zipcode using "../temp/irs_`base_year'_clean.dta",     /
> //
>             nogen keep(1 3)
 25.         merge 1:1 zipcode countyfips cbsa                       ///
>             using "../temp/safmr_`base_year'_clean.dta", nogen keep(1 3)
 26.         
.         save_data "../output/`data'_zipcode_lvl_data.dta",        ///
>             key(zipcode) replace
 27.         export delimited "../output/`data'_zipcode_lvl_data.csv", replace
 28.     }
 29.     
.     * Panel
.     use zipcode countyfips cbsa statefips year_month year month    ///
>         statutory_mw mw_wkp_tot_17 mw_res  *_SFCC  ln_rent*        ///
>         mw_wkp_earn_under1250_17 mw_wkp_age_under29_17             ///
>         ln_emp_bizserv ln_emp_info ln_emp_fin                      ///
>         ln_estcount_bizserv ln_estcount_info ln_estcount_fin       ///
>         ln_avgwwage_bizserv ln_avgwwage_info ln_avgwwage_fin fullbal_sample_S
> FCC ///
>         using "`instub_est_samp'/zipcode_months.dta", clear
 30.     
.     keep if fullbal_sample_SFCC == 1
 31. 
.     merge m:1 zipcode countyfips cbsa year using "../temp/safmr_clean.dta", /
> //
>         nogen keep(1 3)
 32.     
.     save_data "../output/baseline_zillow_rents_zipcode_months.dta", ///
>             key(zipcode year_month) replace
 33.     export delimited "../output/baseline_zillow_rents_zipcode_months.csv",
>  replace
 34. end

. 
. program clean_irs 
  1.     syntax, instub(str) base_year(str)
  2.     
.     use "`instub'/irs_zip.dta", clear
  3. 
.     drop if inlist(zipcode, "0", "00000", "99999")    
  4.     keep if year == `base_year'
  5.     
.     keep zipcode statefips share_wage_hhlds share_bussiness_hhlds /// 
>          share_farmer_hhlds agi_per_hhld wage_per_wage_hhld       ///
>          wage_per_hhld bussines_rev_per_owner
  6. end

. 
. program clean_safmr 
  1.     syntax, instub(str)
  2.     
.     use "`instub'/safmr_2012_2016_by_zipcode_county_cbsa.dta", clear
  3.     keep zipcode countyfips cbsa year safmr1br safmr2br safmr3br    
  4. end

. 
. program build_zip_lvl_samples
  1.     syntax, instub(str) base_year(str)
  2.     
.     preserve
  3.         keep if year == `base_year' & month == 12
  4.         keep zipcode medrentprice_SFCC medrentpricepsqft_SFCC     ///
>             medrentprice_2BR medrentpricepsqft_2BR
  5.         save "../temp/rents_dec`base_year'.dta", replace
  6.     restore
  7.     
.     preserve
  8.         keep if year == `base_year' & month == 12
  9.         keep zipcode statutory_mw
 10.         rename statutory_mw statutory_mw_dec`base_year'
 11.         save "../temp/statutory_mw_dec`base_year'.dta", replace
 12.     restore
 13.     
.     preserve
 14.         keep if year == 2019 & month == 12
 15.         keep zipcode statutory_mw
 16.         rename statutory_mw statutory_mw_dec2019
 17.         save "../temp/statutory_mw_dec2019.dta", replace
 18.     restore
 19.     
.     preserve
 20.         keep zipcode countyfips cbsa statefips urban_cbsa urban_zip
 21.         duplicates drop zipcode, force
 22.         save "../temp/all_zipcodes.dta", replace
 23.     restore 
 24.     
.     preserve
 25.         keep if urban_cbsa == 1
 26.         keep zipcode countyfips cbsa statefips urban_cbsa urban_zip
 27.         duplicates drop zipcode, force
 28.         save "../temp/all_urban_zipcodes.dta", replace
 29.     restore 
 30.     
.     preserve
 31.         keep if !missing(medrentpricepsqft_SFCC)
 32.         keep zipcode countyfips cbsa statefips urban_cbsa urban_zip
 33.         duplicates drop zipcode, force
 34.         save "../temp/all_zillow_rents_zipcodes.dta", replace
 35.     restore 
 36. 
.     preserve
 37.         keep if fullbal_sample_SFCC == 1
 38.         keep zipcode countyfips cbsa statefips urban_cbsa urban_zip
 39.         duplicates drop zipcode, force
 40.         save "../temp/baseline_zipcodes.dta", replace
 41.     restore 
 42. end

. 
. main
(1,020 observations deleted)
(279,151 observations deleted)
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../temp/irs_2014_clean.dta
Key: zipcode
===============================================================================
  27679:9(21818):2570474605:3696125402

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
   statefips |          0
agi_per_hhld |     27,679    60362.86    46953.68   10026.67    2441296
wage_per_w~d |     27,679    48644.99    26145.38   9513.333   854060.8
wage_per_h~d |     27,679    39706.83    20069.26   7506.667   539549.5
-------------+---------------------------------------------------------
bussines_r~r |     26,380    10904.39    8219.813      -7305     195960
share_wage~s |     27,679    .8196309    .0648014   .2058824          1
share_buss~s |     27,679    .1516093    .0556574          0   .6470588
share_farm~s |     27,679    .0480508    .0754136          0         .7




(note: file ../temp/irs_2014_clean.dta not found)
file ../temp/irs_2014_clean.dta saved
(data now sorted by zipcode countyfips cbsa year)
  (0 bytes saved)
===============================================================================
File: ../temp/safmr_clean.dta
Key: zipcode countyfips cbsa year
===============================================================================
  121696:7(80564):1001697157:2638936076

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
        cbsa |          0
        year |    121,696    2014.043    1.431673       2012       2016
    safmr1br |    121,696    749.0634     270.163        310       2370
-------------+---------------------------------------------------------
    safmr2br |    121,696    926.0885    322.9981        370       2960
    safmr3br |    121,696    1237.018    434.3868        510       4090




(note: file ../temp/safmr_clean.dta not found)
file ../temp/safmr_clean.dta saved
(97,588 observations deleted)
(data now sorted by zipcode countyfips cbsa)
  (0 bytes saved)
===============================================================================
File: ../temp/safmr_2014_clean.dta
Key: zipcode countyfips cbsa
===============================================================================
  24108:6(81559):1311446374:2140467578

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
        cbsa |          0
    safmr1br |     24,108    742.2304    256.6465        310       1860
    safmr2br |     24,108    926.2527     309.771        370       2320
-------------+---------------------------------------------------------
    safmr3br |     24,108    1243.798    418.7427        510       3420




(note: file ../temp/safmr_2014_clean.dta not found)
file ../temp/safmr_2014_clean.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         4,201,032  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                     3,884,850
        from master                 3,884,850  
        from using                          0  

    matched                           316,182  
    -----------------------------------------
(4,169,206 observations deleted)
(note: file ../temp/rents_dec2014.dta not found)
file ../temp/rents_dec2014.dta saved
(4,169,206 observations deleted)
(note: file ../temp/statutory_mw_dec2014.dta not found)
file ../temp/statutory_mw_dec2014.dta saved
(4,169,206 observations deleted)
(note: file ../temp/statutory_mw_dec2019.dta not found)
file ../temp/statutory_mw_dec2019.dta saved

Duplicates in terms of zipcode

(4,169,206 observations deleted)
(note: file ../temp/all_zipcodes.dta not found)
file ../temp/all_zipcodes.dta saved
(2,702,304 observations deleted)

Duplicates in terms of zipcode

(1,487,374 observations deleted)
(note: file ../temp/all_urban_zipcodes.dta not found)
file ../temp/all_urban_zipcodes.dta saved
(4,003,054 observations deleted)

Duplicates in terms of zipcode

(194,662 observations deleted)
(note: file ../temp/all_zillow_rents_zipcodes.dta not found)
file ../temp/all_zillow_rents_zipcodes.dta saved
(4,120,332 observations deleted)

Duplicates in terms of zipcode

(79,355 observations deleted)
(note: file ../temp/baseline_zipcodes.dta not found)
file ../temp/baseline_zipcodes.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,826  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,170
        from master                     4,170  
        from using                          0  

    matched                            27,656  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        16,145
        from master                    16,145  
        from using                          0  

    matched                            15,681  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/all_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  31826:130(79515):2142985200:1707374954

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
   statefips |          0
        cbsa |          0
  urban_cbsa |     31,826    .3567523    .4790483          0          1
-------------+---------------------------------------------------------
   urban_zip |     31,826    .3105008     .462706          0          1
n_census_b~s |     31,826    347.5485    355.6261          1       9067
n_blockgro~s |     31,826    10.53764    11.06662          1        101
    n_tracts |     31,826    5.120656    4.595078          1         47
    n_places |     31,826    2.566864       1.694          1         81
-------------+---------------------------------------------------------
  n_counties |     31,826    1.451643     .701879          1          7
      n_cbsa |     31,826    1.248288    .5038121          1          5
    n_states |     31,826    1.016119    .1259348          1          2
  num_houses |     31,826    4137.897    5588.921          0      48073
  population |     31,826    9700.601    13766.08          0     115182
-------------+---------------------------------------------------------
    sh_rural |     31,826    .5668876    .3567429          0          1
sh_rural_w~s |     31,574    .4790736     .363997          0          1
       tract |          0
  place_code |          0
n_months_z~s |      3,316    59.70386    34.21254         12        119
-------------+---------------------------------------------------------
populat~2010 |     31,826    9681.695    13753.56          0     115182
n_male_~2010 |     31,826    4759.893    6725.643          0      57965
n_white~2010 |     31,826    7016.612    9524.533          0      91407
n_black~2010 |     31,826    1213.561    3811.352          0      79984
urb_pop~2010 |     31,826    7812.452    13652.63          0     115182
-------------+---------------------------------------------------------
n_hhlds_ce~0 |     31,826    4128.574    5580.337          0      48073
n_hhlds_ur~0 |     31,826    3258.792    5559.654          0      48073
n_hhlds_re~0 |     31,826    1274.883    2374.503          0      33601
rural_p~2010 |     31,826    1869.243    2541.051          0      26907
populat~2014 |     31,226    9635.241    13841.53          0     113110
-------------+---------------------------------------------------------
n_worke~2014 |     31,226    4336.024    6376.469          0      51695
n_mw_wkrs_~y |     31,226    734.8547    1120.011          0      11264
n_mw_wkrs_~e |     31,226    732.9745    1114.556          0      11264
n_mw_wkrs_~d |     31,226    688.9029    1035.913          0      10627
med_hhl~2014 |     31,160    29205.87    24818.16          8   231076.1
-------------+---------------------------------------------------------
sh_whit~2010 |     31,604    .8344599    .2032514          0          1
sh_blac~2010 |     31,604    .0753265    .1550807          0          1
sh_male~2010 |     31,604    .5017386    .0423811          0          1
sh_urb_~2010 |     31,604     .390969    .4367148          0          1
sh_rura~2010 |     31,604     .609031    .4367148          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |     31,547    .3872851    .4356147          0          1
sh_hhlds_r~0 |     31,547    .2240798    .1448693          0          1
sh_mw_wkrs~y |     30,988    .1775676    .0614415          0          1
sh_mw_wkrs~e |     30,988    .1774481    .0614074          0          1
sh_mw_wkrs~d |     30,988    .1691248    .0592188          0          1
-------------+---------------------------------------------------------
sh_re~9_2014 |     31,604    .2160803    .0456733          0          1
sh_re~4_2014 |     31,604    .5410591    .0510288          0          1
sh_re~5_2014 |     31,604    .2428606     .054422          0          1
sh_re~0_2014 |     31,604    .2594513    .0550484          0          1
sh_residen.. |     31,604    .3663793    .0795585          0          1
-------------+---------------------------------------------------------
sh_residen.. |     31,604    .3741694    .1039106          0          1
sh_re~S_2014 |     31,604    .0893863    .0394663          0          1
sh_residen.. |     31,604    .2393183    .0524941          0          1
sh_residen.. |     31,604    .2576356    .0406384          0          1
sh_r~ge_2014 |     31,604    .1975794    .0650461          0          1
-------------+---------------------------------------------------------
sh_re~f_2014 |     31,604    .1098402     .071182          0          1
sh_r~il_2014 |     31,604    .1143655    .0330656          0          1
sh_r~ce_2014 |     31,604    .0349056    .0212502          0         .5
sh_re~d_2014 |     31,604    .0840959    .0380299          0          1
sh_wo~9_2014 |     30,796    .2110735    .0864552          0          1
-------------+---------------------------------------------------------
sh_wo~4_2014 |     30,796    .5356553    .0942901          0          1
sh_wo~5_2014 |     30,796    .2532711    .0966846          0          1
sh_wo~0_2014 |     30,796    .2964679    .1402982          0          1
sh_workers.. |     30,796    .3769024    .1245662          0          1
sh_workers.. |     30,796    .3266297    .1597939          0          1
-------------+---------------------------------------------------------
sh_wo~S_2014 |     30,796    .1002324    .0615843          0          1
sh_workers.. |     30,796    .2565252    .0901008          0          1
sh_workers.. |     30,796    .2538325    .0728999          0          1
sh_w~ge_2014 |     30,796    .1783363    .0836753          0          1
sh_wo~f_2014 |     30,796    .0979869    .1543259          0          1
-------------+---------------------------------------------------------
sh_w~il_2014 |     30,796    .1089871    .1174735          0          1
sh_w~ce_2014 |     30,796    .0265891    .0579786          0          1
sh_wo~d_2014 |     30,796    .0829965    .1157328          0          1
sh_re~9_2017 |     31,539     .223932     .048058          0          1
sh_re~4_2017 |     31,539    .5230601    .0548097          0          1
-------------+---------------------------------------------------------
sh_re~5_2017 |     31,539    .2530078    .0579319          0          1
sh_re~0_2017 |     31,539    .2435743    .0561917          0          1
sh_residen.. |     31,539    .3496767     .081093          0          1
sh_residen.. |     31,539     .406749    .1058708          0          1
sh_re~S_2017 |     31,539     .089734    .0405314          0          1
-------------+---------------------------------------------------------
sh_residen.. |     31,539    .2323392     .053887          0          1
sh_residen.. |     31,539    .2549181    .0461318          0          1
sh_r~ge_2017 |     31,539    .1990766    .0664623          0          1
sh_re~f_2017 |     31,539     .105875    .0679906          0          1
sh_r~il_2017 |     31,539    .1155329    .0339016          0          1
-------------+---------------------------------------------------------
sh_r~ce_2017 |     31,539    .0348457     .021443          0         .5
sh_re~d_2017 |     31,539    .0879353    .0421151          0          1
sh_wo~9_2017 |     30,745    .2154053    .0868001          0          1
sh_wo~4_2017 |     30,745    .5157884    .0944545          0          1
sh_wo~5_2017 |     30,745    .2688063    .0997894          0          1
-------------+---------------------------------------------------------
sh_wo~0_2017 |     30,745    .2814243    .1359782          0          1
sh_workers.. |     30,745    .3642706    .1209817          0          1
sh_workers.. |     30,745    .3543051    .1595226          0          1
sh_wo~S_2017 |     30,745    .1008578    .0611871          0          1
sh_workers.. |     30,745    .2523721    .0910078          0          1
-------------+---------------------------------------------------------
sh_workers.. |     30,745    .2526431    .0756963          0          1
sh_w~ge_2017 |     30,745    .1787217    .0846085          0          1
sh_wo~f_2017 |     30,745    .0955913    .1514867          0          1
sh_w~il_2017 |     30,745    .1087085    .1186967          0          1
sh_w~ce_2017 |     30,745     .025094    .0561649          0          1
-------------+---------------------------------------------------------
sh_wo~d_2017 |     30,745    .0864658     .119429          0          1
sh_od_resi.. |     28,351     .217595    .0425543          0          1
sh_od_resi.. |     28,351    .2606909    .0513135          0          1
sh_od_work.. |     28,438    .2111762    .0873105          0          1
sh_od_work.. |     28,438    .2971929    .1417987          0          1
-------------+---------------------------------------------------------
sh_work_sa~o |     25,357    .0956746    .1130862   .0001702   .9622344
sh_od_work.. |     25,357    .0197891    .0249193          0        .25
sh_od_work.. |     25,357    .0299781    .0346739          0   .4464988
sh_od_resi.. |     28,459    .2249602    .0411901          0   .7762431
sh_od_resi.. |     28,459    .2446687    .0496904          0          1
-------------+---------------------------------------------------------
sh_od_work.. |     28,552    .2156865    .0881378          0          1
sh_od_work.. |     28,552    .2823066    .1376744          0          1
sh_od_work.. |     25,558    .0207173    .0262185          0   .3162583
sh_od_work.. |     25,558    .0289729    .0337249          0   .3595969
statuto~2014 |     31,826     7.73908    .6385167       7.25         15
-------------+---------------------------------------------------------
statuto~2019 |     31,826    8.850147    1.898795       7.25      16.09
medren~e_2BR |        483    1906.622    967.7345        500       6445
medre~e_SFCC |      1,251    1602.207    695.4662        650     5547.5
medren~t_2BR |        365    1.763086     .862842   .5744048   5.626667
medre~t_SFCC |      1,337    1.218405    1.073852    .466805         20
-------------+---------------------------------------------------------
agi_per_hhld |     27,656    60357.53    46938.25   10026.67    2441296
wage_per_w~d |     27,656    48638.16    26109.82   9513.333   854060.8
wage_per_h~d |     27,656    39702.73    20048.02   7506.667   539549.5
bussines_r~r |     26,367    10904.85    8217.671      -7305     195960
share_wage~s |     27,656    .8196282    .0647338   .2058824          1
-------------+---------------------------------------------------------
share_buss~s |     27,656     .151652    .0555908          0   .6470588
share_farm~s |     27,656    .0480747    .0754292          0         .7
    safmr1br |     15,681    752.1536    261.8853        410       1860
    safmr2br |     15,681    936.1731    309.8877        560       2270
    safmr3br |     15,681    1253.896    414.2924        700       3200




(note: file ../output/all_zipcode_lvl_data.dta not found)
file ../output/all_zipcode_lvl_data.dta saved
(note: file ../output/all_zipcode_lvl_data.csv not found)
file ../output/all_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            11,354  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            11,354  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            11,354  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            11,354  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,014
        from master                     1,014  
        from using                          0  

    matched                            10,340  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,228
        from master                     1,228  
        from using                          0  

    matched                            10,126  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/all_urban_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  11354:130(79515):3696312119:2004178605

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
   statefips |          0
        cbsa |          0
  urban_cbsa |     11,354           1           0          1          1
-------------+---------------------------------------------------------
   urban_zip |     11,354    .6617932    .4731201          0          1
n_census_b~s |     11,354    385.0749    325.6016          1       3775
n_blockgro~s |     11,354    16.65748    13.52875          1        101
    n_tracts |     11,354    7.707856    5.544102          1         47
    n_places |     11,354    2.963009    1.948434          1         24
-------------+---------------------------------------------------------
  n_counties |     11,354    1.304298    .5841238          1          6
      n_cbsa |     11,354    1.121455    .3634293          1          4
    n_states |     11,354    1.011714    .1075999          1          2
  num_houses |     11,354     7417.33    6868.101          0      48073
  population |     11,354    18071.83    17340.35          0     115182
-------------+---------------------------------------------------------
    sh_rural |     11,354    .3434178    .3629637          0          1
sh_rural_w~s |     11,216    .2882475    .3558462          0          1
       tract |          0
  place_code |          0
n_months_z~s |      2,864    61.92039    34.57791         12        119
-------------+---------------------------------------------------------
populat~2010 |     11,354    18018.83    17338.05          0     115182
n_male_~2010 |     11,354    8833.255    8477.333          0      57965
n_white~2010 |     11,354    12272.35    11613.01          0      91407
n_black~2010 |     11,354    2390.286    5571.724          0      79984
urb_pop~2010 |     11,354    16688.15    17583.79          0     115182
-------------+---------------------------------------------------------
n_hhlds_ce~0 |     11,354    7391.196    6860.979          0      48073
n_hhlds_ur~0 |     11,354    6831.503    6991.749          0      48073
n_hhlds_re~0 |     11,354    2492.006    3263.764          0      33601
rural_p~2010 |     11,354    1330.676    2357.118          0      22729
populat~2014 |     10,942    18164.81    17579.81          0     113110
-------------+---------------------------------------------------------
n_worke~2014 |     10,942    8342.837    8118.426          0      51695
n_mw_wkrs_~y |     10,942    1357.983    1417.427          0      11264
n_mw_wkrs_~e |     10,942    1352.927    1408.012          0      11264
n_mw_wkrs_~d |     10,942    1251.452    1289.688          0       9783
med_hhl~2014 |     10,944    46024.51    28923.06          8   231076.1
-------------+---------------------------------------------------------
sh_whit~2010 |     11,224    .7648088    .2192516          0          1
sh_blac~2010 |     11,224    .0999477    .1722957          0          1
sh_male~2010 |     11,224     .497022    .0449199          0          1
sh_urb_~2010 |     11,224    .7253919    .3926132          0          1
sh_rura~2010 |     11,224    .2746081    .3926132          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |     11,189    .7225478    .3934959          0          1
sh_hhlds_r~0 |     11,189    .2827434    .1775689          0          1
sh_mw_wkrs~y |     10,814     .167204    .0684679          0          1
sh_mw_wkrs~e |     10,814    .1668835    .0683427          0          1
sh_mw_wkrs~d |     10,814    .1556177    .0654995          0          1
-------------+---------------------------------------------------------
sh_re~9_2014 |     11,247     .219017    .0466112          0          1
sh_re~4_2014 |     11,247    .5503699    .0454743          0          1
sh_re~5_2014 |     11,247     .230613     .050893          0          1
sh_re~0_2014 |     11,247    .2417686     .052713          0          1
sh_residen.. |     11,247    .3270592    .0814473          0          1
-------------+---------------------------------------------------------
sh_residen.. |     11,247    .4311722    .1153425          0          1
sh_re~S_2014 |     11,247    .0948462    .0447652          0          1
sh_residen.. |     11,247    .2035184    .0420463          0          1
sh_residen.. |     11,247    .2468568     .033016          0          1
sh_r~ge_2014 |     11,247    .2357615    .0750711          0          1
-------------+---------------------------------------------------------
sh_re~f_2014 |     11,247    .0821882    .0490844          0         .6
sh_r~il_2014 |     11,247    .1094532     .027091          0          1
sh_r~ce_2014 |     11,247    .0432357    .0238927          0         .5
sh_re~d_2014 |     11,247     .090359     .037032          0          1
sh_wo~9_2014 |     11,196    .2223181    .0703594          0          1
-------------+---------------------------------------------------------
sh_wo~4_2014 |     11,196     .543483    .0678158          0          1
sh_wo~5_2014 |     11,196    .2341989    .0669132          0          1
sh_wo~0_2014 |     11,196    .2759918    .1126949          0          1
sh_workers.. |     11,196    .3512858    .0946491          0          1
sh_workers.. |     11,196    .3727223    .1451288          0          1
-------------+---------------------------------------------------------
sh_wo~S_2014 |     11,196    .1052847    .0542555          0          1
sh_workers.. |     11,196    .2157319    .0620496          0          1
sh_workers.. |     11,196    .2460298    .0508678          0          1
sh_w~ge_2014 |     11,196    .2106354    .0790535          0          1
sh_wo~f_2014 |     11,196    .0808272    .1210045          0          1
-------------+---------------------------------------------------------
sh_w~il_2014 |     11,196     .113746    .0992471          0          1
sh_w~ce_2014 |     11,196    .0300968     .054407          0          1
sh_wo~d_2014 |     11,196    .0968426    .1024884          0          1
sh_re~9_2017 |     11,253    .2256169     .047671          0          1
sh_re~4_2017 |     11,253    .5341768    .0469515          0          1
-------------+---------------------------------------------------------
sh_re~5_2017 |     11,253    .2402064    .0521541          0          1
sh_re~0_2017 |     11,253    .2239433    .0485072          0          1
sh_residen.. |     11,253     .312031    .0835389          0          1
sh_residen.. |     11,253    .4640257    .1144644          0          1
sh_re~S_2017 |     11,253    .0975467    .0437104          0          1
-------------+---------------------------------------------------------
sh_residen.. |     11,253    .1991538    .0404897          0          1
sh_residen.. |     11,253     .242723    .0356154          0          1
sh_r~ge_2017 |     11,253    .2349596    .0747802          0          1
sh_re~f_2017 |     11,253    .0792641     .047298          0          1
sh_r~il_2017 |     11,253    .1087098    .0293133          0          1
-------------+---------------------------------------------------------
sh_r~ce_2017 |     11,253    .0434088    .0246907          0   .3333333
sh_re~d_2017 |     11,253    .0930895    .0377297          0          1
sh_wo~9_2017 |     11,186    .2280261     .071201          0          1
sh_wo~4_2017 |     11,186    .5245217    .0683726          0          1
sh_wo~5_2017 |     11,186    .2474521    .0707809          0          1
-------------+---------------------------------------------------------
sh_wo~0_2017 |     11,186    .2579024    .1055137          0          1
sh_workers.. |     11,186    .3395161    .0939751          0          1
sh_workers.. |     11,186    .4025815    .1438776          0          1
sh_wo~S_2017 |     11,186    .1082851    .0548089          0          1
sh_workers.. |     11,186    .2129894    .0643797          0          1
-------------+---------------------------------------------------------
sh_workers.. |     11,186    .2412629    .0489136          0          1
sh_w~ge_2017 |     11,186    .2094366    .0780641          0          1
sh_wo~f_2017 |     11,186    .0772053    .1161446          0          1
sh_w~il_2017 |     11,186    .1119083     .096914          0          1
sh_w~ce_2017 |     11,186    .0282217    .0515733          0          1
-------------+---------------------------------------------------------
sh_wo~d_2017 |     11,186    .1006603    .1049143          0          1
sh_od_resi.. |      9,893    .2205045    .0458258          0          1
sh_od_resi.. |      9,893     .243805    .0518967          0          1
sh_od_work.. |      9,959    .2230161     .071684          0          1
sh_od_work.. |      9,959    .2775662    .1151007          0          1
-------------+---------------------------------------------------------
sh_work_sa~o |      9,341    .0730458    .0703629      .0004   .7323904
sh_od_work.. |      9,341    .0158272    .0165823          0        .25
sh_od_work.. |      9,341    .0229621    .0216072          0   .2600146
sh_od_resi.. |      9,903    .2270837    .0443456          0   .6158358
sh_od_resi.. |      9,903    .2253808    .0471732          0          1
-------------+---------------------------------------------------------
sh_od_work.. |      9,972    .2289389    .0728624          0          1
sh_od_work.. |      9,972    .2589464    .1074788          0          1
sh_od_work.. |      9,392    .0164403    .0178401          0   .3162583
sh_od_work.. |      9,392    .0213794    .0204966          0   .3378839
statuto~2014 |     11,354    7.969416    .6991739       7.25         15
-------------+---------------------------------------------------------
statuto~2019 |     11,354    9.520766    2.232344       7.25      16.09
medren~e_2BR |        471    1933.815    964.2005        500       6445
medre~e_SFCC |      1,166    1638.016    703.5919        650     5547.5
medren~t_2BR |        359    1.777868    .8621382   .5744048   5.626667
medre~t_SFCC |      1,237    1.256233    1.107001    .466805         20
-------------+---------------------------------------------------------
agi_per_hhld |     10,340    76286.03    69978.54   12484.21    2441296
wage_per_w~d |     10,340    60768.28    37531.32   11194.12   854060.8
wage_per_h~d |     10,340    49776.41    28025.09   8910.485   539549.5
bussines_r~r |     10,198    14279.35    10637.18      -7305     195960
share_wage~s |     10,340    .8300029    .0632153   .2058824          1
-------------+---------------------------------------------------------
share_buss~s |     10,340    .1612602    .0499502          0   .4603175
share_farm~s |     10,340    .0145201    .0363211          0   .4285714
    safmr1br |     10,126    829.7018    283.0371        440       1860
    safmr2br |     10,126    1028.327    333.2623        570       2270
    safmr3br |     10,126    1382.175    442.1699        790       3200




(note: file ../output/all_urban_zipcode_lvl_data.dta not found)
file ../output/all_urban_zipcode_lvl_data.dta saved
(note: file ../output/all_urban_zipcode_lvl_data.csv not found)
file ../output/all_urban_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,316  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             9
        from master                         9  
        from using                          0  

    matched                             3,307  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           360
        from master                       360  
        from using                          0  

    matched                             2,956  
    -----------------------------------------
(data already sorted by zipcode)
  variable n_blockgroups was int now byte
  (3,316 bytes saved)
===============================================================================
File: ../output/all_zillow_rents_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  3316:130(79515):1197305608:1604733247

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
   statefips |          0
        cbsa |          0
  urban_cbsa |      3,316    .8636912    .3431679          0          1
-------------+---------------------------------------------------------
   urban_zip |      3,316    .9420989    .2335915          0          1
n_census_b~s |      3,316    606.7708    352.2224          2       5451
n_blockgro~s |      3,316    27.71713    11.64457          1         82
    n_tracts |      3,316    12.30217    4.728567          1         42
    n_places |      3,316    3.378468    2.134259          1         24
-------------+---------------------------------------------------------
  n_counties |      3,316    1.275332    .5605487          1          5
      n_cbsa |      3,316    1.061218    .2555995          1          3
    n_states |      3,316    1.006634     .081194          1          2
  num_houses |      3,316    14386.66    5565.609        637      48073
  population |      3,316    33856.99    14789.11        387     110682
-------------+---------------------------------------------------------
    sh_rural |      3,316    .1669437    .2425524          0          1
sh_rural_w~s |      3,316    .1346825    .2411732          0          1
       tract |          0
  place_code |          0
n_months_z~s |      3,316    59.70386    34.21254         12        119
-------------+---------------------------------------------------------
populat~2010 |      3,316    33687.93    14948.33          0     110682
n_male_~2010 |      3,316    16456.21    7341.985          0      53020
n_white~2010 |      3,316    22200.04    11123.57          0      91407
n_black~2010 |      3,316    5231.483    7512.326          0      71202
urb_pop~2010 |      3,316    32562.38    14995.86          0     110682
-------------+---------------------------------------------------------
n_hhlds_ce~0 |      3,316    14301.71    5637.275          0      48073
n_hhlds_ur~0 |      3,316    13821.47    5719.315          0      48073
n_hhlds_re~0 |      3,316    5020.075    3321.408          0      33601
rural_p~2010 |      3,316    1125.549    2448.338          0      19862
populat~2014 |      3,139     34862.5    15157.31        544     113110
-------------+---------------------------------------------------------
n_worke~2014 |      3,139    16300.36    7246.965        273      51695
n_mw_wkrs_~y |      3,139    2594.239    1369.876         36      10627
n_mw_wkrs_~e |      3,139    2582.186    1355.671         36      10627
n_mw_wkrs_~d |      3,139    2412.956    1263.043         31      10627
med_hhl~2014 |      3,194    57851.81    23888.92   8394.843   196272.2
-------------+---------------------------------------------------------
sh_whit~2010 |      3,298    .6791784    .2089788   .0048626   .9844657
sh_blac~2010 |      3,298    .1534291    .1969505   .0023229   .9808114
sh_male~2010 |      3,298    .4888367    .0216543   .3554951   .8231398
sh_urb_~2010 |      3,298    .9601275    .0945332          0          1
sh_rura~2010 |      3,298    .0398725    .0945332          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |      3,298    .9592807    .0968126          0          1
sh_hhlds_r~0 |      3,298     .340291    .1479458    .032175   .8815922
sh_mw_wkrs~y |      3,139    .1604141    .0511786   .0132085   .5346981
sh_mw_wkrs~e |      3,139     .159852    .0510826   .0132085   .5346981
sh_mw_wkrs~d |      3,139    .1494986    .0490994   .0098463   .5346981
-------------+---------------------------------------------------------
sh_re~9_2014 |      3,316    .2237932    .0377947   .1175516   .4469967
sh_re~4_2014 |      3,316    .5622997    .0364063   .3398832   .7652216
sh_re~5_2014 |      3,316    .2139071    .0396935   .1036269   .5323951
sh_re~0_2014 |      3,316    .2348274    .0481822   .0777202   .4083505
sh_residen.. |      3,316     .328764    .0813861    .082038   .5582995
-------------+---------------------------------------------------------
sh_residen.. |      3,316    .4364086    .1222037   .1334413   .8402418
sh_re~S_2014 |      3,316    .1002766    .0321473   .0408713   .2485696
sh_residen.. |      3,316    .1929931    .0302099    .095037   .2734949
sh_residen.. |      3,316    .2436899    .0200475   .1424015    .306957
sh_r~ge_2014 |      3,316    .2392471    .0694397   .0868073   .4818741
-------------+---------------------------------------------------------
sh_re~f_2014 |      3,316    .0637242    .0339607   .0049571   .2253579
sh_r~il_2014 |      3,316     .109316    .0215632   .0312165    .197472
sh_r~ce_2014 |      3,316    .0469231    .0232526   .0104987   .2334559
sh_re~d_2014 |      3,316    .1017735    .0362392   .0483592   .4068069
sh_wo~9_2014 |      3,316    .2393917    .0492909   .0946335   .4733234
-------------+---------------------------------------------------------
sh_wo~4_2014 |      3,316    .5487401    .0380399    .400479   .6959906
sh_wo~5_2014 |      3,316    .2118683    .0329587   .0883864   .3501199
sh_wo~0_2014 |      3,316    .2697087    .0772665   .0445043     .53989
sh_workers.. |      3,316    .3547061    .0638238    .094796   .6394389
sh_workers.. |      3,316    .3755852    .1193243   .0927186   .8606997
-------------+---------------------------------------------------------
sh_wo~S_2014 |      3,316     .106945    .0334085    .037864   .3340807
sh_workers.. |      3,316    .1968094    .0321466    .101549   .4108032
sh_workers.. |      3,316    .2397837    .0214902   .1469472   .3274307
sh_w~ge_2014 |      3,316    .2170702    .0639888   .0663198   .5271118
sh_wo~f_2014 |      3,316    .0586454    .0811885          0   .7940117
-------------+---------------------------------------------------------
sh_w~il_2014 |      3,316    .1371108     .078333   .0032206   .6094801
sh_w~ce_2014 |      3,316    .0380531    .0450845          0   .5842744
sh_wo~d_2014 |      3,316    .1161409    .0718752          0   .7661766
sh_re~9_2017 |      3,316    .2317039     .043641   .1149316   .5027715
sh_re~4_2017 |      3,316    .5466451    .0377563   .3133708   .7714187
-------------+---------------------------------------------------------
sh_re~5_2017 |      3,316    .2216509    .0425595   .0835913   .5419213
sh_re~0_2017 |      3,316    .2192983     .046283   .0763664   .3917885
sh_residen.. |      3,316    .3137962    .0832348   .0854917   .5313962
sh_residen.. |      3,316    .4669055    .1228907   .1664881   .8252264
sh_re~S_2017 |      3,316    .1043216    .0325645    .040891   .2702693
-------------+---------------------------------------------------------
sh_residen.. |      3,316     .188564    .0293739   .0961573    .271939
sh_residen.. |      3,316    .2378026    .0223212   .1310313   .3120655
sh_r~ge_2017 |      3,316    .2376078    .0698314   .0942029   .4850746
sh_re~f_2017 |      3,316    .0616982    .0325589    .005814   .2177266
sh_r~il_2017 |      3,316    .1073627    .0217567   .0283525   .2845158
-------------+---------------------------------------------------------
sh_r~ce_2017 |      3,316    .0468093    .0238468          0   .2581369
sh_re~d_2017 |      3,316     .104597    .0349545   .0489156   .3666597
sh_wo~9_2017 |      3,309    .2455185     .048096   .1123348   .4871833
sh_wo~4_2017 |      3,309    .5335403    .0368875   .3728814   .6800871
sh_wo~5_2017 |      3,309    .2209412     .034191   .0760911   .4911894
-------------+---------------------------------------------------------
sh_wo~0_2017 |      3,309    .2502581    .0708414   .0401723   .5352423
sh_workers.. |      3,309    .3448133    .0667768   .0660942    .591314
sh_workers.. |      3,309    .4049286    .1203724   .1224052   .8880573
sh_wo~S_2017 |      3,309     .111077    .0339634    .043345   .3147471
sh_workers.. |      3,309    .1924792    .0312964   .0887432   .4482219
-------------+---------------------------------------------------------
sh_workers.. |      3,309    .2350395    .0217218   .1393807   .3220339
sh_w~ge_2017 |      3,309    .2158857    .0639791    .061535   .5022355
sh_wo~f_2017 |      3,309     .055325    .0761292          0   .7677997
sh_w~il_2017 |      3,309    .1349788    .0766796   .0033874   .7472644
sh_w~ce_2017 |      3,309    .0373275     .048044          0   .7147541
-------------+---------------------------------------------------------
sh_wo~d_2017 |      3,309    .1200021    .0728993          0   .7501325
sh_od_resi.. |      3,143    .2237895    .0366899   .1175516   .4388004
sh_od_resi.. |      3,143    .2361378    .0483092   .0777202   .4083505
sh_od_work.. |      3,143    .2404455    .0495957   .0946335   .4733234
sh_od_work.. |      3,143    .2714882    .0772554   .0445043   .5398899
-------------+---------------------------------------------------------
sh_work_sa~o |      3,142    .0911355    .0818334   .0004613   .7051915
sh_od_work.. |      3,142    .0205674    .0200369          0   .1704769
sh_od_work.. |      3,142    .0265189    .0235881   .0001845   .2345845
sh_od_resi.. |      3,143    .2314234     .041996   .1149316   .4919482
sh_od_resi.. |      3,143    .2202188    .0461853   .0763664   .3917885
-------------+---------------------------------------------------------
sh_od_work.. |      3,143    .2465974    .0483363   .1123348   .4871833
sh_od_work.. |      3,143     .251605    .0706934   .0401723   .5352423
sh_od_work.. |      3,142    .0213936    .0210564          0    .208455
sh_od_work.. |      3,142    .0247382    .0219387          0   .2167781
statuto~2014 |      3,316    7.937073    .7273923       7.25   11.26579
-------------+---------------------------------------------------------
statuto~2019 |      3,316    9.401509    2.331658       7.25         16
medren~e_2BR |        381    1886.193    1012.079        500       6445
medre~e_SFCC |      1,182    1588.138    689.5805        650     5547.5
medren~t_2BR |        338    1.776875     .885237   .5744048   5.626667
medre~t_SFCC |      1,337    1.218405    1.073852    .466805         20
-------------+---------------------------------------------------------
agi_per_hhld |      3,307    83008.35    75512.34   20333.03    1224284
wage_per_w~d |      3,307    64643.26    40794.08   18644.86   460283.5
wage_per_h~d |      3,307    53163.13    30872.06   8910.485   386309.4
bussines_r~r |      3,307    15143.63    10463.64  -1172.266   85100.83
share_wage~s |      3,307    .8355341    .0642051   .2574335   .9615384
-------------+---------------------------------------------------------
share_buss~s |      3,307    .1756483    .0451925   .0671723    .368974
share_farm~s |      3,307    .0025844     .004931          0   .0918561
    safmr1br |      2,956    878.5386    270.3207        430       1860
    safmr2br |      2,956    1087.422    326.2263        570       2260
    safmr3br |      2,956    1478.681     442.807        800       3090




(note: file ../output/all_zillow_rents_zipcode_lvl_data.dta not found)
file ../output/all_zillow_rents_zipcode_lvl_data.dta saved
(note: file ../output/all_zillow_rents_zipcode_lvl_data.csv not found)
file ../output/all_zillow_rents_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,345  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         2  
        from using                          0  

    matched                             1,343  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           130
        from master                       130  
        from using                          0  

    matched                             1,215  
    -----------------------------------------
(data already sorted by zipcode)
  variable n_blockgroups was int now byte
  (1,345 bytes saved)
===============================================================================
File: ../output/baseline_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  1345:130(79515):716482340:1905140814

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
   statefips |          0
        cbsa |          0
  urban_cbsa |      1,345    .9249071    .2636393          0          1
-------------+---------------------------------------------------------
   urban_zip |      1,345    .9643123    .1855794          0          1
n_census_b~s |      1,345    609.3338    335.5577          2       3153
n_blockgro~s |      1,345    28.56059    12.02098          1         82
    n_tracts |      1,345     12.7368    4.750065          1         42
    n_places |      1,345    3.260223    2.022368          1         19
-------------+---------------------------------------------------------
  n_counties |      1,345    1.266171    .5568237          1          5
      n_cbsa |      1,345    1.040892    .2018348          1          3
    n_states |      1,345    1.006691    .0815575          1          2
  num_houses |      1,345     16206.9    5783.221        777      48073
  population |      1,345    38297.84    15137.98        458     110682
-------------+---------------------------------------------------------
    sh_rural |      1,345    .1620164    .2445389          0          1
sh_rural_w~s |      1,345    .1358236    .2481849          0          1
       tract |          0
  place_code |          0
n_months_z~s |      1,345    99.33086    12.19923         60        119
-------------+---------------------------------------------------------
populat~2010 |      1,345    38052.87    15415.13          0     110682
n_male_~2010 |      1,345    18544.72    7531.331          0      53020
n_white~2010 |      1,345     24638.4    11497.71          0      91407
n_black~2010 |      1,345    6465.306    8930.621          0      71202
urb_pop~2010 |      1,345    37107.07    15460.31          0     110682
-------------+---------------------------------------------------------
n_hhlds_ce~0 |      1,345    16080.83    5903.241          0      48073
n_hhlds_ur~0 |      1,345    15693.95    5998.335          0      48073
n_hhlds_re~0 |      1,345    5495.526    3576.813          0      33601
rural_p~2010 |      1,345    945.7985    2141.596          0      18977
populat~2014 |      1,263    39716.78    15456.57        544     113110
-------------+---------------------------------------------------------
n_worke~2014 |      1,263    18765.99    7451.046        273      51695
n_mw_wkrs_~y |      1,263    2795.567     1347.95         55      10054
n_mw_wkrs_~e |      1,263    2790.898    1341.355         55      10054
n_mw_wkrs_~d |      1,263    2611.652    1256.586         41       9322
med_hhl~2014 |      1,294    60456.92    22922.85      15041   176169.7
-------------+---------------------------------------------------------
sh_whit~2010 |      1,336    .6673737    .1980062   .0048626   .9642324
sh_blac~2010 |      1,336    .1612541    .1939937   .0040479   .9808114
sh_male~2010 |      1,336    .4880788     .019867   .3554951    .616951
sh_urb_~2010 |      1,336    .9717187    .0703948          0          1
sh_rura~2010 |      1,336    .0282813    .0703948          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |      1,336    .9708522    .0729391          0          1
sh_hhlds_r~0 |      1,336    .3328068    .1435928    .032175   .8815922
sh_mw_wkrs~y |      1,263    .1496538    .0468274   .0132085   .5346981
sh_mw_wkrs~e |      1,263    .1494866    .0469282   .0132085   .5346981
sh_mw_wkrs~d |      1,263    .1396238    .0441804   .0098463   .5346981
-------------+---------------------------------------------------------
sh_re~9_2014 |      1,345     .222439    .0379449   .1175516   .4469967
sh_re~4_2014 |      1,345    .5719002    .0373745   .3592794   .7652216
sh_re~5_2014 |      1,345    .2056608    .0383204   .1036269   .4994901
sh_re~0_2014 |      1,345    .2261313    .0474486   .0777202    .385433
sh_residen.. |      1,345    .3249231    .0851118    .082038   .5582995
-------------+---------------------------------------------------------
sh_residen.. |      1,345    .4489456    .1256572   .1608947   .8402418
sh_re~S_2014 |      1,345    .1030454    .0310926   .0454065   .2485696
sh_residen.. |      1,345    .1907314    .0292051    .095037   .2598086
sh_residen.. |      1,345     .243545    .0220856   .1424015   .3025153
sh_r~ge_2014 |      1,345    .2402392    .0678723   .0993842   .4818741
-------------+---------------------------------------------------------
sh_re~f_2014 |      1,345    .0566266    .0299861   .0055801    .203093
sh_r~il_2014 |      1,345    .1098472    .0234725   .0347783    .197472
sh_r~ce_2014 |      1,345    .0505188    .0256959   .0166889   .2334559
sh_re~d_2014 |      1,345    .1048834    .0419938   .0483592   .3872122
sh_wo~9_2014 |      1,345     .244581    .0490803   .1078271   .4348348
-------------+---------------------------------------------------------
sh_wo~4_2014 |      1,345    .5518759    .0381823   .4235255   .6933745
sh_wo~5_2014 |      1,345    .2035431    .0311324   .1206349   .3365713
sh_wo~0_2014 |      1,345    .2709894    .0786553    .046502     .53989
sh_workers.. |      1,345    .3579813    .0683967   .0962664   .6394389
sh_workers.. |      1,345    .3710293    .1263868   .0927186   .8572316
-------------+---------------------------------------------------------
sh_wo~S_2014 |      1,345    .1115221    .0323512   .0490927   .3340807
sh_workers.. |      1,345    .1936652    .0306046    .101549   .2934486
sh_workers.. |      1,345    .2365793    .0215153   .1469472   .3078745
sh_w~ge_2014 |      1,345    .2136525    .0657363   .0790359    .501032
sh_wo~f_2014 |      1,345    .0524569    .0775468          0   .7000245
-------------+---------------------------------------------------------
sh_w~il_2014 |      1,345    .1463642    .0829936   .0042981   .5060976
sh_w~ce_2014 |      1,345    .0413816    .0502977          0   .5081062
sh_wo~d_2014 |      1,345    .1234222    .0731739   .0044248   .7661766
sh_re~9_2017 |      1,345     .230249    .0440097   .1149316   .5027715
sh_re~4_2017 |      1,345    .5562973    .0383084   .3361656   .7714187
-------------+---------------------------------------------------------
sh_re~5_2017 |      1,345    .2134537    .0410643   .0835913   .5235594
sh_re~0_2017 |      1,345    .2118172    .0444956   .0763664   .3917885
sh_residen.. |      1,345     .310743    .0872692   .0854917   .5282834
sh_residen.. |      1,345    .4774398    .1258987   .1688096   .8252264
sh_re~S_2017 |      1,345    .1074978    .0319334   .0414658   .2702693
-------------+---------------------------------------------------------
sh_residen.. |      1,345    .1868724    .0284306   .0961573   .2593532
sh_residen.. |      1,345    .2376017     .024178   .1310313   .3120655
sh_r~ge_2017 |      1,345    .2377792    .0681624   .1024648   .4850746
sh_re~f_2017 |      1,345    .0546291    .0284542   .0065308   .1894767
sh_r~il_2017 |      1,345    .1075862     .023697   .0283525   .2845158
-------------+---------------------------------------------------------
sh_r~ce_2017 |      1,345    .0507136    .0265165   .0153323   .2581369
sh_re~d_2017 |      1,345    .1071651    .0394618   .0511364   .3617381
sh_wo~9_2017 |      1,343    .2510646     .047173   .1184052   .4515854
sh_wo~4_2017 |      1,343    .5370417    .0372478   .4128551   .6715788
sh_wo~5_2017 |      1,343    .2118938    .0313564   .0970492   .3570053
-------------+---------------------------------------------------------
sh_wo~0_2017 |      1,343    .2522849    .0726177   .0458484   .5345794
sh_workers.. |      1,343      .35008    .0713215   .0660942    .591314
sh_workers.. |      1,343     .397635    .1273987   .1224052   .8880573
sh_wo~S_2017 |      1,343    .1157688    .0327828   .0499089   .3147471
sh_workers.. |      1,343    .1894876    .0292483   .0887432   .2763074
-------------+---------------------------------------------------------
sh_workers.. |      1,343    .2315612    .0211954   .1393807   .2861793
sh_w~ge_2017 |      1,343    .2121178    .0657955   .0730337   .5022355
sh_wo~f_2017 |      1,343    .0485139     .071148          0    .714326
sh_w~il_2017 |      1,343    .1443048    .0802307   .0033874    .512011
sh_w~ce_2017 |      1,343    .0408032    .0545627          0   .7147541
-------------+---------------------------------------------------------
sh_wo~d_2017 |      1,343    .1266246    .0721966   .0036842   .7501325
sh_od_resi.. |      1,290    .2211801    .0354707   .1175516   .4101118
sh_od_resi.. |      1,290    .2272542    .0475832   .0777202    .385433
sh_od_work.. |      1,290    .2454018     .049471   .1078271   .4348348
sh_od_work.. |      1,290    .2732725    .0782477   .0620935   .5398899
-------------+---------------------------------------------------------
sh_work_sa~o |      1,289    .0792788    .0649948   .0033323   .4929577
sh_od_work.. |      1,289    .0180823    .0165294          0    .160144
sh_od_work.. |      1,289    .0225734    .0186832   .0003029   .1624775
sh_od_resi.. |      1,290    .2285187    .0408629   .1149316   .4476933
sh_od_resi.. |      1,290    .2127592    .0443127   .0763664   .3917885
-------------+---------------------------------------------------------
sh_od_work.. |      1,290     .251879    .0475221   .1184052   .4514894
sh_od_work.. |      1,290    .2543156    .0720213   .0459653   .5345795
sh_od_work.. |      1,289     .018867     .017303          0   .1801208
sh_od_work.. |      1,289    .0212357     .017169          0   .1539802
statuto~2014 |      1,345    7.873136    .6449406       7.25      10.74
-------------+---------------------------------------------------------
statuto~2019 |      1,345    9.226173    2.212871       7.25         16
medren~e_2BR |        302    1910.258    1033.437        500       6445
medre~e_SFCC |      1,097    1594.171    698.8688        650     5547.5
medren~t_2BR |        279    1.806261     .941961   .5744048   5.626667
medre~t_SFCC |      1,337    1.218405    1.073852    .466805         20
-------------+---------------------------------------------------------
agi_per_hhld |      1,343    83946.93       71120   20333.03   941570.3
wage_per_w~d |      1,343    66207.32    39280.02   18644.86   460283.5
wage_per_h~d |      1,343     55232.9    31084.78   10996.04   386309.4
bussines_r~r |      1,343    14424.32    10347.07  -1172.266   79470.97
share_wage~s |      1,343    .8426899    .0585087   .3245521   .9410898
-------------+---------------------------------------------------------
share_buss~s |      1,343    .1816334    .0465421   .0754098   .3620981
share_farm~s |      1,343    .0018666    .0032148          0   .0336352
    safmr1br |      1,215    916.7243    259.0112        450       1830
    safmr2br |      1,215    1131.951     312.978        610       2260
    safmr3br |      1,215    1545.004    424.3176        850       3090




(note: file ../output/baseline_zipcode_lvl_data.dta not found)
file ../output/baseline_zipcode_lvl_data.dta saved
(note: file ../output/baseline_zipcode_lvl_data.csv not found)
file ../output/baseline_zipcode_lvl_data.csv saved
(235,482 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                        50,100
        from master                    50,100  
        from using                          0  

    matched                            30,600  
    -----------------------------------------
(data now sorted by zipcode year_month)
  (0 bytes saved)
===============================================================================
File: ../output/baseline_zillow_rents_zipcode_months.dta
Key: zipcode year_month
===============================================================================
  80700:42(68090):3377733263:2979438106

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |     80,700       689.5    17.31821        660        719
        year |     80,700        2017    1.414222       2015       2019
       month |     80,700         6.5    3.452074          1         12
  countyfips |          0
-------------+---------------------------------------------------------
   statefips |          0
        cbsa |          0
statutory_mw |     80,700     8.55957    1.583697       7.25         16
      mw_res |     80,700    2.132054    .1678798   1.981001   2.772589
mw_wkp_to~17 |     80,700     2.13596    .1632247   1.981412   2.694137
-------------+---------------------------------------------------------
mw_wkp_ag~17 |     80,700     2.13487    .1625511   1.981337   2.707357
mw_wkp_ea~17 |     80,700    2.133612    .1612053   1.981312   2.681439
medpctpric~C |     74,400    2.896641    1.367161   .0003726   23.35717
medre~e_SFCC |     74,012    1757.887    901.5042        625      30000
medre~t_SFCC |     80,700    1.319908    1.012426   .4660688       22.2
-------------+---------------------------------------------------------
    ln_rents |     80,700    .1368194    .4708669  -.7634219   3.100092
 ln_rents_SF |     65,334    .0261591     .386203  -.7634219   3.100092
 ln_rents_CC |     17,662    .6740228    .4685472  -.5386367   1.918392
ln_rents_S~o |     10,648    .4389444    .7638353   -.761489   1.971606
ln_rents_1BR |     22,003    .7240709    .3990232   -.308494   1.899293
-------------+---------------------------------------------------------
ln_rents_2BR |     34,645    .4409738    .4297053  -.6901123   1.872875
ln_rents_3BR |     37,075    .1118161     .395125  -.6811742   1.866231
ln_rents_4BR |      6,359   -.0721204    .4025065   -.562713   2.967022
ln_rents_5BR |        201    .9081627     1.36747  -.3452744   2.972244
ln_rents_M~x |      5,385    .8533463    .5715035  -.6632233   1.900493
-------------+---------------------------------------------------------
ln_rents_M~s |     42,173    .4710137    .4394236  -.6719947   1.895206
ln_emp_biz~v |     80,700    11.19374    1.376256   6.021023   13.38876
 ln_emp_info |     80,352    9.011645    1.567368   2.397895   12.38988
  ln_emp_fin |     80,688    10.22864    1.434146    4.75359   12.89542
ln_estcoun~v |     80,700    8.713603     1.24719   4.356709   10.96353
-------------+---------------------------------------------------------
ln_estcoun~o |     80,700    6.125135    1.351283   1.609438   9.531191
ln_estcoun~n |     80,700    8.008003    1.208489   3.663562   10.33748
ln_avgwwag~v |     80,700    7.143119    .3080602   5.726848   8.178078
ln_avgwwag~o |     80,352    7.327531    .3554562   5.891644   8.906665
ln_avgwwag~n |     80,688    7.311874    .3682792   6.326149   9.163982
-------------+---------------------------------------------------------
yr_entry_t~C |     80,700    2011.395    .9874227       2010       2015
qtr_entry_~C |     80,700    206.6022    4.066773        200        220
fullbal_sa~C |     80,700           1           0          1          1
unbalanced~C |     80,700           1           0          1          1
    safmr1br |     30,600    971.5098    295.9037        450       2370
-------------+---------------------------------------------------------
    safmr2br |     30,600    1198.675    363.5874        610       2960
    safmr3br |     30,600    1632.518    489.3127        870       4090




(note: file ../output/baseline_zillow_rents_zipcode_months.dta not found)
file ../output/baseline_zillow_rents_zipcode_months.dta saved
(note: file ../output/baseline_zillow_rents_zipcode_months.csv not found)
file ../output/baseline_zillow_rents_zipcode_months.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./build_summary_tables.R" build_summary_tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(dplyr)

Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

> source("../../../lib/R/save_data.R")

Please cite as: 

 Hlavac, Marek (2018). stargazer: Well-Formatted Regression and Summary Statistics Tables.
 R package version 5.2.2. https://CRAN.R-project.org/package=stargazer 


Attaching package: 'data.table'

The following objects are masked from 'package:dplyr':

    between, first, last

> 
> main <- function() {
+   
+   ## ZIP level stats
+   all_zipcodes      <- load_data("all_zipcode_lvl_data.csv")
+   urban_zipcodes    <- load_data("all_urban_zipcode_lvl_data.csv")
+   zillow_zipcodes   <- load_data("all_zillow_rents_zipcode_lvl_data.csv")
+   baseline_zipcodes <- load_data("baseline_zipcode_lvl_data.csv")
+ 
+   all_zipcodes_stats      <- build_basic_stats(all_zipcodes)
+   urban_zipcodes_stats    <- build_basic_stats(urban_zipcodes)
+   zillow_zipcodes_stats   <- build_basic_stats(zillow_zipcodes)
+   baseline_zipcodes_stats <- build_basic_stats(baseline_zipcodes)
+   
+   zip_lvl_stats <- t(rbind(all_zipcodes_stats, urban_zipcodes_stats, 
+                            zillow_zipcodes_stats, baseline_zipcodes_stats))
+   
+   txt <- c("<tab:stats_zip_samples>")
+   writeLines(txt, "../output/stats_zip_samples.txt")
+   write.table(zip_lvl_stats, "../output/stats_zip_samples.txt", 
+               append = TRUE, sep = "\t", dec = ".",
+               row.names = FALSE, col.names = FALSE)
+   
+   ## ZIP-month stats of baseline panel
+   baseline_panel <- load_data("baseline_zillow_rents_zipcode_months.csv")
+   
+   vars_for_table <- c("statutory_mw", "mw_res", "mw_wkp_tot_17",
+                       "mw_wkp_earn_under1250_17", "mw_wkp_age_under29_17",
+                       "medrentprice_SFCC", "medrentpricepsqft_SFCC", "ln_rents", 
+                       #paste0("ln_rents_", c("SF", "CC", "Studio", "1BR", "2BR", "3BR", "Mfr5Plus")), 
+                       "ln_emp_bizserv", "ln_estcount_bizserv", "ln_avgwwage_bizserv", 
+                       "ln_emp_info", "ln_estcount_info", "ln_avgwwage_info", 
+                       "ln_emp_fin", "ln_estcount_fin", "ln_avgwwage_fin")
+ 
+   txt <- c("<tab:stats_est_panel>")
+   writeLines(txt, "../output/stats_est_panel.txt")
+   for (var in vars_for_table) {
+     var_row <- build_panel_stats_row(baseline_panel, var)
+     write.table(var_row, "../output/stats_est_panel.txt",
+                 append = TRUE, sep = "\t", dec = ".",
+                 row.names = FALSE, col.names = FALSE)
+   }
+ }
> 
> load_data <- function(filename, instub = "../output") {
+   return(data.table::fread(file.path(instub, filename),
+                            colClasses = c(zipcode = "character")))
+ }
> 
> build_basic_stats <- function(df) {
+   df %>%
+     summarise(tot_pop_cens2010              = sum(population_cens2010, na.rm = T)/1000,
+               tot_hhlds_cens2010            = sum(n_hhlds_cens2010, na.rm = T)/1000,
+               mean_pop_cens2010             = mean(population_cens2010, na.rm = T),
+               mean_hhlds_cens2010           = mean(n_hhlds_cens2010, na.rm = T),
+               sh_urb_pop_cens2010           = mean(sh_urb_pop_cens2010, na.rm = T),
+               sh_hhlds_renteroccup_cens2010 = mean(sh_hhlds_renteroccup_cens2010, na.rm = T),
+               sh_black_cens2010             = mean(sh_black_cens2010, na.rm = T),
+               sh_white_cens2010             = mean(sh_white_cens2010, na.rm = T),
+               share_wage_hhlds_irs2014      = mean(share_wage_hhlds, na.rm = T),
+               share_bussiness_hhlds_irs2014 = mean(share_bussiness_hhlds, na.rm = T),
+               agi_per_hhld_irs_2014         = mean(agi_per_hhld, na.rm = T)/1000,
+               wage_per_hhld_irs2014         = mean(wage_per_hhld, na.rm = T)/1000,
+               rent40thperc_2br_safmr2014    = mean(safmr2br, na.rm = T),
+               min_binding_mw_dec2014        = min(statutory_mw_dec2014, na.rm = T),
+               avg_binding_mw_dec2014        = mean(statutory_mw_dec2014, na.rm = T),
+               max_binding_mw_dec2014        = max(statutory_mw_dec2014, na.rm = T),
+               min_binding_mw_dec2019        = min(statutory_mw_dec2019, na.rm = T),
+               avg_binding_mw_dec2019        = mean(statutory_mw_dec2019, na.rm = T),
+               max_binding_mw_dec2019        = max(statutory_mw_dec2019, na.rm = T),
+               zip_count                     = n_distinct(zipcode),
+               county_count                  = n_distinct(countyfips),
+               state_count                   = n_distinct(statefips))
+ }
> 
> build_panel_stats_row <-  function(panel, var){
+   panel %>% 
+     summarise(across(.cols = all_of(var),
+                      .fns  = list(n    = ~ sum(!is.na(.x)), 
+                                   mean = ~ mean(.x, na.rm = T), 
+                                   sd   = ~ sd(.x, na.rm = T), 
+                                   min  = ~ min(.x, na.rm = T), 
+                                   max  = ~ max(.x, na.rm = T))))
+ }
> 
> 
> main()
> 
> proc.time()
   user  system elapsed 
   2.42    0.85    4.62 

 make.py ended: 2022-07-05 13:22:17
