
 make.py started: 2022-03-14 11:53:58 C:\Users\diegog\Desktop\Diego\min_wage_rent\descriptive\estimation_samples\code 




Execute:  StataMP-64 /e do "./plot_mw.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./plot_mw.do 

. clear all

. set more off

. 
. program main
  1.     local instub "../../../drive/derived_large/estimation_samples"
  2.     local outstub "../output"
  3. 
.     use zipcode zipcode_num year_month statutory_mw ///
>         using "`instub'/zipcode_months.dta", clear
  4.     xtset zipcode_num year_month
  5.     gen pct_ch_MW = 100*(statutory_mw/L.statutory_mw - 1)
  6.     drop if missing(pct_ch_MW)
  7.     
.     plot_mw_dist, outstub(`outstub')
  8. end

. 
. program plot_mw_dist
  1.     syntax, outstub(str)
  2. 
.     twoway (hist pct_ch_MW if pct_ch_MW>0, color(navy%80) lcolor(white) lw(vt
> hin)), ///
>         xtitle("Minimum wage changes (%)") ytitle("Relative frequency") ///
>         xlabel(, labsize(small)) ylabel(, labsize(small)) ///
>         graphregion(color(white)) bgcolor(white)
  3.     graph export `outstub'/pct_ch_mw_dist.png, replace 
  4.     graph export `outstub'/pct_ch_mw_dist.eps, replace
  5. 
.     keep if pct_ch_MW > 0
  6.     twoway (hist year_month, color(navy%80) lcolor(white) lw(vthin)), ///
>         xtitle("Monthly date") ytitle("Relative frequency") ///
>         xlabel(`=mofd(td(01jun2010))'(6)`=mofd(td(01dec2019))', labsize(small
> ) angle(45)) ///
>         graphregion(color(white)) bgcolor(white)
  7.     graph export `outstub'/pct_ch_mw_date_dist.png, replace 
  8.     graph export `outstub'/pct_ch_mw_date_dist.eps, replace 
  9. end

. 
. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month
(3,310 missing values generated)
(3,310 observations deleted)
(note: file ../output/pct_ch_mw_dist.png not found)
(file ../output/pct_ch_mw_dist.png written in PNG format)
(note: file ../output/pct_ch_mw_dist.eps not found)
(file ../output/pct_ch_mw_dist.eps written in EPS format)
(186,899 observations deleted)
(note: file ../output/pct_ch_mw_date_dist.png not found)
(file ../output/pct_ch_mw_date_dist.png written in PNG format)
(note: file ../output/pct_ch_mw_date_dist.eps not found)
(file ../output/pct_ch_mw_date_dist.eps written in EPS format)

. 
end of do-file


Execute:  StataMP-64 /e do "./zillow_entry.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./zillow_entry.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local outstub "../output"
  3.     
.     local rent_var  "medrentpricepsqft_SFCC"
  4.     local target_ym "2015m1"
  5.      
.     build_entry_plot, instub(`instub') rent_var(`rent_var') ///
>         target_ym(`target_ym') geo(zipcode) geo_name(zipcode)
  6.     build_entry_plot, instub(`instub') rent_var(`rent_var') ///
>         target_ym(`target_ym') geo(county) geo_name(countyfips)
  7. end

. 
. program build_entry_plot
  1.     syntax, instub(str) rent_var(str) target_ym(str) ///
>         geo(str) geo_name(str)
  2.     
.     use "`instub'/`geo'_months.dta", clear
  3.     keep if !missing(`rent_var')
  4.     gcollapse (min) min_year_month = year_month, by(`geo_name')
  5.     
.     unique `geo_name'
  6.     local total_geo = r(N)
  7.     
.     bysort min_year_month: egen nbr_entrant = count(`geo_name')
  8.     drop `geo_name'
  9.     by min_year_month: keep if _n == 1
 10.     gen share_entrant = nbr_entrant/`total_geo'
 11.     gen cum_share_entrant = sum(share_entrant)
 12.     
.     sum cum_share_entrant if min_year_month >= `=tm(`target_ym')'
 13.     local cum_share_at_target = r(min)
 14.     local cum_share_at_target : di %6.3f `cum_share_at_target'
 15.     
.     label var nbr_entrant        "Number of entrants"
 16.     label var cum_share_entrant  "Cumulative share of entrants"
 17.     label var min_year_month     "Year-month"
 18.     
.     twoway (line nbr_entrant min_year_month, yaxis(1)) ///
>            (line cum_share_entrant min_year_month, yaxis(2)), ///
>         text(0.8 `=tm(`target_ym')' "`cum_share_at_target'", yaxis(2)) ///
>         xline(`=tm(`target_ym')') legend(row(2)) ///
>         graphregion(color(white)) bgcolor(white)
 19.     graph export "../output/`geo'_entrants.png", replace
 20. end

. 
. main
(0 observations deleted)
Number of unique values of zipcode is  3310
Number of records is  3310
(3,208 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cum_share_~t |         45    .6914602    .2416195   .4060423          1
(note: file ../output/zipcode_entrants.png not found)
(file ../output/zipcode_entrants.png written in PNG format)
(0 observations deleted)
Number of unique values of countyfips is  700
Number of records is  700
(605 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cum_share_~t |         42    .8294558    .1262686   .6642857          1
(note: file ../output/county_entrants.png not found)
(file ../output/county_entrants.png written in PNG format)

. 
end of do-file


Execute:  StataMP-64 /e do "./preclean_summary_tables.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./preclean_summary_tables.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000


. 
. program main
  1.     local instub_demo      "../../../drive/derived_large/demographics_at_b
> aseline"
  2.     local instub_irs       "../../../drive/base_large/irs_soi"
  3.     local instub_safmr     "../../../base/safmr/output"
  4.     local instub_zip_mth   "../../../drive/derived_large/zipcode_month"   
  5.     local instub_est_samp  "../../../drive/derived_large/estimation_sample
> s"    
  6. 
. 
.     clean_demo, instub(`instub_demo')
  7.     save_data "../temp/demo_clean.dta",  log(none)      ///
>         key(zipcode) replace
  8.     
.     clean_irs, instub(`instub_irs')
  9.     save_data "../temp/irs_2010_clean.dta",  log(none)      ///
>         key(zipcode) replace
 10.     
.     clean_safmr, instub(`instub_safmr')
 11.     save_data "../temp/safmr_clean.dta",     log(none)      ///
>         key(zipcode countyfips cbsa year) replace
 12.     
.     keep if year == 2012
 13.     drop year
 14.     save_data "../temp/safmr_2012_clean.dta", log(none)     ///
>         key(zipcode countyfips cbsa)  replace
 15.     
.     use zipcode countyfips cbsa statefips year_month year  ///
>         month medrentprice_SFCC medrentpricepsqft_SFCC            ///
>         medrentprice_2BR medrentpricepsqft_2BR ///
>         statutory_mw ///
>         using "`instub_zip_mth'/zipcode_month_panel.dta", clear
 16.     merge m:1 zipcode using "../temp/demo_clean.dta", nogen ///
>         assert(2 3)
 17.     merge 1:1 zipcode year_month using "`instub_est_samp'/zipcode_months.d
> ta", ///
>         nogen assert(1 3) keepusing(baseline_sample)
 18. 
.     build_zip_lvl_samples, instub(`instub_est_samp')
 19.     foreach data in "all"              "all_urban"          ///
>                     "all_zillow_rents" "baseline" {
 20.         
.         use "../temp/`data'_zipcodes.dta", clear
 21.         merge 1:1 zipcode using "../temp/demo_clean.dta", nogen ///
>             assert(2 3) keep(3)
 22.         merge 1:1 zipcode using "../temp/statutory_mw_feb2010.dta",  ///
>             nogen keep(1 3)
 23.         merge 1:1 zipcode using "../temp/statutory_mw_dec2019.dta",  ///
>             nogen keep(1 3)
 24.         merge 1:1 zipcode using "../temp/rents_jan2015.dta",      ///
>             nogen keep(1 3)
 25.         merge 1:1 zipcode using "../temp/irs_2010_clean.dta",     ///
>             nogen keep(1 3)
 26.         merge 1:1 zipcode countyfips cbsa                       ///
>             using "../temp/safmr_2012_clean.dta", nogen keep(1 3)
 27.         
.         drop countyfips cbsa statefips
 28. 
.         save_data "../output/`data'_zipcode_lvl_data.dta",        ///
>             key(zipcode) replace
 29.         export delimited "../output/`data'_zipcode_lvl_data.csv", replace
 30.     }
 31.     
.     use zipcode countyfips cbsa statefips year_month year month  ///
>         statutory_mw mw_wkp_tot_17 mw_res                               ///
>         medrentpricepsqft_SFCC medrentprice_SFCC                   ///
>         ln_rents medrentpricepsqft_2BR medrentprice_2BR            ///
>         ln_emp_bizserv ln_emp_info ln_emp_fin                      ///
>         ln_estcount_bizserv ln_estcount_info ln_estcount_fin       ///
>         ln_avgwwage_bizserv ln_avgwwage_info ln_avgwwage_fin baseline_sample 
> ///
>         using "`instub_est_samp'/zipcode_months.dta" ///
>         if baseline_sample == 1, clear
 32.     merge m:1 zipcode countyfips cbsa year using "../temp/safmr_clean.dta"
> , ///
>         nogen keep(1 3)
 33.     save_data "../output/baseline_zillow_rents_zipcode_months.dta", ///
>             key(zipcode year_month) replace
 34.     export delimited "../output/baseline_zillow_rents_zipcode_months.csv",
>  replace
 35. end

. 
. program clean_demo
  1.     syntax, instub(str)
  2.     
.     use "`instub'/zipcode.dta", clear
  3.     gen sh_urban_pop_2010 = 1 - sh_rural_pop_2010 if !missing(sh_rural_pop
> _2010)
  4.     gen rural = (sh_rural_pop_2010 >= 0.6) if !missing(sh_rural_pop_2010)
  5. end

. 
. program clean_irs 
  1.     syntax, instub(str)
  2.     
.     use "`instub'/irs_zip.dta", clear
  3. 
.     drop if inlist(zipcode, "0", "00000")    
  4.     keep if year == 2010
  5.     
.     keep zipcode statefips share_wage_hhlds share_bussiness_hhlds /// 
>          share_farmer_hhlds agi_per_hhld wage_per_wage_hhld ///
>          wage_per_hhld bussines_rev_per_owner
  6. end

. 
. program clean_safmr 
  1.     syntax, instub(str)
  2.     
.     use "`instub'/safmr_2012_2016_by_zipcode_county_cbsa.dta", clear
  3.     keep zipcode countyfips cbsa year safmr1br safmr2br safmr3br    
  4. end

. 
. program build_zip_lvl_samples
  1.     syntax, instub(str)
  2.     
.     preserve
  3.         keep if year == 2015 & month == 1
  4.         keep zipcode medrentprice_SFCC medrentpricepsqft_SFCC     ///
>         medrentprice_2BR medrentpricepsqft_2BR
  5.         save "../temp/rents_jan2015.dta", replace
  6.     restore
  7.     
.     preserve
  8.         keep if year == 2010 & month == 2
  9.         keep zipcode statutory_mw
 10.         rename statutory_mw statutory_mw_feb2010
 11.         save "../temp/statutory_mw_feb2010.dta", replace
 12.     restore
 13.     
.     preserve
 14.         keep if year == 2019 & month == 12
 15.         keep zipcode statutory_mw
 16.         rename statutory_mw statutory_mw_dec2019
 17.         save "../temp/statutory_mw_dec2019.dta", replace
 18.     restore
 19.     
.     preserve
 20.         keep zipcode countyfips cbsa statefips rural
 21.         duplicates drop zipcode, force
 22.         save "../temp/all_zipcodes.dta", replace
 23.     restore 
 24.     
.     preserve
 25.         keep if rural == 0
 26.         keep zipcode countyfips cbsa statefips rural
 27.         duplicates drop zipcode, force
 28.         save "../temp/all_urban_zipcodes.dta", replace
 29.     restore 
 30.     
.     preserve
 31.         keep if !missing(medrentpricepsqft_SFCC)
 32.         keep zipcode countyfips cbsa statefips rural
 33.         duplicates drop zipcode, force
 34.         save "../temp/all_zillow_rents_zipcodes.dta", replace
 35.     restore 
 36. 
.     preserve
 37.         keep if baseline_sample == 1
 38.         keep zipcode  countyfips cbsa statefips rural
 39.         duplicates drop zipcode, force
 40.         save "../temp/baseline_zipcodes.dta", replace
 41.     restore 
 42. end

. 
. main
(228 missing values generated)
(228 missing values generated)
(data now sorted by zipcode)
  variable rural was float now byte
  variable population_acs2011 was double now long
  variable n_workers_acs2011 was double now long
  variable n_mw_wkrs_statutory was double now int
  variable n_mw_wkrs_state was double now int
  variable n_mw_wkrs_fed was double now int
  (920,866 bytes saved)
===============================================================================
File: ../temp/demo_clean.dta
Key: zipcode
===============================================================================
  31754:26(67627):1514580412:3260581383

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
populat~2010 |     31,754      9670.5    13755.56          0     115182
n_male_~2010 |     31,754    4754.675    6726.825          0      57965
n_white~2010 |     31,754    7005.537    9522.777          0      91407
n_black~2010 |     31,754    1214.418    3814.809          0      79984
-------------+---------------------------------------------------------
urb_pop~2010 |     31,526    .3902312     .436533          0          1
n_hhlds_ce~0 |     31,754    4123.342     5579.89          0      48073
n_hhlds_ur~0 |     31,754     3252.98    5558.294          0      48073
n_hhlds_re~0 |     31,754    1272.652    2373.331          0      33601
sh_rura~2010 |     31,526    .6097688     .436533          0          1
-------------+---------------------------------------------------------
populat~2011 |     31,138    9392.638    13416.43          0     114694
n_worke~2011 |     31,138    4273.722    6232.801          0      51551
n_mw_wkrs_~y |     31,138    704.6712     1056.28          0      11010
n_mw_wkrs_~e |     31,138    704.0669    1054.597          0      11010
n_mw_wkrs_~d |     31,138    679.9902    1007.934          0      10539
-------------+---------------------------------------------------------
med_hhl~2011 |     31,091    28653.62    24371.36          9   225461.9
sh_whit~2010 |     31,526    .8343495    .2033685          0          1
sh_blac~2010 |     31,526     .075431    .1552383          0          1
sh_male~2010 |     31,526    .5017685    .0423758          0          1
sh_hhlds_u~0 |     31,469    .3865303     .435426          0          1
-------------+---------------------------------------------------------
sh_hhlds_r~0 |     31,469    .2239473    .1448237          0          1
sh_mw_wkrs~y |     30,893    .1779022    .0619203          0          1
sh_mw_wkrs~e |     30,893    .1778632    .0619268          0          1
sh_mw_wkrs~d |     30,893    .1732508    .0608261          0          1
sh_urba~2010 |     31,526    .3902312     .436533          0          1
-------------+---------------------------------------------------------
       rural |     31,526    .5614096    .4962224          0          1




(note: file ../temp/demo_clean.dta not found)
file ../temp/demo_clean.dta saved
(561 observations deleted)
(279,503 observations deleted)
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../temp/irs_2010_clean.dta
Key: zipcode
===============================================================================
  27786:9(21818):3234447388:1567084687

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
   statefips |          0
agi_per_hhld |     27,786    53228.92    38257.82   5001.689    2368675
wage_per_w~d |     27,786    44242.83     22759.7   9360.238   554989.5
wage_per_h~d |     27,786     36237.6     17402.5   2959.625   351137.3
-------------+---------------------------------------------------------
bussines_r~r |     27,211    10923.95    8321.206  -42985.53   515220.8
share_wage~s |     27,786    .8224208    .0596334   .0782161          1
share_buss~s |     27,786    .1594272    .0500167          0   .6312504
share_farm~s |     27,786     .049988    .0772806          0   .6884065




(note: file ../temp/irs_2010_clean.dta not found)
file ../temp/irs_2010_clean.dta saved
(data now sorted by zipcode countyfips cbsa year)
  (0 bytes saved)
===============================================================================
File: ../temp/safmr_clean.dta
Key: zipcode countyfips cbsa year
===============================================================================
  121696:7(80564):1001697157:2638936076

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
        cbsa |          0
        year |    121,696    2014.043    1.431673       2012       2016
    safmr1br |    121,696    749.0634     270.163        310       2370
-------------+---------------------------------------------------------
    safmr2br |    121,696    926.0885    322.9981        370       2960
    safmr3br |    121,696    1237.018    434.3868        510       4090




(note: file ../temp/safmr_clean.dta not found)
file ../temp/safmr_clean.dta saved
(98,005 observations deleted)
(data now sorted by zipcode countyfips cbsa)
  (0 bytes saved)
===============================================================================
File: ../temp/safmr_2012_clean.dta
Key: zipcode countyfips cbsa
===============================================================================
  23691:6(81559):3722580878:3198509310

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  countyfips |          0
        cbsa |          0
    safmr1br |     23,691    725.2433    276.3298        370       2060
    safmr2br |     23,691    868.6003    317.7878        430       2340
-------------+---------------------------------------------------------
    safmr3br |     23,691    1138.101    416.9569        540       3340




(note: file ../temp/safmr_2012_clean.dta not found)
file ../temp/safmr_2012_clean.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         4,032,758  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                     3,834,997
        from master                 3,834,997  
        from using                          0  

    matched                           197,761  
    -----------------------------------------
(4,001,004 observations deleted)
(note: file ../temp/rents_jan2015.dta not found)
file ../temp/rents_jan2015.dta saved
(4,001,004 observations deleted)
(note: file ../temp/statutory_mw_feb2010.dta not found)
file ../temp/statutory_mw_feb2010.dta saved
(4,001,004 observations deleted)
(note: file ../temp/statutory_mw_dec2019.dta not found)
file ../temp/statutory_mw_dec2019.dta saved

Duplicates in terms of zipcode

(4,001,004 observations deleted)
(note: file ../temp/all_zipcodes.dta not found)
file ../temp/all_zipcodes.dta saved
(2,276,729 observations deleted)

Duplicates in terms of zipcode

(1,742,202 observations deleted)
(note: file ../temp/all_urban_zipcodes.dta not found)
file ../temp/all_urban_zipcodes.dta saved
(3,834,997 observations deleted)

Duplicates in terms of zipcode

(194,451 observations deleted)
(note: file ../temp/all_zillow_rents_zipcodes.dta not found)
file ../temp/all_zillow_rents_zipcodes.dta saved
(3,899,236 observations deleted)

Duplicates in terms of zipcode

(132,178 observations deleted)
(note: file ../temp/baseline_zipcodes.dta not found)
file ../temp/baseline_zipcodes.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,754  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,754  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,754  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,754  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,060
        from master                     4,060  
        from using                          0  

    matched                            27,694  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        16,084
        from master                    16,084  
        from using                          0  

    matched                            15,670  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/all_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  31754:42(39657):2370162809:1999371649

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
       rural |     31,526    .5614096    .4962224          0          1
populat~2010 |     31,754      9670.5    13755.56          0     115182
n_male_~2010 |     31,754    4754.675    6726.825          0      57965
n_white~2010 |     31,754    7005.537    9522.777          0      91407
-------------+---------------------------------------------------------
n_black~2010 |     31,754    1214.418    3814.809          0      79984
urb_pop~2010 |     31,526    .3902312     .436533          0          1
n_hhlds_ce~0 |     31,754    4123.342     5579.89          0      48073
n_hhlds_ur~0 |     31,754     3252.98    5558.294          0      48073
n_hhlds_re~0 |     31,754    1272.652    2373.331          0      33601
-------------+---------------------------------------------------------
sh_rura~2010 |     31,526    .6097688     .436533          0          1
populat~2011 |     31,138    9392.638    13416.43          0     114694
n_worke~2011 |     31,138    4273.722    6232.801          0      51551
n_mw_wkrs_~y |     31,138    704.6712     1056.28          0      11010
n_mw_wkrs_~e |     31,138    704.0669    1054.597          0      11010
-------------+---------------------------------------------------------
n_mw_wkrs_~d |     31,138    679.9902    1007.934          0      10539
med_hhl~2011 |     31,091    28653.62    24371.36          9   225461.9
sh_whit~2010 |     31,526    .8343495    .2033685          0          1
sh_blac~2010 |     31,526     .075431    .1552383          0          1
sh_male~2010 |     31,526    .5017685    .0423758          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |     31,469    .3865303     .435426          0          1
sh_hhlds_r~0 |     31,469    .2239473    .1448237          0          1
sh_mw_wkrs~y |     30,893    .1779022    .0619203          0          1
sh_mw_wkrs~e |     30,893    .1778632    .0619268          0          1
sh_mw_wkrs~d |     30,893    .1732508    .0608261          0          1
-------------+---------------------------------------------------------
sh_urba~2010 |     31,526    .3902312     .436533          0          1
statuto~2010 |     31,522    7.408399    .3342863       7.25   10.09876
statuto~2019 |     31,522    8.836299    1.889198       7.25         16
medren~e_2BR |        483    1911.865    972.2886        495       6595
medre~e_SFCC |      1,252    1607.183    701.3227        630       6000
-------------+---------------------------------------------------------
medren~t_2BR |        367     1.76387    .8671197   .5687694   5.653199
medre~t_SFCC |      1,344    1.223931    1.039072   .4660688   18.86792
agi_per_hhld |     27,694    53214.37    38282.59   5001.689    2368675
wage_per_w~d |     27,694    44223.93    22749.81   9360.238   554989.5
wage_per_h~d |     27,694    36220.87    17396.26   2959.625   351137.3
-------------+---------------------------------------------------------
bussines_r~r |     27,133    10914.14     8318.59  -42985.53   515220.8
share_wage~s |     27,694    .8223847    .0595641   .0782161          1
share_buss~s |     27,694    .1595173    .0499125          0   .6312504
share_farm~s |     27,694    .0501336    .0773508          0   .6884065
    safmr1br |     15,670    741.8851    282.3598        370       2060
-------------+---------------------------------------------------------
    safmr2br |     15,670    886.9285    319.6298        490       2340
    safmr3br |     15,670    1160.961     416.752        620       3240




(note: file ../output/all_zipcode_lvl_data.dta not found)
file ../output/all_zipcode_lvl_data.dta saved
(note: file ../output/all_zipcode_lvl_data.csv not found)
file ../output/all_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            13,827  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            13,827  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            13,827  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            13,827  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           832
        from master                       832  
        from using                          0  

    matched                            12,995  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,368
        from master                     3,368  
        from using                          0  

    matched                            10,459  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/all_urban_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  13827:42(39657):2485538850:3265460601

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
       rural |     13,827           0           0          0          0
populat~2010 |     13,827    19496.95    15908.82          1     115182
n_male_~2010 |     13,827    9554.913    7776.647          0      57965
n_white~2010 |     13,827     13730.1    10976.08          0      91407
-------------+---------------------------------------------------------
n_black~2010 |     13,827     2601.98    5441.607          0      79984
urb_pop~2010 |     13,827    .8612778    .1779174   .4004796          1
n_hhlds_ce~0 |     13,827    8153.375    6364.078          0      48073
n_hhlds_ur~0 |     13,827    7375.474    6379.882          0      48073
n_hhlds_re~0 |     13,827    2703.665    3037.091          0      33601
-------------+---------------------------------------------------------
sh_rura~2010 |     13,827    .1387222    .1779174          0   .5995204
populat~2011 |     13,387     19071.6     15621.4          0     114694
n_worke~2011 |     13,387    8757.444    7298.335          0      51551
n_mw_wkrs_~y |     13,387      1432.5    1269.488          0      11010
n_mw_wkrs_~e |     13,387    1431.094    1267.036          0      11010
-------------+---------------------------------------------------------
n_mw_wkrs_~d |     13,387    1378.555    1205.714          0      10539
med_hhl~2011 |     13,423    45716.12    24761.19         13   225461.9
sh_whit~2010 |     13,827    .7598432    .2157186          0          1
sh_blac~2010 |     13,827    .1143385    .1806135          0          1
sh_male~2010 |     13,827    .4944472    .0464476          0          1
-------------+---------------------------------------------------------
sh_hhlds_u~0 |     13,736     .856885    .1840697          0          1
sh_hhlds_r~0 |     13,736    .3062719    .1689146          0          1
sh_mw_wkrs~y |     13,301    .1726094    .0769056          0          1
sh_mw_wkrs~e |     13,301    .1725191    .0769115          0          1
sh_mw_wkrs~d |     13,301    .1671742    .0760625          0          1
-------------+---------------------------------------------------------
sh_urba~2010 |     13,827    .8612778    .1779174   .4004796          1
statuto~2010 |     13,736    7.452247     .374556       7.25   10.09876
statuto~2019 |     13,736     9.23355    2.154212       7.25         16
medren~e_2BR |        478    1901.129    971.2476        495       6595
medre~e_SFCC |      1,247    1603.427    700.1269        630       6000
-------------+---------------------------------------------------------
medren~t_2BR |        361    1.744886    .8604088   .5687694   5.653199
medre~t_SFCC |      1,334    1.200726    .9150784   .4660688   16.86275
agi_per_hhld |     12,995     61235.1    50020.18   5001.689    2368675
wage_per_w~d |     12,995    50953.89    29064.09   9360.238   554989.5
wage_per_h~d |     12,995    42005.05    21849.66   2959.625   351137.3
-------------+---------------------------------------------------------
bussines_r~r |     12,942    12942.44    8839.783  -41635.98   158995.4
share_wage~s |     12,995    .8335017    .0583889   .0782161          1
share_buss~s |     12,995    .1518721     .042665          0   .4844075
share_farm~s |     12,995    .0107024    .0210268          0   .2266495
    safmr1br |     10,459    804.6209    299.3048        400       2060
-------------+---------------------------------------------------------
    safmr2br |     10,459    957.0953    337.8599        500       2340
    safmr3br |     10,459    1250.597    439.6015        620       3240




(note: file ../output/all_urban_zipcode_lvl_data.dta not found)
file ../output/all_urban_zipcode_lvl_data.dta saved
(note: file ../output/all_urban_zipcode_lvl_data.csv not found)
file ../output/all_urban_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,310  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,310  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,310  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,310  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             9
        from master                         9  
        from using                          0  

    matched                             3,301  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           360
        from master                       360  
        from using                          0  

    matched                             2,950  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/all_zillow_rents_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  3310:42(39657):132364552:2767068078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
       rural |      3,292    .0036452    .0602745          0          1
populat~2010 |      3,310    33718.08    14944.07          0     110682
n_male_~2010 |      3,310    16471.24     7339.68          0      53020
n_white~2010 |      3,310    22213.26    11127.86          0      91407
-------------+---------------------------------------------------------
n_black~2010 |      3,310     5239.75    7516.589          0      71202
urb_pop~2010 |      3,292    .9601525    .0945418          0          1
n_hhlds_ce~0 |      3,310    14311.31    5636.853          0      48073
n_hhlds_ur~0 |      3,310    13831.41    5718.943          0      48073
n_hhlds_re~0 |      3,310    5023.259    3323.043          0      33601
-------------+---------------------------------------------------------
sh_rura~2010 |      3,292    .0398475    .0945418          0          1
populat~2011 |      3,128    33557.73    14605.61        422     114694
n_worke~2011 |      3,128    15879.74    7019.689        194      51551
n_mw_wkrs_~y |      3,128    2407.692    1287.218         21      10539
n_mw_wkrs_~e |      3,128    2403.249    1281.614         21      10539
-------------+---------------------------------------------------------
n_mw_wkrs_~d |      3,128    2313.731    1221.318         21      10539
med_hhl~2011 |      3,183    57139.51    22953.06   8853.411   189868.7
sh_whit~2010 |      3,292    .6788444      .20897   .0048626   .9844657
sh_blac~2010 |      3,292    .1536313    .1970667   .0023229   .9808114
sh_male~2010 |      3,292    .4888554    .0216653   .3554951   .8231398
-------------+---------------------------------------------------------
sh_hhlds_u~0 |      3,292    .9593202    .0968089          0          1
sh_hhlds_r~0 |      3,292    .3402092    .1478522    .032175   .8815922
sh_mw_wkrs~y |      3,128    .1523698    .0499114   .0114365   .5270913
sh_mw_wkrs~e |      3,128    .1521693    .0499125   .0114365   .5270913
sh_mw_wkrs~d |      3,128    .1471322    .0494757   .0114365   .5270913
-------------+---------------------------------------------------------
sh_urba~2010 |      3,292    .9601525    .0945418          0          1
statuto~2010 |      3,310    7.476669    .4056482       7.25   10.09876
statuto~2019 |      3,310    9.382927    2.325033       7.25         16
medren~e_2BR |        382    1891.505    1015.329        495       6595
medre~e_SFCC |      1,183    1592.462    695.2231        630       6000
-------------+---------------------------------------------------------
medren~t_2BR |        340     1.77738    .8899121   .5687694   5.653199
medre~t_SFCC |      1,344    1.223931    1.039072   .4660688   18.86792
agi_per_hhld |      3,301    70261.31    55892.87   18965.92   736585.5
wage_per_w~d |      3,301    57778.63    34444.11    17918.5   373157.3
wage_per_h~d |      3,301     47472.1    25882.66   8523.639   302129.2
-------------+---------------------------------------------------------
bussines_r~r |      3,301    13946.96    9643.289  -9688.676   130250.2
share_wage~s |      3,301    .8329366    .0657344   .2685518    .951295
share_buss~s |      3,301    .1660301    .0418533   .0519342   .3421915
share_farm~s |      3,301    .0029184    .0054439          0   .0980049
    safmr1br |      2,950    878.3458    291.3171        420       1980
-------------+---------------------------------------------------------
    safmr2br |      2,950    1039.424    334.9186        520       2340
    safmr3br |      2,950    1383.431    446.5755        690       3170




(note: file ../output/all_zillow_rents_zipcode_lvl_data.dta not found)
file ../output/all_zillow_rents_zipcode_lvl_data.dta saved
(note: file ../output/all_zillow_rents_zipcode_lvl_data.csv not found)
file ../output/all_zillow_rents_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,344  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,344  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,344  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,344  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         2  
        from using                          0  

    matched                             1,342  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                           130
        from master                       130  
        from using                          0  

    matched                             1,214  
    -----------------------------------------
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/baseline_zipcode_lvl_data.dta
Key: zipcode
===============================================================================
  1344:42(39657):2796392791:3804549395

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
       rural |      1,335    .0007491     .027369          0          1
populat~2010 |      1,344     38063.9    15415.56          0     110682
n_male_~2010 |      1,344    18550.41    7531.242          0      53020
n_white~2010 |      1,344     24642.3     11501.1          0      91407
-------------+---------------------------------------------------------
n_black~2010 |      1,344    6469.042    8932.893          0      71202
urb_pop~2010 |      1,335    .9717081    .0704201          0          1
n_hhlds_ce~0 |      1,344    16083.09    5904.859          0      48073
n_hhlds_ur~0 |      1,344    15696.13    6000.035          0      48073
n_hhlds_re~0 |      1,344    5495.203    3578.125          0      33601
-------------+---------------------------------------------------------
sh_rura~2010 |      1,335    .0282919    .0704201          0          1
populat~2011 |      1,257    37881.05    14947.63        422     114694
n_worke~2011 |      1,257    18140.37    7200.625        194      51551
n_mw_wkrs_~y |      1,257    2551.159    1254.014         21       9787
n_mw_wkrs_~e |      1,257    2548.316    1249.597         21       9787
-------------+---------------------------------------------------------
n_mw_wkrs_~d |      1,257    2470.197    1201.769         21       9787
med_hhl~2011 |      1,285    59944.06    21698.07      16481   165594.9
sh_whit~2010 |      1,335    .6672483    .1980273   .0048626   .9642324
sh_blac~2010 |      1,335    .1613283    .1940474   .0040479   .9808114
sh_male~2010 |      1,335    .4880931    .0198676   .3554951    .616951
-------------+---------------------------------------------------------
sh_hhlds_u~0 |      1,335    .9708468    .0729661          0          1
sh_hhlds_r~0 |      1,335    .3327157     .143608    .032175   .8815922
sh_mw_wkrs~y |      1,257    .1402058     .042392   .0114365   .5270913
sh_mw_wkrs~e |      1,257    .1401041    .0424652   .0114365   .5270913
sh_mw_wkrs~d |      1,257    .1361097    .0421689   .0114365   .5270913
-------------+---------------------------------------------------------
sh_urba~2010 |      1,335    .9717081    .0704201          0          1
statuto~2010 |      1,344    7.426198     .352159       7.25       9.79
statuto~2019 |      1,344    9.213172    2.206157       7.25         16
medren~e_2BR |        301    1917.056    1038.217        495       6495
medre~e_SFCC |      1,097    1598.104    704.8117        630       6000
-------------+---------------------------------------------------------
medren~t_2BR |        280    1.807691     .947712   .5687694   5.653199
medre~t_SFCC |      1,344    1.223931    1.039072   .4660688   18.86792
agi_per_hhld |      1,342    71160.31    53369.81   21344.37   736585.5
wage_per_w~d |      1,342    59178.73    32031.52   19957.67   318527.1
wage_per_h~d |      1,342    49297.45    25177.15   10554.06   269083.4
-------------+---------------------------------------------------------
bussines_r~r |      1,342    13368.07    9270.236  -9688.676   93661.72
share_wage~s |      1,342    .8398669    .0623099   .3109279    .951295
share_buss~s |      1,342    .1700084    .0426276   .0619388   .3283778
share_farm~s |      1,342    .0021628    .0036791          0   .0385341
    safmr1br |      1,214    913.3278    275.0627        440       1940
-------------+---------------------------------------------------------
    safmr2br |      1,214    1076.656      318.17        560       2280
    safmr3br |      1,214      1438.6    421.5234        760       3090




(note: file ../output/baseline_zipcode_lvl_data.dta not found)
file ../output/baseline_zipcode_lvl_data.dta saved
(note: file ../output/baseline_zipcode_lvl_data.csv not found)
file ../output/baseline_zipcode_lvl_data.csv saved

    Result                           # of obs.
    -----------------------------------------
    not matched                        63,886
        from master                    63,886  
        from using                          0  

    matched                            69,636  
    -----------------------------------------
(data now sorted by zipcode year_month)
  (0 bytes saved)
===============================================================================
File: ../output/baseline_zillow_rents_zipcode_months.dta
Key: zipcode year_month
===============================================================================
  133522:28(27028):3870833356:313913255

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |    133,522    669.0793    29.80581        601        719
        year |    133,522     2015.29    2.479825       2010       2019
       month |    133,522     6.59686     3.44559          1         12
  countyfips |          0
-------------+---------------------------------------------------------
   statefips |          0
        cbsa |          0
statutory_mw |    133,522     8.19615    1.341485       7.25         16
      mw_res |    133,522    2.092405    .1440241   1.981001   2.772589
mw_wkp_to~17 |    133,522    2.083959    .1408211   1.637724   2.688884
-------------+---------------------------------------------------------
medren~e_2BR |     44,792    1806.915    912.0976        480       6910
medre~e_SFCC |    114,449    1658.432    822.5566        595      30000
medren~t_2BR |     43,692    1.703253    .8473216   .5015198   6.506977
medre~t_SFCC |    133,522    1.232927    .9005345   .4180214       22.2
    ln_rents |    133,522    .0760635    .4611576  -.8722227   3.100092
-------------+---------------------------------------------------------
ln_emp_biz~v |    133,522     11.1503    1.359969   5.796058   13.38876
 ln_emp_info |    132,831    9.005645    1.530302   2.397895   12.38988
  ln_emp_fin |    133,498    10.20277    1.416537    4.75359   12.89542
ln_estcoun~v |    133,522    8.688767    1.240798   4.127134   10.96353
ln_estcoun~o |    133,522     6.10635    1.329935   1.386294   9.531191
-------------+---------------------------------------------------------
ln_estcoun~n |    133,522    7.985308    1.197047   3.496508   10.33748
ln_avgwwag~v |    133,522    7.092098    .3078404   5.420535   8.432724
ln_avgwwag~o |    132,831    7.274355    .3441477   5.891644   8.906665
ln_avgwwag~n |    133,498    7.248457    .3673195   6.216606   9.163982
baseline_s~e |    133,522           1           0          1          1
-------------+---------------------------------------------------------
    safmr1br |     69,636    937.3866    273.7528        440       2370
    safmr2br |     69,636      1148.6    334.3396        560       2960
    safmr3br |     69,636    1561.953    453.0192        760       4090




(note: file ../output/baseline_zillow_rents_zipcode_months.dta not found)
file ../output/baseline_zillow_rents_zipcode_months.dta saved
(note: file ../output/baseline_zillow_rents_zipcode_months.csv not found)
file ../output/baseline_zillow_rents_zipcode_months.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./build_summary_tables.R" build_summary_tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> library(dplyr)

Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

> source("../../../lib/R/save_data.R")

Please cite as: 

 Hlavac, Marek (2018). stargazer: Well-Formatted Regression and Summary Statistics Tables.
 R package version 5.2.2. https://CRAN.R-project.org/package=stargazer 


Attaching package: 'data.table'

The following objects are masked from 'package:dplyr':

    between, first, last

> 
> main <- function() {
+   
+   ## ZIP level stats
+   all_zipcodes      <- load_data("all_zipcode_lvl_data.csv")
+   urban_zipcodes    <- load_data("all_urban_zipcode_lvl_data.csv")
+   zillow_zipcodes   <- load_data("all_zillow_rents_zipcode_lvl_data.csv")
+   baseline_zipcodes <- load_data("baseline_zipcode_lvl_data.csv")
+ 
+   all_zipcodes_stats      <- build_basic_stats(all_zipcodes)
+   urban_zipcodes_stats    <- build_basic_stats(urban_zipcodes)
+   zillow_zipcodes_stats   <- build_basic_stats(zillow_zipcodes)
+   baseline_zipcodes_stats <- build_basic_stats(baseline_zipcodes)
+   
+   zip_lvl_stats <- t(rbind(all_zipcodes_stats, urban_zipcodes_stats, 
+                            zillow_zipcodes_stats, baseline_zipcodes_stats))
+   
+   txt <- c("<tab:stats_zip_samples>")
+   writeLines(txt, "../output/stats_zip_samples.txt")
+   write.table(zip_lvl_stats, "../output/stats_zip_samples.txt", 
+               append = TRUE, sep = "\t", dec = ".",
+               row.names = FALSE, col.names = FALSE)
+   
+   ## ZIP-month stats of baseline panel
+   baseline_panel <- load_data("baseline_zillow_rents_zipcode_months.csv")
+   
+   vars_for_table <- c("statutory_mw", "mw_res", "mw_wkp_tot_17",
+                       "medrentprice_SFCC", "medrentpricepsqft_SFCC", "ln_rents", 
+                       "medrentprice_2BR", "medrentpricepsqft_2BR",
+                       "ln_emp_bizserv", "ln_estcount_bizserv", "ln_avgwwage_bizserv", 
+                       "ln_emp_info", "ln_estcount_info", "ln_avgwwage_info", 
+                       "ln_emp_fin", "ln_estcount_fin", "ln_avgwwage_fin")
+ 
+   txt <- c("<tab:stats_est_panel>")
+   writeLines(txt, "../output/stats_est_panel.txt")
+   for (var in vars_for_table) {
+    var_row <- build_panel_stats_row(baseline_panel, var)
+    write.table(var_row, "../output/stats_est_panel.txt", 
+                append = TRUE, sep = "\t", dec = ".",
+                row.names = FALSE, col.names = FALSE)
+   }
+ }
> 
> load_data <- function(filename, instub = "../output") {
+   return(data.table::fread(file.path(instub, filename),
+                            colClasses = c(zipcode = "character")))
+ }
> 
> build_basic_stats <- function(df) {
+   stats <- df %>%
+     summarise(population_cens2010           = mean(population_cens2010, na.rm = T),
+               n_hhlds_cens2010              = mean(n_hhlds_cens2010, na.rm = T),
+               sh_urban_pop_2010             = mean(sh_urban_pop_2010, na.rm = T),
+               sh_hhlds_renteroccup_cens2010 = mean(sh_hhlds_renteroccup_cens2010, na.rm = T),
+               sh_black_cens2010             = mean(sh_black_cens2010, na.rm = T),
+               sh_white_cens2010             = mean(sh_white_cens2010, na.rm = T),
+               sh_male_cens2010              = mean(sh_male_cens2010, na.rm = T),
+               share_wage_hhlds_irs2010      = mean(share_wage_hhlds, na.rm = T),
+               share_bussiness_hhlds_irs2010 = mean(share_bussiness_hhlds, na.rm = T),
+               agi_per_hhld_irs_2010         = mean(agi_per_hhld, na.rm = T),
+               wage_per_hhld_irs2010         = mean(wage_per_hhld, na.rm = T),
+               rent40thperc_2br_safmr2012    = mean(safmr2br, na.rm = T),
+               min_binding_mw_feb2010        = min(statutory_mw_feb2010, na.rm = T),
+               avg_binding_mw_feb2010        = mean(statutory_mw_feb2010, na.rm = T),
+               max_binding_mw_feb2010        = max(statutory_mw_feb2010, na.rm = T),
+               min_binding_mw_dec2019        = min(statutory_mw_dec2019, na.rm = T),
+               avg_binding_mw_dec2019        = mean(statutory_mw_dec2019, na.rm = T),
+               max_binding_mw_dec2019        = max(statutory_mw_dec2019, na.rm = T),
+               zip_count                     = n_distinct(zipcode))
+   return(stats)
+ }
> 
> build_panel_stats_row <-  function(panel, var){
+   panel %>% 
+     summarise(across(.cols = var,
+                     .fns=list(n    =  ~ sum(!is.na(.x)), 
+                               mean = ~ mean(.x, na.rm = T), 
+                               sd   = ~ sd(.x, na.rm = T), 
+                               min  = ~ min(.x, na.rm = T), 
+                               max  = ~ max(.x, na.rm = T))))
+ }
> 
> 
> main()
Note: Using an external vector in selections is ambiguous.
i Use `all_of(var)` instead of `var` to silence this message.
i See <https://tidyselect.r-lib.org/reference/faq-external-vector.html>.
This message is displayed once per session.
> 
> proc.time()
   user  system elapsed 
   1.81    0.54    2.26 

 make.py ended: 2022-03-14 11:55:00
