
 make.py started: 2021-05-10 07:13:37 C:\Users\shermo\Documents\GitHub\min_wage_rent\base\bps\code 




Execute:  StataMP-64 /e do "./make_bps_cty_month.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./make_bps_cty_month.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000 


. 
. 
. program main 
  1.     local instub "../../../drive/raw_data/bps"
  2.     local outsub "../output"
  3. 
.     forval y = 10/19 {
  4.         foreach m in 01 02 03 04 05 06 07 08 09 10 11 12 {
  5.             import delim `instub'/co`y'`m'y.txt, ///
>                             clear rowr(4:) varnames(2) stringcols(1 2 3 4 5 6
> )
  6.             set_colnames
  7.             save ../temp/co`y'`m'.dta, replace 
  8.         }
  9.     }
 10.     clear
 11.     forval y = 10/19 {
 12.         foreach m in 01 02 03 04 05 06 07 08 09 10 11 12 {
 13.             append using ../temp/co`y'`m'.dta
 14.         }
 15.     }
 16. 
.     format_clean_vars
 17. 
.     save_data `outsub'/bps_sf_cty_mon.dta, ///
>             replace key(countyfips year month)
 18. end 

. 
. program set_colnames 
  1.     rename (date    state      county  code        v5            name) ///
>            (strdate statefips  cfips   region_code division_code countyname)
  2.     
.     rename (bldgs    units    value    v10      v11      v12      ///
>             v13      v14      v15      v16      v17      v18) ///
>         (u1_bldgs u1_units u1_value u2_bldgs u2_units u2_value ///
>                 u3_bldgs u3_units u3_value u5_bldgs u5_units u5_value)
  3. 
.     rename (v19 v20 v21 v22 v23 v24 ///
>             v25 v26 v27 v28 v29 v30) ///
>         (u1rep_bldgs u1rep_units u1rep_value u2rep_bldgs u2rep_units u2rep_va
> lue ///
>                 u3rep_bldgs u3rep_units u3rep_value u5rep_bldgs u5rep_units u
> 5rep_value)
  4. end 

. 
. program format_clean_vars 
  1.     drop region_code division_code countyname
  2. 
.     g year = substr(strdate, 1, 4)
  3.     g month  = substr(strdate, 5, 6)
  4.     destring year month, replace
  5.     g year_month = ym(year, month)
  6.     format year_month %tm
  7.     order year_month, first
  8.     drop strdate
  9. 
.     g countyfips = statefips + cfips
 10.     order countyfips, before(cfips)
 11.     drop cfips
 12. 
.     duplicates drop countyfips year_month, force
 13.     
.         destring countyfips, gen(cfips)
 14.     xtset cfips year_month
 15. 
.     g invmon = - month
 16.     unab cumvar_list: u* 
 17.     foreach var in `cumvar_list' {
 18.         bys countyfips year (invmon): replace `var' = `var' - `var'[_n+1] 
> if _n<12
 19.     }
 20. 
.     gsort countyfips year_month
 21.     drop year_month invmon cfips
 22. 
.     unab final_varlist: u1*
 23.     keep year month statefips countyfips `final_varlist'
 24. end 

. 
. 
. *EXECUTE
. main 
(30 vars, 815 obs)
(note: file ../temp/co1001.dta not found)
file ../temp/co1001.dta saved
(30 vars, 815 obs)
(note: file ../temp/co1002.dta not found)
file ../temp/co1002.dta saved
(30 vars, 816 obs)
(note: file ../temp/co1003.dta not found)
file ../temp/co1003.dta saved
(30 vars, 816 obs)
(note: file ../temp/co1004.dta not found)
file ../temp/co1004.dta saved
(30 vars, 816 obs)
(note: file ../temp/co1005.dta not found)
file ../temp/co1005.dta saved
(30 vars, 816 obs)
(note: file ../temp/co1006.dta not found)
file ../temp/co1006.dta saved
(30 vars, 816 obs)
(note: file ../temp/co1007.dta not found)
file ../temp/co1007.dta saved
(30 vars, 816 obs)
(note: file ../temp/co1008.dta not found)
file ../temp/co1008.dta saved
(30 vars, 816 obs)
(note: file ../temp/co1009.dta not found)
file ../temp/co1009.dta saved
(30 vars, 816 obs)
(note: file ../temp/co1010.dta not found)
file ../temp/co1010.dta saved
(30 vars, 818 obs)
(note: file ../temp/co1011.dta not found)
file ../temp/co1011.dta saved
(30 vars, 819 obs)
(note: file ../temp/co1012.dta not found)
file ../temp/co1012.dta saved
(30 vars, 820 obs)
(note: file ../temp/co1101.dta not found)
file ../temp/co1101.dta saved
(30 vars, 820 obs)
(note: file ../temp/co1102.dta not found)
file ../temp/co1102.dta saved
(30 vars, 820 obs)
(note: file ../temp/co1103.dta not found)
file ../temp/co1103.dta saved
(30 vars, 820 obs)
(note: file ../temp/co1104.dta not found)
file ../temp/co1104.dta saved
(30 vars, 820 obs)
(note: file ../temp/co1105.dta not found)
file ../temp/co1105.dta saved
(30 vars, 820 obs)
(note: file ../temp/co1106.dta not found)
file ../temp/co1106.dta saved
(30 vars, 821 obs)
(note: file ../temp/co1107.dta not found)
file ../temp/co1107.dta saved
(30 vars, 822 obs)
(note: file ../temp/co1108.dta not found)
file ../temp/co1108.dta saved
(30 vars, 823 obs)
(note: file ../temp/co1109.dta not found)
file ../temp/co1109.dta saved
(30 vars, 823 obs)
(note: file ../temp/co1110.dta not found)
file ../temp/co1110.dta saved
(30 vars, 823 obs)
(note: file ../temp/co1111.dta not found)
file ../temp/co1111.dta saved
(30 vars, 823 obs)
(note: file ../temp/co1112.dta not found)
file ../temp/co1112.dta saved
(30 vars, 823 obs)
(note: file ../temp/co1201.dta not found)
file ../temp/co1201.dta saved
(30 vars, 824 obs)
(note: file ../temp/co1202.dta not found)
file ../temp/co1202.dta saved
(30 vars, 825 obs)
(note: file ../temp/co1203.dta not found)
file ../temp/co1203.dta saved
(30 vars, 825 obs)
(note: file ../temp/co1204.dta not found)
file ../temp/co1204.dta saved
(30 vars, 825 obs)
(note: file ../temp/co1205.dta not found)
file ../temp/co1205.dta saved
(30 vars, 825 obs)
(note: file ../temp/co1206.dta not found)
file ../temp/co1206.dta saved
(30 vars, 825 obs)
(note: file ../temp/co1207.dta not found)
file ../temp/co1207.dta saved
(30 vars, 825 obs)
(note: file ../temp/co1208.dta not found)
file ../temp/co1208.dta saved
(30 vars, 825 obs)
(note: file ../temp/co1209.dta not found)
file ../temp/co1209.dta saved
(30 vars, 826 obs)
(note: file ../temp/co1210.dta not found)
file ../temp/co1210.dta saved
(30 vars, 826 obs)
(note: file ../temp/co1211.dta not found)
file ../temp/co1211.dta saved
(30 vars, 827 obs)
(note: file ../temp/co1212.dta not found)
file ../temp/co1212.dta saved
(30 vars, 832 obs)
(note: file ../temp/co1301.dta not found)
file ../temp/co1301.dta saved
(30 vars, 832 obs)
(note: file ../temp/co1302.dta not found)
file ../temp/co1302.dta saved
(30 vars, 832 obs)
(note: file ../temp/co1303.dta not found)
file ../temp/co1303.dta saved
(30 vars, 833 obs)
(note: file ../temp/co1304.dta not found)
file ../temp/co1304.dta saved
(30 vars, 833 obs)
(note: file ../temp/co1305.dta not found)
file ../temp/co1305.dta saved
(30 vars, 833 obs)
(note: file ../temp/co1306.dta not found)
file ../temp/co1306.dta saved
(30 vars, 834 obs)
(note: file ../temp/co1307.dta not found)
file ../temp/co1307.dta saved
(30 vars, 839 obs)
(note: file ../temp/co1308.dta not found)
file ../temp/co1308.dta saved
(30 vars, 841 obs)
(note: file ../temp/co1309.dta not found)
file ../temp/co1309.dta saved
(30 vars, 841 obs)
(note: file ../temp/co1310.dta not found)
file ../temp/co1310.dta saved
(30 vars, 841 obs)
(note: file ../temp/co1311.dta not found)
file ../temp/co1311.dta saved
(30 vars, 838 obs)
(note: file ../temp/co1312.dta not found)
file ../temp/co1312.dta saved
(30 vars, 841 obs)
(note: file ../temp/co1401.dta not found)
file ../temp/co1401.dta saved
(30 vars, 842 obs)
(note: file ../temp/co1402.dta not found)
file ../temp/co1402.dta saved
(30 vars, 842 obs)
(note: file ../temp/co1403.dta not found)
file ../temp/co1403.dta saved
(30 vars, 842 obs)
(note: file ../temp/co1404.dta not found)
file ../temp/co1404.dta saved
(30 vars, 842 obs)
(note: file ../temp/co1405.dta not found)
file ../temp/co1405.dta saved
(30 vars, 843 obs)
(note: file ../temp/co1406.dta not found)
file ../temp/co1406.dta saved
(30 vars, 843 obs)
(note: file ../temp/co1407.dta not found)
file ../temp/co1407.dta saved
(30 vars, 817 obs)
(note: file ../temp/co1408.dta not found)
file ../temp/co1408.dta saved
(30 vars, 817 obs)
(note: file ../temp/co1409.dta not found)
file ../temp/co1409.dta saved
(30 vars, 817 obs)
(note: file ../temp/co1410.dta not found)
file ../temp/co1410.dta saved
(30 vars, 840 obs)
(note: file ../temp/co1411.dta not found)
file ../temp/co1411.dta saved
(30 vars, 829 obs)
(note: file ../temp/co1412.dta not found)
file ../temp/co1412.dta saved
(30 vars, 736 obs)
(note: file ../temp/co1501.dta not found)
file ../temp/co1501.dta saved
(30 vars, 739 obs)
(note: file ../temp/co1502.dta not found)
file ../temp/co1502.dta saved
(30 vars, 739 obs)
(note: file ../temp/co1503.dta not found)
file ../temp/co1503.dta saved
(30 vars, 739 obs)
(note: file ../temp/co1504.dta not found)
file ../temp/co1504.dta saved
(30 vars, 739 obs)
(note: file ../temp/co1505.dta not found)
file ../temp/co1505.dta saved
(30 vars, 740 obs)
(note: file ../temp/co1506.dta not found)
file ../temp/co1506.dta saved
(30 vars, 740 obs)
(note: file ../temp/co1507.dta not found)
file ../temp/co1507.dta saved
(30 vars, 740 obs)
(note: file ../temp/co1508.dta not found)
file ../temp/co1508.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1509.dta not found)
file ../temp/co1509.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1510.dta not found)
file ../temp/co1510.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1511.dta not found)
file ../temp/co1511.dta saved
(30 vars, 740 obs)
(note: file ../temp/co1512.dta not found)
file ../temp/co1512.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1601.dta not found)
file ../temp/co1601.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1602.dta not found)
file ../temp/co1602.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1603.dta not found)
file ../temp/co1603.dta saved
(30 vars, 735 obs)
(note: file ../temp/co1604.dta not found)
file ../temp/co1604.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1605.dta not found)
file ../temp/co1605.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1606.dta not found)
file ../temp/co1606.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1607.dta not found)
file ../temp/co1607.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1608.dta not found)
file ../temp/co1608.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1609.dta not found)
file ../temp/co1609.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1610.dta not found)
file ../temp/co1610.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1611.dta not found)
file ../temp/co1611.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1612.dta not found)
file ../temp/co1612.dta saved
(30 vars, 742 obs)
(note: file ../temp/co1701.dta not found)
file ../temp/co1701.dta saved
(30 vars, 740 obs)
(note: file ../temp/co1702.dta not found)
file ../temp/co1702.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1703.dta not found)
file ../temp/co1703.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1704.dta not found)
file ../temp/co1704.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1705.dta not found)
file ../temp/co1705.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1706.dta not found)
file ../temp/co1706.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1707.dta not found)
file ../temp/co1707.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1708.dta not found)
file ../temp/co1708.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1709.dta not found)
file ../temp/co1709.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1710.dta not found)
file ../temp/co1710.dta saved
(30 vars, 740 obs)
(note: file ../temp/co1711.dta not found)
file ../temp/co1711.dta saved
(30 vars, 741 obs)
(note: file ../temp/co1712.dta not found)
file ../temp/co1712.dta saved
(30 vars, 742 obs)
(note: file ../temp/co1801.dta not found)
file ../temp/co1801.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1802.dta not found)
file ../temp/co1802.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1803.dta not found)
file ../temp/co1803.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1804.dta not found)
file ../temp/co1804.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1805.dta not found)
file ../temp/co1805.dta saved
(30 vars, 746 obs)
(note: file ../temp/co1806.dta not found)
file ../temp/co1806.dta saved
(30 vars, 743 obs)
(note: file ../temp/co1807.dta not found)
file ../temp/co1807.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1808.dta not found)
file ../temp/co1808.dta saved
(30 vars, 743 obs)
(note: file ../temp/co1809.dta not found)
file ../temp/co1809.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1810.dta not found)
file ../temp/co1810.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1811.dta not found)
file ../temp/co1811.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1812.dta not found)
file ../temp/co1812.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1901.dta not found)
file ../temp/co1901.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1902.dta not found)
file ../temp/co1902.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1903.dta not found)
file ../temp/co1903.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1904.dta not found)
file ../temp/co1904.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1905.dta not found)
file ../temp/co1905.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1906.dta not found)
file ../temp/co1906.dta saved
(30 vars, 743 obs)
(note: file ../temp/co1907.dta not found)
file ../temp/co1907.dta saved
(30 vars, 743 obs)
(note: file ../temp/co1908.dta not found)
file ../temp/co1908.dta saved
(30 vars, 743 obs)
(note: file ../temp/co1909.dta not found)
file ../temp/co1909.dta saved
(30 vars, 743 obs)
(note: file ../temp/co1910.dta not found)
file ../temp/co1910.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1911.dta not found)
file ../temp/co1911.dta saved
(30 vars, 744 obs)
(note: file ../temp/co1912.dta not found)
file ../temp/co1912.dta saved
(note: variable u2_units was byte, now int to accommodate using data's
       values)
(note: variable u2rep_units was byte, now int to accommodate using data's
       values)
(note: variable u3_units was byte, now int to accommodate using data's
       values)
(note: variable u3rep_units was byte, now int to accommodate using data's
       values)
(note: variable u2_bldgs was byte, now int to accommodate using data's
       values)
(note: variable u2rep_bldgs was byte, now int to accommodate using data's
       values)
(note: variable u5_bldgs was byte, now int to accommodate using data's
       values)
(note: variable u5rep_bldgs was byte, now int to accommodate using data's
       values)
(note: variable u1_value was long, now double to accommodate using data's
       values)
(note: variable u1rep_value was long, now double to accommodate using data's
       values)
(note: variable u3_bldgs was byte, now int to accommodate using data's
       values)
(note: variable u3rep_bldgs was byte, now int to accommodate using data's
       values)
(note: variable u5_value was long, now double to accommodate using data's
       values)
(note: variable u5rep_value was long, now double to accommodate using data's
       values)
year: all characters numeric; replaced as int
month: all characters numeric; replaced as byte

Duplicates in terms of countyfips year_month

(251 observations deleted)
countyfips: all characters numeric; cfips generated as long
       panel variable:  cfips (unbalanced)
        time variable:  year_month, 2010m1 to 2019m12, but with gaps
                delta:  1 month
(79,928 real changes made, 103 to missing)
(79,928 real changes made, 103 to missing)
(79942 real changes made, 103 to missing)
(25,754 real changes made, 103 to missing)
(25,754 real changes made, 103 to missing)
(25,775 real changes made, 103 to missing)
(18,455 real changes made, 103 to missing)
(18,455 real changes made, 103 to missing)
(18,431 real changes made, 103 to missing)
(30,841 real changes made, 103 to missing)
(30,841 real changes made, 103 to missing)
(30856 real changes made, 103 to missing)
(73,485 real changes made, 103 to missing)
(73,485 real changes made, 103 to missing)
(73505 real changes made, 103 to missing)
(22,488 real changes made, 103 to missing)
(22,488 real changes made, 103 to missing)
(22,511 real changes made, 103 to missing)
(15,937 real changes made, 103 to missing)
(15,937 real changes made, 103 to missing)
(15,973 real changes made, 103 to missing)
(25,081 real changes made, 103 to missing)
(25,081 real changes made, 103 to missing)
(25132 real changes made, 103 to missing)
(data now sorted by countyfips year month)
  variable u1_value was double now long
  variable u1rep_value was double now long
  (750,768 bytes saved)
===============================================================================
File: ../output/bps_sf_cty_mon.dta
Key: countyfips year month
===============================================================================
  93846:10(90952):2342548701:2627857919

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  countyfips |          0
        year |     93,846    2014.372    2.868098       2010       2019
       month |     93,846    6.500266    3.451957          1         12
   statefips |          0
    u1_bldgs |     93,743    46.08891    105.5821      -1622       2687
-------------+---------------------------------------------------------
    u1_units |     93,743    46.08891    105.5821      -1622       2687
    u1_value |     93,743    1.10e+07    2.62e+07  -1.94e+08   6.43e+08
 u1rep_bldgs |     93,743    41.99292    104.1207       -478       3758
 u1rep_units |     93,743    41.99292    104.1207       -478       3758
 u1rep_value |     93,743    1.02e+07    2.60e+07  -2.01e+08   8.74e+08




(note: file ../output/bps_sf_cty_mon.dta not found)
file ../output/bps_sf_cty_mon.dta saved

. 
end of do-file

 make.py ended: 2021-05-10 07:14:00
