
 make.py started: 2021-10-27 15:11:13 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\twfe_wages_predictions\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. 
. program main
  1.     local instub "../../../drive/derived_large/"
  2. 
.     use "`instub'/zipcode_year/zipcode_year.dta", clear
  3.     xtset zipcode_num year
  4. 
.     add_baseline_zipcodes, instub(`instub')
  5.         
.     define_controls
  6.     local controls "`r(economic_controls)'"
  7.     local cluster "statefips"
  8.         local absorb "zipcode year#cbsa10_num"
  9. 
.         reghdfe ln_wagebill ln_mw_avg exp_ln_mw_tot_17_avg `controls' if base
> line_sample, ///
>         absorb(`absorb', savefe) vce(cluster `cluster') nocons residuals(resi
> duals)
 10.         predict p_ln_wagebill if baseline_sample, xbd
 11.         
.         keep zipcode year ln_wagebill p_ln_wagebill residuals
 12.         save_data "../output/twfe_wages_predictions.dta", ///
>             key(zipcode year) replace
 13. end

. 
. program add_baseline_zipcodes
  1.     syntax, instub(str)
  2. 
.     preserve
  3.         use `instub'/estimation_samples/baseline_zipcode_months.dta
  4. 
.         keep if !missing(ln_rents)
  5. 
.         keep zipcode year
  6.         bys  zipcode year: keep if _n == 1
  7. 
.         gen baseline_sample = 1
  8. 
.         tempfile zipcode_years_baseline
  9.         save    `zipcode_years_baseline'
 10.     restore
 11. 
.     merge 1:1 zipcode year using `zipcode_years_baseline', assert(1 3) keep(1
>  3) nogen
 12. 
.     replace baseline_sample = 0 if baseline_sample != 1
 13. end

. 
. 
. main
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year, 2010 to 2019
                delta:  1 unit
(27,800 observations deleted)
(122,026 observations deleted)
file C:\Users\diegog\AppData\Local\Temp\3\ST_41b8_000002.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                       393,306
        from master                   393,306  
        from using                          0  

    matched                            11,574  
    -----------------------------------------
(393,306 real changes made)
(dropped 315 singleton observations)
(MWFE estimator converged in 8 iterations)

HDFE Linear regression                            Number of obs   =      9,835
Absorbing 2 HDFE groups                           F(  11,     35) =      20.59
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.9925
                                                  Adj R-squared   =     0.9906
                                                  Within R-sq.    =     0.0340
Number of clusters (statefips) =         36       Root MSE        =     0.0553

                             (Std. Err. adjusted for 36 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
 ln_wagebill |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   ln_mw_avg |  -.0286795   .1801822    -0.16   0.874    -.3944688    .3371097
exp~t_17_avg |   .2214309   .2425872     0.91   0.368    -.2710473    .7139092
ln_emp_biz~g |   .0534927   .0262301     2.04   0.049     .0002426    .1067427
ln_emp_inf~g |  -.0162833   .0136958    -1.19   0.242    -.0440871    .0115206
ln_emp_fin~g |  -.0413007   .0316662    -1.30   0.201    -.1055866    .0229851
ln_es~rv_avg |   .1917379   .1012992     1.89   0.067    -.0139105    .3973863
ln_est~o_avg |   .0474125   .0212718     2.23   0.032     .0042284    .0905967
ln_est~n_avg |   .2248686   .0916832     2.45   0.019     .0387417    .4109954
ln_av~rv_avg |   .0315749   .0449587     0.70   0.487    -.0596961     .122846
ln_avg~o_avg |   .0046676   .0343036     0.14   0.893    -.0649725    .0743076
ln_avg~n_avg |   .0230256   .0560283     0.41   0.684    -.0907179    .1367692
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
           zipcode |      1301        1301           0    *|
   year#cbsa10_num |       692           0         692     |
-----------------------------------------------------------+
* = FE nested within cluster; treated as redundant for DoF computation
(395,045 missing values generated)
(data already sorted by zipcode year)
  (0 bytes saved)
===============================================================================
File: ../output/twfe_wages_predictions.dta
Key: zipcode year
===============================================================================
  404880:5(73459):2456302824:879052236

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
        year |    404,880      2014.5    2.872285       2010       2019
 ln_wagebill |    248,991    11.17142    1.694219   6.376727   15.67136
   residuals |      9,835    3.37e-15    .0493875  -.6059403   .6249587
p_ln_wageb~l |      9,835    13.68977     .568858   11.24237   15.71266




(note: file ../output/twfe_wages_predictions.dta not found)
file ../output/twfe_wages_predictions.dta saved

. 
end of do-file

 make.py ended: 2021-10-27 15:11:22
