
 make.py started: 2020-12-03 19:16:19 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\levels\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/output"
  2.         local outstub "../temp"
  3.         local logfile "../output/data_file_manifest.log"
  4. 
.         use "`instub'/baseline_rent_panel.dta", clear 
  5.         keep zipcode place_code msa countyfips statefips                  
>                                               ///
>                 year_month calendar_month trend trend_sq trend_cu            
>                                            ///
>                 dactual_mw actual_mw medrentpricepsqft_*
  6.                 
.         gen ln_med_rent_psqft_sfcc = log(medrentpricepsqft_sfcc)
  7.         gen ln_mw = log(actual_mw)
  8.         
.         simplify_varnames
  9. 
.         xtset zipcode year_month
 10. 
.         save_data "`outstub'/rent_panel.dta", key(zipcode year_month) replace
>  log(`logfile')
 11. end

. 
. program simplify_varnames
  1.         
.         cap rename ln_actual_mw                  ln_mw 
  2.         cap rename ln_medrentpricepsqft_sfcc     ln_med_rent_psqft_sfcc
  3.         cap rename ln_medrentpricepsqft_2br      ln_med_rent_psqft_2br
  4.         cap rename ln_medrentpricepsqft_mfr5plus ln_med_rent_psqft_mfr5plu
> s
  5. end

. 
. main
(43,225 missing values generated)
       panel variable:  zipcode (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(data already sorted by zipcode year_month)
  (0 bytes saved)
============================================================================
File: ../temp/rent_panel.dta
Key: zipcode year_month
============================================================================
  156600:17(88611):3705887408:4151797108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |    156,600    51920.57    29185.78       2113      99577
  year_month |    156,600       659.5    34.63992        600        719
  place_code |    129,840    40657.65    22564.03        410      87240
  countyfips |    156,240    24077.04    16484.28       1003      56021
   statefips |    156,600    23.97854    16.42626          1         56
-------------+---------------------------------------------------------
   actual_mw |    156,600     8.07779    1.207718       7.25         16
  dactual_mw |    156,600    .0152048    .1121804          0       2.21
calendar_m~h |    156,600         6.5    3.452064          1         12
         msa |    156,600    436.1801    240.1675         12        860
       trend |    156,600       225.5    34.63992        166        285
-------------+---------------------------------------------------------
    trend_sq |    156,600    52050.17    15659.42      27556      81225
    trend_cu |    156,600    1.23e+07     5408203    4574296   2.31e+07
medrentpri~c |    113,375    1.188344    .7824813   .4180214   6.731387
medrentpri~r |     24,789     1.84165    .9184999   .5015197   6.499599
medrentpri~s |     37,588    1.842276    1.001968   .5106889    6.48415
-------------+---------------------------------------------------------
ln_med_ren~c |    113,375    .0472541    .4493362  -.8722228   1.906781
       ln_mw |    156,600    2.079602    .1327775   1.981001   2.772589




(note: file ../temp/rent_panel.dta not found)
file ../temp/rent_panel.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./estimate_level_models.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimate_level_models.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../temp"
  2.         local outstub "../output"
  3. 
.         use "`instub'/rent_panel.dta", clear
  4. 
.         compare_level_with_baseline, depvar(ln_med_rent_psqft_sfcc) cluster(s
> tatefips)
  5.         esttab * using "`outstub'/baseline_vs_level.tex", compress se repl
> ace substitute(\_ _)  ///
>                 stats(p_val_auto N, fmt(%9.4f %9.0gc) labels("P-value autocor
> relation test" "Observations")) ////
>                 star(* 0.10 ** 0.05 *** 0.01) nonote ///
>                 coeflabels(ln_mw "$\ln \underline{w}_{it}$" D.ln_mw "$\Delta 
> \underline{w}_{it}$") ///
>                 mtitles("Level" "First Difference")
  6.                 
.     levels_with_county_or_state_fe, depvar(ln_med_rent_psqft_sfcc) cluster(st
> atefips)
  7.         esttab * using "`outstub'/different_FEs.tex", compress se replace 
> substitute(\_ _)      ///
>                 stats(zs_trend N, labels("Zipcode-specific linear trends" "Ob
> servations")) ///
>                 mtitles("Zipcode FE" "County FE" "State FE" "State FE") ////
>                 star(* 0.10 ** 0.05 *** 0.01) nonote ///
>                 coeflabels(ln_mw "$\ln \underline{w}_{it}$")
  8. 
. end

. 
. program compare_level_with_baseline
  1.     syntax, depvar(str) cluster(str) 
  2.         
.     eststo clear
  3.         eststo: qui reghdfe `depvar' ln_mw,     ///
>                 absorb(year_month zipcode)      ///
>                 vce(cluster `cluster') nocons
  4.                 
.         eststo fd: qui reghdfe D.`depvar' D.ln_mw, ///
>                 absorb(year_month) ///
>                 vce(cluster `cluster') nocons ///
>                 residuals(fd_res)
  5.         qui reg fd_res L.fd_res, cluster(statefip)
  6.         qui test (L.fd_res = -0.5) 
  7.         qui estadd scalar p_val_auto = r(p): fd
  8.     drop fd_res
  9. end

. 
. program levels_with_county_or_state_fe
  1.     syntax, depvar(str) cluster(str) 
  2. 
.         eststo clear
  3.         eststo: qui reghdfe `depvar' ln_mw,     ///
>                 absorb(year_month zipcode) ///
>                 vce(cluster `cluster') nocons
  4.         qui estadd local zs_trend "No"
  5. 
. 
.         eststo: qui reghdfe `depvar' ln_mw,     ///
>                 absorb(year_month county) ///
>                 vce(cluster `cluster') nocons
  6.         qui estadd local zs_trend "No"
  7. 
.         eststo: qui reghdfe `depvar' ln_mw,     ///
>                 absorb(year_month statefip) ///
>                 vce(cluster `cluster') nocons
  8.         qui estadd local zs_trend "No"
  9. 
.         eststo: qui reghdfe `depvar' ln_mw, ///
>                 absorb(year_month statefip zipcode#c.trend) ///
>                 vce(cluster `cluster') nocons
 10.         qui estadd local zs_trend "Yes"
 11. end

. 
. main
(est1 stored)
(note: file ../output/baseline_vs_level.tex not found)
(output written to ../output/baseline_vs_level.tex)
(est1 stored)
(est2 stored)
(est3 stored)
(est4 stored)
(note: file ../output/different_FEs.tex not found)
(output written to ../output/different_FEs.tex)

. 
end of do-file

 make.py ended: 2020-12-03 19:16:35
