
 make.py started: 2021-10-27 14:52:49 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\baseline_model_predictions\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/estimation_samples"
  2.         local outstub "../output"
  3.         
.         define_controls
  4.         local controls "`r(economic_controls)'"
  5.         local cluster = "statefips"
  6.         local absorb  = "year_month"
  7.         
.         local exp_ln_mw_var "exp_ln_mw_17"
  8.         
.         use "`instub'/baseline_zipcode_months.dta", clear
  9.         xtset zipcode_num `absorb'
 10. 
.         gen d_ln_rents = ln_rents[_n] - ln_rents[_n-1]
 11.         gen d_ln_mw = ln_mw[_n] - ln_mw[_n-1]
 12.         gen d_`exp_ln_mw_var' = `exp_ln_mw_var'[_n] - `exp_ln_mw_var'[_n-1
> ]
 13.         
.         reghdfe d_ln_rents d_`exp_ln_mw_var' d_ln_mw ///
>             `controls', absorb(`absorb', savefe) ///
>             vce(cluster `cluster') nocons residuals(residuals)
 14.         
.     predict p_d_ln_rents if e(sample) == 1, xbd
 15.         
.         keep zipcode year_month ln_rents p_d_ln_rents residuals
 16.         save_data "../output/baseline_model_predictions.dta", ///
>             key(zipcode year_month) replace
 17. end

. 
. main
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(29,145 missing values generated)
(1 missing value generated)
(1 missing value generated)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    131,576
Absorbing 1 HDFE group                            F(  11,     40) =      15.25
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0211
                                                  Adj R-squared   =     0.0202
                                                  Within R-sq.    =     0.0004
Number of clusters (statefips) =         41       Root MSE        =     0.0290

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
d_exp_ln_~17 |   .0568913   .0281278     2.02   0.050     .0000428    .1137397
     d_ln_mw |  -.0245086   .0170506    -1.44   0.158    -.0589692    .0099519
ln_emp_biz~v |  -.0009217   .0001897    -4.86   0.000    -.0013051   -.0005384
 ln_emp_info |   .0003052   .0002362     1.29   0.204    -.0001722    .0007826
  ln_emp_fin |    .000344   .0002537     1.36   0.183    -.0001688    .0008568
ln_estcoun~v |   .0004819   .0005117     0.94   0.352    -.0005522    .0015161
ln_estcoun~o |   .0003475   .0003998     0.87   0.390    -.0004605    .0011556
ln_estcoun~n |  -.0002975   .0007302    -0.41   0.686    -.0017733    .0011783
ln_avgwwag~v |  -.0002057   .0007276    -0.28   0.779    -.0016764    .0012649
ln_avgwwag~o |   .0003911   .0005463     0.72   0.478     -.000713    .0014952
ln_avgwwag~n |  -.0013205   .0005618    -2.35   0.024    -.0024559   -.0001852
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |       118           0         118     |
-----------------------------------------------------+
(29,824 missing values generated)
(data now sorted by zipcode year_month)
  (0 bytes saved)
===============================================================================
File: ../output/baseline_model_predictions.dta
Key: zipcode year_month
===============================================================================
  161400:5(86068):1902121881:2204235309

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
  year_month |    161,400       659.5    34.63992        600        719
    ln_rents |    133,600    .0763131    .4611457  -.8722227   3.100092
   residuals |    131,576    1.58e-17    .0290232  -.2035419   .1690638
p_d_ln_rents |    131,576    .0022314    .0042641  -.0318113   .0244792




(note: file ../output/baseline_model_predictions.dta not found)
file ../output/baseline_model_predictions.dta saved

. 
end of do-file

 make.py ended: 2021-10-27 14:52:55
