
 make.py started: 2020-12-13 07:29:44 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\missing_and_more\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./preclean.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/output"
  2.         local outstub "../temp"
  3.         local logfile "../output/data_file_manifest.log"
  4. 
.         use "`instub'/baseline_rent_panel.dta", clear 
  5.         keep zipcode place_code msa countyfips statefips                  
>                                               ///
>                 year_month calendar_month trend trend_sq trend_cu            
>                                            ///
>                 dactual_mw actual_mw medrentpricepsqft_*                     
>                                    ///
>                 med_hhinc20105 renthouse_share2010 white_share2010 black_shar
> e2010                      ///
>                 college_share20105 work_county_share20105 unemp_share20105 te
> en_share2010   ///
>                 estcount_* avgwwage_* emp_* u1*                              
>                ///
>                 walall_njob_29young_ssh halall_njob_29young_ssh walall_29y_lo
> winc_ssh halall_29y_lowinc_ssh
  6. 
.         local het_vars "med_hhinc20105 unemp_share20105 college_share20105 bl
> ack_share2010"
  7.         local het_vars "`het_vars' renthouse_share2010 teen_share2010"
  8.         local het_vars "`het_vars' walall_njob_29young_ssh halall_njob_29y
> oung_ssh walall_29y_lowinc_ssh halall_29y_lowinc_ssh" 
  9. 
.         create_vars,    log_vars(actual_mw medrentpricepsqft_sfcc emp_* estco
> unt_* avgwwage_* u1*)      ///
>                                         heterogeneity_vars(`het_vars')
 10.         
.         simplify_varnames
 11. 
.         xtset zipcode year_month
 12.         gen d_ln_mw = D.ln_mw
 13. 
.         save_data "`outstub'/fd_rent_panel.dta", key(zipcode year_month) repl
> ace log(`logfile')
 14. end

. 
. program create_vars
  1.         syntax, log_vars(str) heterogeneity_vars(str)
  2. 
.         local log_vars_expanded "" 
  3.         foreach v in `log_vars' {
  4.                 unab this_var: `v'
  5.                 local log_vars_expanded `"`log_vars_expanded' `this_var'"'
  6.         }
  7.         unab bpsvars: u1*
  8.         foreach var in `bpsvars' {
  9.                 replace `var' = 1 + `var'
 10.         }
 11.         foreach var in `log_vars_expanded' {
 12.                 gen ln_`var' = ln(`var')
 13.         }
 14. 
.         gen nonwhite_share2010 = 1 - white_share2010
 15.         
.         gen trend_times2 = 2*trend
 16. 
.         foreach var in `heterogeneity_vars' {
 17. 
.                 gquantiles `var'_nat_qtl = `var', xtile nq(4)
 18. 
.                 gquantiles `var'_st_qtl  = `var', xtile nq(4) by(statefips)
 19.         }
 20. end

. 
. program simplify_varnames
  1.         
.         cap rename ln_actual_mw                  ln_mw 
  2.         cap rename ln_medrentpricepsqft_sfcc     ln_med_rent_psqft_sfcc
  3.         cap rename ln_medrentpricepsqft_2br      ln_med_rent_psqft_2br
  4.         cap rename ln_medrentpricepsqft_mfr5plus ln_med_rent_psqft_mfr5plu
> s
  5. 
. end

. 
. main
(136,332 real changes made)
(136,332 real changes made)
(136,332 real changes made)
(136,332 real changes made)
(136,332 real changes made)
(136,332 real changes made)
(43,225 missing values generated)
(4,266 missing values generated)
(5,523 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,302 missing values generated)
(5,028 missing values generated)
(4,266 missing values generated)
(7,515 missing values generated)
(5,544 missing values generated)
(7,224 missing values generated)
(7,704 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,791 missing values generated)
(4,473 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(5,523 missing values generated)
(4,266 missing values generated)
(4,266 missing values generated)
(4,302 missing values generated)
(5,028 missing values generated)
(4,266 missing values generated)
(7,515 missing values generated)
(5,544 missing values generated)
(7,224 missing values generated)
(7,704 missing values generated)
(4,266 missing values generated)
(20,637 missing values generated)
(20,637 missing values generated)
(20,791 missing values generated)
(20,422 missing values generated)
(20,422 missing values generated)
(20,632 missing values generated)
       panel variable:  zipcode (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(1,305 missing values generated)
(data already sorted by zipcode year_month)
  variable trend_times2 was float now int
  (313,200 bytes saved)
============================================================================
File: ../temp/fd_rent_panel.dta
Key: zipcode year_month
============================================================================
  156600:136(117629):1450652518:3657499007

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |    156,600    51920.57    29185.78       2113      99577
  year_month |    156,600       659.5    34.63992        600        719
  place_code |    129,840    40657.65    22564.03        410      87240
  countyfips |    156,240    24077.04    16484.28       1003      56021
   statefips |    156,600    23.97854    16.42626          1         56
-------------+---------------------------------------------------------
   actual_mw |    156,600     8.07779    1.207718       7.25         16
  dactual_mw |    156,600    .0152048    .1121804          0       2.21
calendar_m~h |    156,600         6.5    3.452064          1         12
         msa |    156,600    436.1801    240.1675         12        860
       trend |    156,600       225.5    34.63992        166        285
-------------+---------------------------------------------------------
    trend_sq |    156,600    52050.17    15659.42      27556      81225
    trend_cu |    156,600    1.23e+07     5408203    4574296   2.31e+07
medrentpri~c |    113,375    1.188344    .7824813   .4180214   6.731387
medrentpri~r |     24,789     1.84165    .9184999   .5015197   6.499599
medrentpri~s |     37,588    1.842276    1.001968   .5106889    6.48415
-------------+---------------------------------------------------------
white_s~2010 |    156,600    .5392018    .2225559   .0037838   .9401773
black_s~2010 |    156,600     .165993    .2003044    .003148   .9753076
teen_sh~2010 |    156,600    .1391686    .0481773   .0154552   .6235335
renthou~2010 |    156,600    .3834818     .176359   .0644567   .9662035
work_c~20105 |    156,600    .7557563    .2036341   .1421741    .995271
-------------+---------------------------------------------------------
colleg~20105 |    156,600    .4447718    .1662964   .0856991   .9082218
unemp_~20105 |    156,600    .0918395    .0398028   .0211286   .3417086
med_hh~20105 |    156,600    66919.72    24575.33   20527.66   191553.2
estcount_b~v |    152,334    9998.143    9478.137         60      56304
avgwwage_b~v |    152,334    1252.921    434.7633        226       4727
-------------+---------------------------------------------------------
 emp_bizserv |    152,334    134293.3    143883.8        329     642234
estcount_c~t |    152,334    3240.371    2963.656         35      16939
avgwwage_c~t |    152,334    1101.648    300.1755          0       2608
   emp_const |    152,334    33963.15    34828.46          0     173773
estcount_e~e |    152,334    8227.496    21233.92         48     245645
-------------+---------------------------------------------------------
avgwwage_e~e |    152,334    941.4689    149.2949        415       1975
   emp_eduhe |    152,334    115827.1    123161.7        481     835039
estcount_f~v |    152,334    114.6271    78.41068          3        456
avgwwage_f~v |    152,334    1433.109    237.1039        654       2724
  emp_fedgov |    152,334    13996.39    16476.49         42     215436
-------------+---------------------------------------------------------
estcount_fin |    152,334    5103.539    5200.218         31      30238
avgwwage_fin |    152,334    1561.705    965.2143          0       9547
     emp_fin |    152,334    59557.25    75803.56          0     398481
estcount_i~o |    152,334    920.6698    1382.296          4      13212
avgwwage_i~o |    152,334    1504.754    620.2263          0       7381
-------------+---------------------------------------------------------
    emp_info |    152,334    21043.15    35144.92          0     240358
estcount_l~s |    152,334    4278.093    4708.605         27      39222
avgwwage_l~s |    152,334    446.7107    134.2103        203       1131
    emp_leis |    152,334    93087.95    93948.61        279     551791
estcount_l~v |    152,334    307.0594    500.3306          1       4162
-------------+---------------------------------------------------------
avgwwage_l~v |    152,334    961.0816    234.2459          0       2042
  emp_locgov |    152,334    72439.67    83732.02          0     463785
estcount_m~u |    152,334    1585.444    1953.882         10      13469
avgwwage_m~u |    152,334    1272.906    396.7543          0       4970
    emp_manu |    152,334    47068.67    62218.62          0     376653
-------------+---------------------------------------------------------
estcount_n~s |    151,809    211.8363    322.4826          1       1859
avgwwage_n~s |    151,809    1133.199    862.1232          0       8606
  emp_natres |    151,809    5209.704     14256.1          0      97846
estcount_s~v |    152,127    140.9399    411.3288          1       5969
avgwwage_s~v |    152,127     1014.47    299.4505          0       2572
-------------+---------------------------------------------------------
   emp_stgov |    152,127    15709.17    16292.85          0     114555
estcount_t~p |    152,334    9406.654    9421.556         84      59438
avgwwage_t~p |    152,334    861.6196    200.9441        356       3194
  emp_transp |    152,334    143879.2    144973.2        629     872187
    u1_bldgs |    136,332    274.6464    358.5711      -1621       2688
-------------+---------------------------------------------------------
    u1_units |    136,332    274.6464    358.5711      -1621       2688
    u1_value |    136,332    6.74e+07    8.85e+07  -1.35e+08   6.43e+08
 u1rep_bldgs |    136,332    262.2207    357.1151       -477       3759
 u1rep_units |    136,332    262.2207    357.1151       -477       3759
 u1rep_value |    136,332    6.48e+07    8.80e+07  -1.32e+08   8.74e+08
-------------+---------------------------------------------------------
walall_njo~h |    156,240    .0011088     .001684   .0000248   .0190973
halall_njo~h |    156,480    .0011799     .001967   .0000466   .0316029
walall_29y~h |    156,240    .0047145    .0069488   .0001284   .0780198
halall_29y~h |    156,480    .0047388    .0068154   .0000821   .1035602
       ln_mw |    156,600    2.079602    .1327775   1.981001   2.772589
-------------+---------------------------------------------------------
ln_med_ren~c |    113,375    .0472541    .4493362  -.8722228   1.906781
ln_emp_biz~v |    152,334      11.108    1.386834   5.796058   13.37271
ln_emp_const |    151,077    9.898307    1.163937    5.31812   12.06551
ln_emp_eduhe |    152,334    11.04985    1.265766   6.175867   13.63523
ln_emp_fed~v |    152,334    8.916786    1.366298    3.73767   12.28042
-------------+---------------------------------------------------------
  ln_emp_fin |    152,298    10.19513    1.453856   4.454347   12.89542
 ln_emp_info |    151,572    9.006427    1.549256   2.397895   12.38988
 ln_emp_leis |    152,334    10.86033    1.201436   5.631212   13.22092
ln_emp_loc~v |    149,085    10.64621    1.126274   7.035269   13.04718
 ln_emp_manu |    151,056    10.03152     1.30013   4.543295   12.83908
-------------+---------------------------------------------------------
ln_emp_nat~s |    149,376    6.965401    1.822471   .6931472   11.49115
ln_emp_stgov |    148,896    9.034419    1.380182   3.433987   11.64881
ln_emp_tra~p |    152,334    11.32727    1.175193   6.444131   13.67876
ln_estcou~rv |    152,334    8.631106    1.247359   4.094345   10.93852
ln_estcoun~t |    152,334     7.63511    1.038369   3.555348   9.737374
-------------+---------------------------------------------------------
ln_estcoun~e |    152,334    8.181748    1.281099   3.871201   12.41164
ln_estc~dgov |    152,334     4.47362    .8084446   1.098612   6.122493
ln_estcoun~n |    152,334    7.954816    1.209698   3.433987   10.31685
ln_estcoun~o |    152,334    6.071127    1.338069   1.386294   9.488881
ln_estcou~is |    152,334    7.826004    1.132324   3.295837   10.57699
-------------+---------------------------------------------------------
ln_estc~cgov |    152,334     5.01103    1.182176          0   8.333751
ln_estcoun~u |    152,334    6.723692    1.232639   2.302585   9.508146
ln_estcou~es |    151,809    4.487308    1.395918          0   7.527794
ln_estc~tgov |    152,127     4.15392    1.108557          0   8.694335
ln_estcoun~p |    152,334    8.611787     1.14944   4.430817   10.99269
-------------+---------------------------------------------------------
ln_avgwwa~rv |    152,334    7.078686     .326307   5.420535   8.461046
ln_avgwwag~t |    151,077    6.982866    .2416437   6.122493   7.866339
ln_avgwwag~e |    152,334    6.835003    .1581551   6.028278   7.588324
ln_avgw~dgov |    152,334    7.254022    .1652418   6.483108   7.909857
ln_avgwwag~n |    152,298    7.248846    .4144515   6.180017   9.163982
-------------+---------------------------------------------------------
ln_avgwwag~o |    151,572    7.255305    .3551565   5.888878   8.906665
ln_avgwwa~is |    152,334     6.06221    .2759165   5.313206   7.030858
ln_avgw~cgov |    149,085    6.872041    .1863058    6.05444   7.621685
ln_avgwwag~u |    151,056    7.120315    .2656149   6.139884   8.511175
ln_avgwwa~es |    149,376    6.864521    .5646428   5.384495   9.060215
-------------+---------------------------------------------------------
ln_avgw~tgov |    148,896    6.912444    .2492661   6.001415   7.852439
ln_avgwwag~p |    152,334    6.733492    .2227758   5.874931   8.069029
 ln_u1_bldgs |    135,963    4.775056    1.589248          0   7.896553
 ln_u1_units |    135,963    4.775056    1.589248          0   7.896553
 ln_u1_value |    135,809    16.64258    3.649391          0   20.28197
-------------+---------------------------------------------------------
ln_u1rep_b~s |    136,178    4.599205    1.755203          0   8.231908
ln_u1rep_u~s |    136,178    4.599205    1.755203          0   8.231908
ln_u1rep_v~e |    135,968    16.17866    4.454632          0   20.58904
nonwhit~2010 |    156,600    .4607982    .2225559   .0598227   .9962162
trend_times2 |    156,600         451    69.27985        332        570
-------------+---------------------------------------------------------
med_h~at_qtl |    156,600    2.498851     1.11838          1          4
med_h~st_qtl |    156,600    2.467433    1.120644          1          4
unemp~at_qtl |    156,600    2.498851     1.11838          1          4
unemp~st_qtl |    156,600    2.467433    1.120644          1          4
colle~at_qtl |    156,600    2.498851     1.11838          1          4
-------------+---------------------------------------------------------
colle~st_qtl |    156,600    2.467433    1.120644          1          4
black~at_qtl |    156,600    2.498851     1.11838          1          4
black~st_qtl |    156,600    2.467433    1.120644          1          4
renth~at_qtl |    156,600    2.498851     1.11838          1          4
renth~st_qtl |    156,600    2.467433    1.120644          1          4
-------------+---------------------------------------------------------
teen_~at_qtl |    156,600    2.498851     1.11838          1          4
teen_~st_qtl |    156,600    2.467433    1.120644          1          4
walall_njo.. |    156,240    2.499232    1.118037          1          4
walall_njo.. |    156,240    2.469278    1.120361          1          4
halall_njo.. |    156,480         2.5    1.118038          1          4
-------------+---------------------------------------------------------
halall_njo.. |    156,480    2.468558    1.120337          1          4
walall_29y.. |    156,240    2.499232    1.118037          1          4
walall_29y.. |    156,240    2.469278    1.120361          1          4
halall_29y.. |    156,480         2.5    1.118038          1          4
halall_29y.. |    156,480    2.468558    1.120337          1          4
-------------+---------------------------------------------------------
     d_ln_mw |    155,295    .0016445    .0119584   -.290338   .2412503




(note: file ../temp/fd_rent_panel.dta not found)
file ../temp/fd_rent_panel.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./explore.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./explore.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000


. 
. program main
  1.         use "../temp/fd_rent_panel.dta", clear
  2. 
.         bysort zipcode: egen enter_date = min(year_month) if !missing(medrent
> pricepsqft_sfcc)
  3.         gen first_obs = (year_month == enter_date)
  4. 
.         preserve
  5.         keep if first_obs == 1 & enter_date > tm(2010m1) /*the second cond
> ition doesn't do anything*/
  6.     unique zipcode
  7.         local nbr_late_zipcodes = r(N)
  8.         collapse (sum) nbr_zipocde_entries = first_obs, by(calendar_month)
  9.         gen share_entries = nbr_zipocde_entries/`nbr_late_zipcodes'
 10.                 
.         line share_entries calendar_month, ///
>             graphregion(color(white)) bgcolor(white)
 11.         graph export "../output/share_of_zipcode_entries_by_calendar_month
> .png", replace
 12.         restore
 13.         
.         preserve
 14.         keep if first_obs == 1
 15.         collapse (count) nbr_of_zipcodes = first_obs, by(year_month)
 16.         line nbr_of_zipcodes year_month, ///
>             graphregion(color(white)) bgcolor(white) ///
>                 ytitle(Number of entrant zipcodes)
 17.         graph export "../output/nbr_zipcodes_entries_by_year_month.png", r
> eplace
 18.         
.         gen year = year(dofm(year_month))
 19.         collapse (sum) nbr_of_zipcodes = nbr_of_zipcodes, by(year)
 20.     line nbr_of_zipcodes year, ///
>             graphregion(color(white)) bgcolor(white) ///
>                 ytitle(Number of entrant zipcodes)
 21.         graph export "../output/nbr_zipcodes_entries_by_year.png", replace
 22.     restore 
 23.         
.         preserve
 24.         keep if enter_date <= tm(2011m12)
 25.         collapse (count) year_month, by(zipcode)
 26.         keep zipcode 
 27.         save "../temp/early_zipcodes.dta", replace
 28.         restore
 29.         
.         local w = 5
 30.         eststo clear
 31.         preserve
 32.         keep if year_month >= tm(2015m7)
 33.         eststo: reghdfe D.medrentpricepsqft_sfcc L(-`w'/`w').D.ln_mw, ///
>             absorb(year_month) vce(cluster statefip) nocons
 34.         eststo: reghdfe D.medrentpricepsqft_sfcc L(0/`w').D.ln_mw, ///
>             absorb(year_month) vce(cluster statefip) nocons
 35.         eststo: reghdfe D.medrentpricepsqft_sfcc D.ln_mw, ///
>             absorb(year_month) vce(cluster statefip) nocons
 36.         restore
 37.         
.         /*preserve
>         merge m:1 zipcode using "../temp/early_zipcodes.dta", keep(3)
>         xtset zipcode year_month
>         eststo: reghdfe D.medrentpricepsqft_sfcc L(-`w'/`w').D.ln_mw, ///
>             absorb(year_month) vce(cluster statefip) nocons
>         restore*/
.         
.         make_results_labels, w(5)
 38.         local estlabels_dyn "`r(estlabels_dyn)'"
 39.         
.     esttab * using "../output/balanced_samples.tex", compress se replace ///
>                 b(%9.4f) se(%9.4f) coeflabels(`estlabels_dyn') ///
>                 stats(r2 N, fmt(%9.3f %9.0gc) ///
>                 labels("R-squared" "Observations")) star(* 0.10 ** 0.05 *** 0
> .01) ///
>                 nonote
 40. end

. 
. 
. 
. main
(43225 missing values generated)
(155,457 observations deleted)
Number of unique values of zipcode is  1143
Number of records is  1143
(note: file ../output/share_of_zipcode_entries_by_calendar_month.png not found)
(file ../output/share_of_zipcode_entries_by_calendar_month.png written in PNG f
> ormat)
(155,457 observations deleted)
(note: file ../output/nbr_zipcodes_entries_by_year_month.png not found)
(file ../output/nbr_zipcodes_entries_by_year_month.png written in PNG format)
(note: file ../output/nbr_zipcodes_entries_by_year.png not found)
(file ../output/nbr_zipcodes_entries_by_year.png written in PNG format)
(70,331 observations deleted)
(note: file ../temp/early_zipcodes.dta not found)
file ../temp/early_zipcodes.dta saved
(86,130 observations deleted)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     49,149
Absorbing 1 HDFE group                            F(  11,     40) =       2.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0128
                                                  R-squared       =     0.0203
                                                  Adj R-squared   =     0.0193
                                                  Within R-sq.    =     0.0011
Number of clusters (statefips) =         41       Root MSE        =     0.0442

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
medrentpri~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
        F5D. |  -.0163863   .0185198    -0.88   0.382    -.0538162    .0210435
        F4D. |  -.0086982   .0286924    -0.30   0.763    -.0666877    .0492913
        F3D. |  -.0250443   .0255144    -0.98   0.332    -.0766108    .0265223
        F2D. |   .0258164   .0178663     1.44   0.156    -.0102927    .0619255
         FD. |  -.0025487   .0175448    -0.15   0.885     -.038008    .0329106
         D1. |   .0372973   .0354202     1.05   0.299    -.0342896    .1088841
         LD. |   .0685388   .0324727     2.11   0.041     .0029089    .1341686
        L2D. |  -.0184998   .0280104    -0.66   0.513     -.075111    .0381114
        L3D. |   .0197636   .0291379     0.68   0.502    -.0391262    .0786534
        L4D. |   .0250713   .0206433     1.21   0.232    -.0166503    .0667929
        L5D. |   .0439891   .0311677     1.41   0.166    -.0190032    .1069814
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        43           0          43     |
-----------------------------------------------------+
(est1 stored)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     54,864
Absorbing 1 HDFE group                            F(   6,     40) =       2.04
Statistics robust to heteroskedasticity           Prob > F        =     0.0832
                                                  R-squared       =     0.0194
                                                  Adj R-squared   =     0.0185
                                                  Within R-sq.    =     0.0008
Number of clusters (statefips) =         41       Root MSE        =     0.0438

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
medrentpri~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |    .032138   .0383343     0.84   0.407    -.0453384    .1096144
         LD. |   .0702138   .0316885     2.22   0.032      .006169    .1342586
        L2D. |  -.0157882   .0263377    -0.60   0.552    -.0690186    .0374423
        L3D. |   .0205656   .0274103     0.75   0.457    -.0348327    .0759638
        L4D. |   .0211609   .0208848     1.01   0.317    -.0210489    .0633706
        L5D. |   .0364226   .0284367     1.28   0.208    -.0210501    .0938953
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        48           0          48     |
-----------------------------------------------------+
(est2 stored)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     60,579
Absorbing 1 HDFE group                            F(   1,     40) =       0.68
Statistics robust to heteroskedasticity           Prob > F        =     0.4137
                                                  R-squared       =     0.0183
                                                  Adj R-squared   =     0.0175
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         41       Root MSE        =     0.0433

                             (Std. Err. adjusted for 41 clusters in statefips)
------------------------------------------------------------------------------
D.           |               Robust
medrentpri~c |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       ln_mw |
         D1. |    .031401    .038019     0.83   0.414    -.0454384    .1082403
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        53           0          53     |
-----------------------------------------------------+
(est3 stored)
(note: file ../output/balanced_samples.tex not found)
(output written to ../output/balanced_samples.tex)

. 
end of do-file

 make.py ended: 2020-12-13 07:29:59
