
 make.py started: 2021-12-22 16:26:34 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\descriptive\estimation_samples\code 




Execute:  StataMP-64 /e do "./plot_mw.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./plot_mw.do 

. clear all

. set more off

. 
. program main
  1.         local instub "../../../../drive/derived_large/estimation_samples"
  2.         local outstub "../output"
  3. 
.     use zipcode zipcode_num year_month actual_mw ///
>                 using "`instub'/all_zipcode_months.dta", clear
  4.         xtset
  5.         gen pct_ch_MW = 100*(actual_mw/L.actual_mw - 1)
  6.         drop if missing(pct_ch_MW)
  7.         
.         plot_mw_dist, outstub(`outstub')
  8. end

. 
. program plot_mw_dist
  1.         syntax, outstub(str)
  2. 
.         twoway (hist pct_ch_MW if pct_ch_MW>0, color(navy%80) lcolor(white) l
> w(vthin)), ///
>                         xtitle("Minimum wage changes (%)") ytitle("Relative f
> requency") ///
>                         xlabel(, labsize(small)) ylabel(, labsize(small)) ///
>                         graphregion(color(white)) bgcolor(white)
  3.         graph export `outstub'/pct_ch_mw_dist.png, replace 
  4.         graph export `outstub'/pct_ch_mw_dist.eps, replace
  5. 
.         keep if pct_ch_MW>0
  6.         twoway (hist year_month, color(navy%80) lcolor(white) lw(vthin)), 
> ///
>                         xtitle("Monthly date") ytitle("Relative frequency") /
> //
>                         xlabel(#20, labsize(small) angle(45)) ///
>                         graphregion(color(white)) bgcolor(white)
  7.         graph export `outstub'/pct_ch_mw_date_dist.png, replace 
  8.         graph export `outstub'/pct_ch_mw_date_dist.eps, replace 
  9. end

. 
. 
. main
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2010m1 to 2019m12
                delta:  1 month
(40,487 missing values generated)
(40,487 observations deleted)
(note: file ../output/pct_ch_mw_dist.png not found)
(file ../output/pct_ch_mw_dist.png written in PNG format)
(note: file ../output/pct_ch_mw_dist.eps not found)
(file ../output/pct_ch_mw_dist.eps written in EPS format)
(4,695,082 observations deleted)
(note: file ../output/pct_ch_mw_date_dist.png not found)
(file ../output/pct_ch_mw_date_dist.png written in PNG format)
(note: file ../output/pct_ch_mw_date_dist.eps not found)
(file ../output/pct_ch_mw_date_dist.eps written in EPS format)

. 
end of do-file


Execute:  StataMP-64 /e do "./zillow_entry.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./zillow_entry.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.         local instub  "../../../../drive/derived_large/estimation_samples"
  2.         local outstub "../output"
  3.         
.         local rent_var  "medrentpricepsqft_SFCC"
  4.         local target_ym "2015m1"
  5.         
.         foreach geo in zipcode county {
  6.                 use "`instub'/all_`geo'_months.dta", clear
  7.                 keep if !missing(`rent_var')
  8.                 gcollapse (min) min_year_month = year_month, by(`geo')
  9.                 
.                 unique `geo'
 10.                 local total_geo = r(N)
 11.                 
.                 bysort min_year_month: egen nbr_entrant = count(`geo')
 12.                 drop `geo'
 13.                 by min_year_month: keep if _n == 1
 14.                 gen share_entrant = nbr_entrant/`total_geo'
 15.                 gen cum_share_entrant = sum(share_entrant)
 16.             
.                 sum cum_share_entrant if min_year_month >= `=tm(`target_ym')'
 17.                 local cum_share_at_target = r(min)
 18.                 local cum_share_at_target : di %6.3f `cum_share_at_target'
 19.                 
.                 label var nbr_entrant        "Number of entrants"
 20.                 label var cum_share_entrant  "Cumulative share of entrants
> "
 21.                 label var min_year_month     "Year-month"
 22.                 
.                 twoway (line nbr_entrant min_year_month, yaxis(1)) ///
>                         (line cum_share_entrant min_year_month, yaxis(2)), //
> /
>                         text(0.8 `=tm(`target_ym')' "`cum_share_at_target'", 
> yaxis(2)) ///
>                         xline(`=tm(`target_ym')') legend(row(2)) ///
>                         graphregion(color(white)) bgcolor(white)
 23.                 graph export "../output/`geo'_entrants.png", replace
 24.         }
 25. end

. 
. main
(4,660,462 observations deleted)
Number of unique values of zipcode is  3316
Number of records is  3316
(3,214 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cum_share_~t |         45    .6910736    .2417033   .4056092          1
(note: file ../output/zipcode_entrants.png not found)
(file ../output/zipcode_entrants.png written in PNG format)
(320,186 observations deleted)
Number of unique values of county is  703
Number of records is  703
(608 observations deleted)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
cum_share_~t |         42    .8295739    .1264094   .6642959          1
(note: file ../output/county_entrants.png not found)
(file ../output/county_entrants.png written in PNG format)

. 
end of do-file

 make.py ended: 2021-12-22 16:27:40
