
 make.py started: 2021-09-23 20:44:33 C:\Users\shermo\Documents\GitHub\min_wage_rent\derived\county\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local in_geo        "../../../base/geo_master/output"
  2.     local in_base_large "../../../drive/base_large"
  3.     local in_der_large  "../../../drive/derived_large"
  4.     local outstub       "../../../drive/derived_large/county"
  5.     local logfile       "../output/data_file_manifest.log"
  6. 
.     build_zillow_county_stats, instub(`in_base_large')
  7.     clean_county_shares, instub(`in_der_large')
  8. 
.     use countyfips statefips cbsa10 ///
>         using "`in_geo'/zip_county_place_usps_all.dta", clear
  9.     duplicates drop
 10.     isid countyfips
 11. 
.     merge 1:1 countyfips using "../temp/zillow_counties_with_rents.dta",     
>        ///
>         nogen assert(1 3)
 12.     merge 1:1 countyfips using "`in_base_large'/demographics/county_demo_2
> 010.dta", ///
>         nogen keep(1 3)
 13.     merge 1:1 countyfips using "../temp/county_shares.dta",               
>              ///
>         nogen keep(1 3)
 14. 
.     strcompress
 15.         rename countyfips county
 16.     save_data "`outstub'/county_cross.dta", replace ///
>         key(county) log(`logfile')
 17. end

. 
. program build_zillow_county_stats
  1.     syntax, instub(str)
  2. 
.     use "`instub'/zillow/zillow_county_clean.dta", clear
  3. 
.     keep if !missing(medrentpricepsqft_SFCC)
  4.     collapse (count) n_months_zillow_rents = medrentpricepsqft_SFCC, by(co
> untyfips)
  5.     tostring countyfips, format(%05.0f) replace
  6. 
.     save "../temp/zillow_counties_with_rents.dta", replace
  7. end

. 
. program clean_county_shares
  1.     syntax, instub(str)
  2. 
.     import delimited "`instub'/shares/county_shares.csv", clear
  3.     tostring county, format(%05.0f) replace
  4. 
.     rename county countyfips
  5. 
.     save "../temp/county_shares.dta"
  6. end

. 
. 
. main
(28,124 observations deleted)
countyfips already string; no replace
(note: file ../temp/zillow_counties_with_rents.dta not found)
file ../temp/zillow_counties_with_rents.dta saved
(18 vars, 3,143 obs)
county was long now str5
file ../temp/county_shares.dta saved

Duplicates in terms of all variables

(84,656 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,440
        from master                     2,440  
        from using                          0  

    matched                               703  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         2  
        from using                          0  

    matched                             3,141  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         2  
        from using                          0  

    matched                             3,141  
    -----------------------------------------
  Converting str to strL: countyfips cbsa10 statefips
    strcompress grew data 55% so far, but I'm not done yet!
  variable n_months_zillow_rents was long now int
  variable countyfips was strL now str5
  variable cbsa10 was strL now str5
  variable statefips was strL now str2
  (660,807 bytes saved)
       compress shrank data 36%
    strcompress shrank data  1% overall
(data already sorted by county)
  (0 bytes saved)
===============================================================================
File: ../../../drive/derived_large/county/county_cross.dta
Key: county
===============================================================================
  3143:61(17426):3184459043:3891159589

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      county |          0
      cbsa10 |          0
   statefips |          0
n_months_z~s |        703     80.6771    36.13984         12        120
     pop2010 |      3,141     98288.6      312993         82    9818605
-------------+---------------------------------------------------------
urb_sha~2010 |      3,141    .4137007    .3151176          0          1
white_s~2010 |      3,141    .7834281    .1980282   .0286041   .9916318
black_s~2010 |      3,141     .087542    .1442435          0   .8543878
hisp_sh~2010 |      3,141    .0828822     .131938          0   .9574477
asian_s~2010 |      3,141    .0113735    .0247051          0   .4301469
-------------+---------------------------------------------------------
natam_s~2010 |      3,141     .000805    .0094588          0   .4888889
child_s~2010 |      3,141    .1922556      .02926          0   .3449854
teen_sh~2010 |      3,141    .1296905    .0351239   .0333333   .4876889
youngad~2010 |      3,141     .115452    .0207809   .0487805   .2764669
adult_s~2010 |      3,141    .4037113    .0340745   .1784953    .580408
-------------+---------------------------------------------------------
elder_s~2010 |      3,141    .1588906    .0418357    .034706   .4338471
housing~2010 |      3,141    41928.99    122803.3         50    3445076
hh_couple_s~ |      3,141    .5782099    .0592149   .1594203   .8099291
h~child_sh~0 |      3,141    .4007648    .0615034          0   .7200393
renthou~2010 |      3,139    .2773082    .0762095   .1016782   .8074233
-------------+---------------------------------------------------------
workers20105 |      3,141    44536.23    143083.7         55    4384405
workers_pr~5 |      3,141    35556.92    116816.2          8    3521225
work_c~20105 |      3,141    .6589085    .1803682   .0902625          1
worktravel.. |      3,141     .245927    .1285107   .0367979   .9326025
worktravel.. |      3,141     .679579    .1211418   .0665855    .889462
-------------+---------------------------------------------------------
worktravel.. |      3,141    .0744939    .0454474          0   .3216467
colleg~20105 |      3,141    .2726086    .0941842   .0365854   .7516183
poor_s~20105 |      3,141    .1628115    .0640739          0   .4772144
lo_hhi~20105 |      3,141    .5055628    .1030632   .1207927   .7748405
hi_hhi~20105 |      3,141    .1464673     .075713   .0245148   .6135803
-------------+---------------------------------------------------------
med_hh~20105 |      3,141    45652.18    11899.29      19624     122844
med_pi~20105 |      3,141    26620.33    5187.995       4725      62514
unemp_~20105 |      3,141    .0857471    .0373383          0   .2679856
employ~20105 |      3,141     .877604    .0540378   .4992928   .9863946
work~ce20105 |      3,141    2535.642    8158.096          0     237725
-------------+---------------------------------------------------------
tot_pinc20~5 |      3,141    1.1e-314           0          0   1.1e-312
tot_pinc_f~5 |      3,141    9.1e-315           0          0   9.1e-313
med_earn_h~5 |      3,094    19839.12    5602.371       2499     117857
m~tectserv~5 |      3,067    38451.99     12292.3       2499     125179
med_earn_f~5 |      3,134    11117.39    3357.323       2499      37734
-------------+---------------------------------------------------------
med_earn_c~5 |      3,131    16547.44    5103.044       2499      65625
med_~e_20105 |      3,105    14144.38    6302.726       2499     220071
med~sp_20105 |      3,139    30244.21    6127.976       2499      82813
worker_foo.. |      3,141    .0537222     .016531          0   .1709477
     workers |      3,141    45053.49    163833.6         18    4593831
-------------+---------------------------------------------------------
workers_yo~g |      3,141    10484.18    37275.68          0    1009169
workers_lo~c |      3,141    10318.13    34571.22          4    1078778
   residents |      3,141    45053.75    145774.6        124    4362477
residents_~g |      3,141    10484.22    33816.18         32     983991
residents_~c |      3,141    10318.16    32107.45         31    1034491
-------------+---------------------------------------------------------
w_countyfips |      3,140    30399.26    15158.57       1001      56045
    own_jobs |      3,140    24571.88    105537.2          3    3521315
own_jobs_y~g |      3,140     5569.85    23808.01          0     761133
own_jobs_l~c |      3,140    5764.335     23404.8          0     843939
share_resi~g |      3,141    .2291124    .0210235   .1277014   .3910703
-------------+---------------------------------------------------------
share_resi~c |      3,141    .2570226    .0346104   .1483183   .4368601
sha~rs_young |      3,141    .2213846     .032129          0   .3647462
sh~rs_lowinc |      3,141    .2652614    .0503486   .0796131   .6662679
share_work~o |      3,140    .4231862    .1617803    .023622   .9583516
shar~o_young |      3,140    .0885058    .0400324          0   .2381609
-------------+---------------------------------------------------------
sha~o_lowinc |      3,140    .1156083    .0449255          0   .3477168




file ../../../drive/derived_large/county/county_cross.dta saved

. 
end of do-file

 make.py ended: 2021-09-23 20:44:35
