
 make.py started: 2023-08-01 11:25:33 C:\Users\shermo\Documents\GitHub\min_wage_rent\analysis\fd_zori\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local outstub "../output"
  3. 
.     define_controls
  4.     local controls "`r(economic_controls)'"
  5.     local cluster = "statefips"
  6. 
.     local mw_wkp_var "mw_wkp_F"
  7. 
.     use "`instub'/zipcode_months.dta", clear
  8.     xtset zipcode_num year_month
  9. 
.     gen mw_wkp_F = F4.mw_wkp_tot_17
 10.     gen mw_res_F = F4.mw_res
 11. 
.     estimate_dist_lag_model, depvar(ln_zori_23)           ///
>         dyn_var(`mw_wkp_var') w(4) stat_var(mw_res_F)     ///
>         controls(`controls') absorb(year_month)           ///
>         cluster(`cluster') model_name(time_FE)
 12.     
.     estimate_dist_lag_model, depvar(ln_zori_23)           ///
>         dyn_var(`mw_wkp_var') w(4) stat_var(mw_res_F)     ///
>         controls(`controls') absorb(cbsa_num##year_month) ///
>         cluster(`cluster') model_name(cbsa_time_FE)
 13.     
.     clear
 14.     foreach ff in time_FE cbsa_time_FE {
 15.         append using ../temp/estimates_`ff'.dta
 16.     }
 17. 
.     save             "`outstub'/estimates_zori.dta", replace
 18.     export delimited "`outstub'/estimates_zori.csv", replace
 19. end

. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m1 to 2020m6, but with gaps
                delta:  1 month
(22,086 missing values generated)
(21,267 missing values generated)
(MWFE estimator converged in 1 iterations)
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =     22,984
Absorbing 1 HDFE group                            F(  19,     16) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.0589
                                                  Adj R-squared   =     0.0561
                                                  Within R-sq.    =     0.0021
Number of clusters (statefips) =         17       Root MSE        =     0.0115

                             (Std. Err. adjusted for 17 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    mw_wkp_F |
        F4D. |  -.0070418   .0146682    -0.48   0.638     -.038137    .0240533
        F3D. |  -.0017918    .012669    -0.14   0.889    -.0286489    .0250653
        F2D. |   .0105614   .0074447     1.42   0.175    -.0052207    .0263435
         FD. |   .0028647   .0066186     0.43   0.671    -.0111661    .0168956
         D1. |   .0227631   .0245848     0.93   0.368    -.0293544    .0748805
         LD. |   .0125728   .0118756     1.06   0.305    -.0126024     .037748
        L2D. |   .0196253   .0135633     1.45   0.167    -.0091277    .0483783
        L3D. |    .018657   .0137951     1.35   0.195    -.0105873    .0479012
        L4D. |   .0054285   .0071457     0.76   0.458    -.0097197    .0205767
             |
    mw_res_F |
         D1. |  -.0271798   .0136452    -1.99   0.064    -.0561064    .0017467
             |
ln_emp_biz~v |
         D1. |  -.0004738   .0014871    -0.32   0.754    -.0036264    .0026788
             |
 ln_emp_info |
         D1. |   .0015325   .0006269     2.44   0.026     .0002034    .0028616
             |
  ln_emp_fin |
         D1. |  -.0011924   .0027321    -0.44   0.668    -.0069843    .0045995
             |
ln_estcoun~v |
         D1. |  -.0020033   .0045408    -0.44   0.665    -.0116294    .0076227
             |
ln_estcoun~o |
         D1. |  -.0066057   .0023972    -2.76   0.014    -.0116876   -.0015238
             |
ln_estcoun~n |
         D1. |   .0078617   .0045232     1.74   0.101    -.0017271    .0174504
             |
ln_avgwwag~v |
         D1. |  -.0000457   .0009314    -0.05   0.962    -.0020202    .0019289
             |
ln_avgwwag~o |
         D1. |   .0015384   .0009574     1.61   0.128    -.0004913     .003568
             |
ln_avgwwag~n |
         D1. |   .0025444   .0018624     1.37   0.191    -.0014036    .0064924
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------+
 Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------+---------------------------------------|
  year_month |        49           0          49     |
-----------------------------------------------------+

 ( 1)  FD.mw_wkp_F = 0
 ( 2)  F2D.mw_wkp_F = 0
 ( 3)  F3D.mw_wkp_F = 0
 ( 4)  F4D.mw_wkp_F = 0

       F(  4,    16) =    1.31
            Prob > F =    0.3067
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(355,099 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(10 real changes made)
(1 real change made)
(note: file ../temp/estimates_time_FE.dta not found)
file ../temp/estimates_time_FE.dta saved

 ( 1)  D.mw_wkp_F + D.mw_res_F = 0

------------------------------------------------------------------------------
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0044168   .0125047    -0.35   0.729    -.0309256     .022092
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_F + LD.mw_wkp_F + D.mw_res_F = 0

------------------------------------------------------------------------------
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .008156   .0230151     0.35   0.728    -.0406337    .0569458
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_F + LD.mw_wkp_F + L2D.mw_wkp_F + D.mw_res_F = 0

------------------------------------------------------------------------------
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0277814   .0323622     0.86   0.403    -.0408234    .0963861
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_F + LD.mw_wkp_F + L2D.mw_wkp_F + L3D.mw_wkp_F + D.mw_res_F = 0

------------------------------------------------------------------------------
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0464383   .0429261     1.08   0.295     -.044561    .1374377
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_F + LD.mw_wkp_F + L2D.mw_wkp_F + L3D.mw_wkp_F + L4D.mw_wkp_F +
       D.mw_res_F = 0

------------------------------------------------------------------------------
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0518668    .045266     1.15   0.269    -.0440927    .1478264
------------------------------------------------------------------------------
number of observations will be reset to 6
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 6
(note: file ../temp/estimates_time_FE_sumsum_from0.dta not found)
file ../temp/estimates_time_FE_sumsum_from0.dta saved
(note: variable at was byte, now float to accommodate using data's values)
(note: variable var was str8, now str12 to accommodate using data's values)
file ../temp/estimates_time_FE.dta saved
(note: file ../temp/estimates_time_FE.csv not found)
file ../temp/estimates_time_FE.csv saved
(dropped 2191 singleton observations)
(MWFE estimator converged in 1 iterations)
warning: missing F statistic; dropped variables due to collinearity or too few 
> clusters

HDFE Linear regression                            Number of obs   =     20,793
Absorbing 1 HDFE group                            F(  19,     16) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.1850
                                                  Adj R-squared   =     0.0608
                                                  Within R-sq.    =     0.0030
Number of clusters (statefips) =         17       Root MSE        =     0.0114

                             (Std. Err. adjusted for 17 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    mw_wkp_F |
        F4D. |   -.011541   .0327795    -0.35   0.729    -.0810304    .0579484
        F3D. |  -.0062191   .0128397    -0.48   0.635    -.0334379    .0209998
        F2D. |  -.0064616   .0110447    -0.59   0.567    -.0298752    .0169521
         FD. |   .0037096   .0067612     0.55   0.591    -.0106235    .0180427
         D1. |    .074844   .0384462     1.95   0.069    -.0066583    .1563464
         LD. |    .043317   .0234808     1.84   0.084      -.00646    .0930941
        L2D. |   .0605491   .0195901     3.09   0.007     .0190201    .1020782
        L3D. |   .0231346   .0210972     1.10   0.289    -.0215894    .0678587
        L4D. |  -.0088239   .0108244    -0.82   0.427    -.0317707    .0141229
             |
    mw_res_F |
         D1. |   -.048591   .0290463    -1.67   0.114    -.1101664    .0129844
             |
ln_emp_biz~v |
         D1. |  -.0005056    .001734    -0.29   0.774    -.0041814    .0031703
             |
 ln_emp_info |
         D1. |     .00071   .0015341     0.46   0.650    -.0025421    .0039621
             |
  ln_emp_fin |
         D1. |  -.0019247   .0022837    -0.84   0.412    -.0067659    .0029164
             |
ln_estcoun~v |
         D1. |   .0040916   .0061727     0.66   0.517    -.0089941    .0171772
             |
ln_estcoun~o |
         D1. |  -.0051538   .0046068    -1.12   0.280    -.0149197    .0046121
             |
ln_estcoun~n |
         D1. |    .008352   .0060375     1.38   0.186    -.0044469    .0211509
             |
ln_avgwwag~v |
         D1. |  -.0019943   .0011013    -1.81   0.089     -.004329    .0003404
             |
ln_avgwwag~o |
         D1. |   .0020554   .0014893     1.38   0.187    -.0011017    .0052125
             |
ln_avgwwag~n |
         D1. |    .002846   .0031108     0.91   0.374    -.0037486    .0094406
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   cbsa_num#year_month |      2732           0        2732     |
---------------------------------------------------------------+

 ( 1)  FD.mw_wkp_F = 0
 ( 2)  F2D.mw_wkp_F = 0
 ( 3)  F3D.mw_wkp_F = 0
 ( 4)  F4D.mw_wkp_F = 0

       F(  4,    16) =    0.17
            Prob > F =    0.9529
file ../temp/estimates.dta saved
(355,099 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(10 real changes made)
(1 real change made)
(note: file ../temp/estimates_cbsa_time_FE.dta not found)
file ../temp/estimates_cbsa_time_FE.dta saved

 ( 1)  D.mw_wkp_F + D.mw_res_F = 0

------------------------------------------------------------------------------
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .026253   .0155592     1.69   0.111     -.006731     .059237
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_F + LD.mw_wkp_F + D.mw_res_F = 0

------------------------------------------------------------------------------
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |     .06957   .0359459     1.94   0.071    -.0066319     .145772
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_F + LD.mw_wkp_F + L2D.mw_wkp_F + D.mw_res_F = 0

------------------------------------------------------------------------------
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1301192   .0489748     2.66   0.017     .0262972    .2339412
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_F + LD.mw_wkp_F + L2D.mw_wkp_F + L3D.mw_wkp_F + D.mw_res_F = 0

------------------------------------------------------------------------------
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1532538   .0623028     2.46   0.026     .0211778    .2853299
------------------------------------------------------------------------------

 ( 1)  D.mw_wkp_F + LD.mw_wkp_F + L2D.mw_wkp_F + L3D.mw_wkp_F + L4D.mw_wkp_F +
       D.mw_res_F = 0

------------------------------------------------------------------------------
D.ln_zori_23 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1444299   .0604574     2.39   0.030      .016266    .2725939
------------------------------------------------------------------------------
number of observations will be reset to 6
Press any key to continue, or Break to abort
number of observations (_N) was 0, now 6
(note: file ../temp/estimates_cbsa_time_FE_sumsum_from0.dta not found)
file ../temp/estimates_cbsa_time_FE_sumsum_from0.dta saved
(note: variable at was byte, now float to accommodate using data's values)
(note: variable var was str8, now str12 to accommodate using data's values)
file ../temp/estimates_cbsa_time_FE.dta saved
(note: file ../temp/estimates_cbsa_time_FE.csv not found)
file ../temp/estimates_cbsa_time_FE.csv saved
(note: variable model was str7, now str12 to accommodate using data's values)
(note: file ../output/estimates_zori.dta not found)
file ../output/estimates_zori.dta saved
(note: file ../output/estimates_zori.csv not found)
file ../output/estimates_zori.csv saved

. 
end of do-file


Execute:  StataMP-64 /e do "./figures.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./figures.do 

. clear all

. set more off

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000


. set scheme s2color, permanently
(set scheme preference recorded)

. 
. program main
  1.     local instub "../output"
  2.     
.     use "`instub'/estimates_zori.dta", replace
  3.     make_bounds
  4.     
.     local y_label    "-0.1(0.02).14"
  5.     sum at
  6.     local w = r(max)
  7. 
.     offset_x_axis
  8. 
.     plot_dynamics_both, model(time_FE) dyn_var(mw_wkp_F)             ///
>         legend_dyn_var(Workplace MW (4th Lead)) y_label(`y_label')   ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce)                   ///
>         stat_var(mw_res_F) legend_stat_var(Residence MW (4th Lead))  ///
>         color_stat_var(maroon) symbol_stat_var(square)               ///
>         x_label(-`w'(1)`w') name(time_FE)
  9.     
.     plot_dynamics_both, model(cbsa_time_FE) dyn_var(mw_wkp_F)        ///
>         legend_dyn_var(Workplace MW (4th Lead)) y_label(`y_label')   ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce)                   ///
>         stat_var(mw_res_F) legend_stat_var(Residence MW (4th Lead))  ///
>         color_stat_var(maroon) symbol_stat_var(square)               ///
>         x_label(-`w'(1)`w') name(cbsa_time_FE)
 10.     
. end

. 
. 
. main

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          at |         32       .5625    2.354645         -4          4
(16 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/time_FE_png.png not found)
(file ../output/time_FE_png.png written in PNG format)
(note: file ../output/time_FE.eps not found)
(file ../output/time_FE.eps written in EPS format)
(16 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style grey not found in class color, default attributes used)
(note: file ../output/cbsa_time_FE_png.png not found)
(file ../output/cbsa_time_FE_png.png written in PNG format)
(note: file ../output/cbsa_time_FE.eps not found)
(file ../output/cbsa_time_FE.eps written in EPS format)

. 
end of do-file

 make.py ended: 2023-08-01 11:26:05
