
 make.py started: 2022-03-07 12:27:03 C:\Users\diegog\Desktop\Diego\min_wage_rent\derived\cbsa_month\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local instub  "../../../drive/derived_large/zipcode_month"
  2.     local outstub "../../../drive/derived_large/cbsa_month"
  3.     local logfile "../output/data_file_manifest.log"
  4. 
.     load_data, instub(`instub')
  5. 
.     collapse (count) n_zipcodes             = zipcode_num     ///
>              (sum)   n_zipcodes_with_change = mw_change       ///
>              (max)   change_within_cbsa     = mw_change       ///
>                      max_statutory_mw       = statutory_mw    ///
>                      max_d_mw_res           = d_mw_res        ///
>                      max_d_mw_wkp_tot_17    = mw_wkp_tot_17   ///
>              (mean)  avg_statutory_mw       = statutory_mw    ///
>                      avg_d_mw_res           = d_mw_res        ///
>                      avg_d_mw_wkp_tot_17    = mw_wkp_tot_17,  ///
>             by(cbsa year_month year)
  6. 
.     gen all_zip_changed = (n_zipcodes == n_zipcodes_with_change)
  7.     
.     save_data "`outstub'/cbsa_month.dta", ///
>         key(cbsa year_month) log(`logfile') replace             
  8. 
.     make_cbsa_event_data
  9. 
.     save_data "`outstub'/events.dta", ///
>         key(cbsa event_year_month) log(`logfile') replace
 10. end

. 
. program load_data
  1.     syntax, instub(str)
  2. 
.     use zipcode year_month year statefips cbsa                   ///
>         medrentpricepsqft_SFCC mw_res mw_wkp_tot_17 statutory_mw  ///
>         using  "`instub'/zipcode_month_panel.dta", clear
  3.         keep if cbsa != "99999"
  4.         destring zipcode, gen(zipcode_num)
  5.         
.     xtset zipcode_num year_month
  6. 
.     gen d_mw_res        = D.mw_res
  7.     gen d_mw_wkp_tot_17 = D.mw_wkp_tot_17
  8. 
.     gen mw_change = (statutory_mw > L.statutory_mw)
  9.     
.     drop if missing(medrentpricepsqft_SFCC)
 10. end

. 
. program make_cbsa_event_data
  1. 
.     keep if change_within_cbsa == 1
  2. 
.     rename year_month event_year_month
  3.     format event_year_month %tm
  4.     rename year event_year
  5. 
.     bys cbsa (event_year_month): gen mw_change_id = sum(change_within_cbsa)
  6.     egen event_id = group(mw_change_id cbsa)
  7. 
.     bys cbsa (event_year_month): ///
>         gen time_since_treated = event_year_month[_n] - event_year_month[_n -
>  1]
  8. 
.     keep cbsa event_id event_year event_year_month ///
>             all_zip_changed time_since_treated
  9. end

. 
. 
. main
(1,060,577 observations deleted)
zipcode: all characters numeric; zipcode_num generated as long
       panel variable:  zipcode_num (strongly balanced)
        time variable:  year_month, 2009m7 to 2020m1
                delta:  1 month
(49,989 missing values generated)
(45,075 missing values generated)
(2,774,452 observations deleted)
(data already sorted by cbsa year_month)
  variable n_zipcodes was long now int
  variable change_within_cbsa was float now byte
  variable all_zip_changed was float now byte
  variable n_zipcodes_with_change was double now int
  (247,086 bytes saved)
===============================================================================
File: ../../../drive/derived_large/cbsa_month/cbsa_month.dta
Key: cbsa year_month
===============================================================================
  17649:13(68544):3559625288:3607159608

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        cbsa |          0
  year_month |     17,649     677.642    30.31125        601        719
        year |     17,649    2016.001    2.517651       2010       2019
  n_zipcodes |     17,649    11.20341    21.37456          1        168
n_zipcodes~e |     17,649    .4508471    4.845328          0        151
-------------+---------------------------------------------------------
change_wit~a |     17,649    .0347328    .1831076          0          1
max_statut~w |     17,649    8.202596    1.412924       7.25         16
max_d_mw_res |     17,649    .0017643    .0127226   -.331534   .2412502
max_d_mw_~17 |     17,649    2.084906    .1539488   1.538087   2.688884
avg_statut~w |     17,649    8.140498    1.283557       7.25   14.56095
-------------+---------------------------------------------------------
avg_d_mw_res |     17,649    .0014485    .0107068   -.331534    .216913
avg_d_mw_~17 |     17,649    2.078051    .1504938   1.434199   2.635716
all_zip_ch~d |     17,649    .0289535    .1676806          0          1




(note: file ../../../drive/derived_large/cbsa_month/cbsa_month.dta not found)
file ../../../drive/derived_large/cbsa_month/cbsa_month.dta saved
(17,036 observations deleted)
(134 missing values generated)
(data already sorted by cbsa event_year_month)
  variable all_zip_changed was float now byte
  variable event_id was float now int
  variable time_since_treated was float now byte
  (4,904 bytes saved)
===============================================================================
File: ../../../drive/derived_large/cbsa_month/events.dta
Key: cbsa event_year_month
===============================================================================
  613:6(82944):4086739589:1459825664

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        cbsa |          0
event_year~h |        613    677.9038     27.6151        612        719
  event_year |        613    2016.364    2.294451       2011       2019
all_zip_ch~d |        613    .8336052    .3727388          0          1
    event_id |        613         307    177.1021          1        613
-------------+---------------------------------------------------------
time_since~d |        479    11.96242    4.662977          1         24




(note: file ../../../drive/derived_large/cbsa_month/events.dta not found)
file ../../../drive/derived_large/cbsa_month/events.dta saved

. 
end of do-file

 make.py ended: 2022-03-07 12:28:33
