
 make.py started: 2022-03-04 08:28:35 C:\Users\shermo\Documents\GitHub\min_wage_rent\derived\cbsa_month\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. 
. program main
  1.     local instub  "../../../drive/derived_large/estimation_samples"
  2.     local outstub "../../../drive/derived_large/cbsa_month"
  3.     local logfile "../output/data_file_manifest.log"
  4. 
.     load_data, instub(`instub')
  5. 
.     collapse (count) n_zipcodes             = zipcode_num     ///
>              (sum)   n_zipcodes_with_change = mw_change       ///
>              (max)   change_within_cbsa     = mw_change       ///
>                      max_statutory_mw       = statutory_mw    ///
>                      max_d_mw_res           = d_mw_res        ///
>                      max_d_mw_wkp_tot_17    = mw_wkp_tot_17   ///
>              (mean)  avg_statutory_mw       = statutory_mw    ///
>                      avg_d_mw_res           = d_mw_res        ///
>                      avg_d_mw_wkp_tot_17    = mw_wkp_tot_17,  ///
>             by(cbsa year year_month)
  6. 
.     gen all_zip_changed = (n_zipcodes == n_zipcodes_with_change)
  7.     
.     save_data "`outstub'/cbsa_month.dta", ///
>         key(cbsa year_month) log(`logfile') replace             
  8. 
.     make_cbsa_event_data
  9. 
.     save_data "`outstub'/events.dta", ///
>         key(cbsa event_year_month) log(`logfile') replace
 10. end

. 
. program load_data
  1.     syntax, instub(str)
  2. 
.     clear
  3.     use zipcode zipcode_num year_month year statefips cbsa                
>    ///
>           medrentpricepsqft_SFCC ln_rents mw_res mw_wkp_tot_17 statutory_mw  
> ///
>         if cbsa != "99999"                                                   
> ///
>         using  "`instub'/zipcode_months.dta"
  4. 
.     xtset zipcode_num year_month
  5. 
.     gen d_mw_res        = D.mw_res
  6.     gen d_mw_wkp_tot_17 = D.mw_wkp_tot_17
  7. 
.     gen mw_change = (statutory_mw > L.statutory_mw)
  8.     
.     drop if missing(medrentpricepsqft_SFCC)
  9. end

. 
. program make_cbsa_event_data
  1. 
.     keep if change_within_cbsa == 1
  2. 
.     rename year_month event_year_month
  3.     rename year       event_year
  4. 
.     format event_year_month %tm
  5. 
.     bys cbsa (event_year_month): gen mw_change_id = sum(change_within_cbsa)
  6.     egen event_id = group(mw_change_id cbsa)
  7. 
.     bys cbsa (event_year_month): ///
>         gen time_since_treated = event_year_month[_n] - event_year_month[_n -
>  1]
  8. 
.     keep cbsa event_id event_year event_year_month all_zip_changed time_since
> _treated
  9. end

. 
. 
. main
       panel variable:  zipcode_num (unbalanced)
        time variable:  year_month, 2010m2 to 2019m12
                delta:  1 month
(3,309 missing values generated)
(3,309 missing values generated)
(0 observations deleted)
(data now sorted by cbsa year_month)
  variable n_zipcodes was long now int
  variable change_within_cbsa was float now byte
  variable all_zip_changed was float now byte
  variable n_zipcodes_with_change was double now int
  (247,086 bytes saved)
===============================================================================
File: ../../../drive/derived_large/cbsa_month/cbsa_month.dta
Key: cbsa year_month
===============================================================================
  17649:13(68544):3867686679:1490211482

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        cbsa |          0
  year_month |     17,649     677.642    30.31125        601        719
        year |     17,649    2016.001    2.517651       2010       2019
  n_zipcodes |     17,649    11.20341    21.37456          1        168
n_zipcodes~e |     17,649    .4278996     4.70105          0        151
-------------+---------------------------------------------------------
change_wit~a |     17,649    .0337696    .1806407          0          1
max_statut~w |     17,649    8.202596    1.412924       7.25         16
max_d_mw_res |     17,373    .0017536    .0127182   -.331534   .2412502
max_d_mw_~17 |     17,649    2.084906    .1539488   1.538087   2.688884
avg_statut~w |     17,649    8.140498    1.283557       7.25   14.56095
-------------+---------------------------------------------------------
avg_d_mw_res |     17,373    .0014354    .0106819   -.331534    .216913
avg_d_mw_~17 |     17,649    2.078051    .1504938   1.434199   2.635716
all_zip_ch~d |     17,649    .0234008    .1511769          0          1




(note: file ../../../drive/derived_large/cbsa_month/cbsa_month.dta not found)
file ../../../drive/derived_large/cbsa_month/cbsa_month.dta saved
(17,053 observations deleted)
(132 missing values generated)
(data already sorted by cbsa event_year_month)
  variable all_zip_changed was float now byte
  variable event_id was float now int
  variable time_since_treated was float now byte
  (4,768 bytes saved)
===============================================================================
File: ../../../drive/derived_large/cbsa_month/events.dta
Key: cbsa event_year_month
===============================================================================
  596:6(82944):1915360675:2775975641

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        cbsa |          0
event_year~h |        596    678.1443    27.58941        612        719
  event_year |        596    2016.381    2.291578       2011       2019
all_zip_ch~d |        596     .692953    .4616565          0          1
    event_id |        596       298.5    172.1947          1        596
-------------+---------------------------------------------------------
time_since~d |        464    11.93319    4.657359          1         24




(note: file ../../../drive/derived_large/cbsa_month/events.dta not found)
file ../../../drive/derived_large/cbsa_month/events.dta saved

. 
end of do-file

 make.py ended: 2022-03-04 08:28:39
