
 make.py started: 2022-05-11 13:18:05 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\estimate_s\code 




Execute:  StataMP-64 /e do "./estimate.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.


running c:\ado\personal\profile.do ...

. do ./estimate.do 

. clear all

. set more off

. set maxvar 32000


. 
. program main
  1.     local in_zipcode    "../../../drive/derived_large/zipcode"
  2.     local instub_irs       "../../../drive/base_large/irs_soi"
  3.     local instub_safmr     "../../../base/safmr/output"
  4.     
.     clean_irs, instub(`instub_irs')
  5.     save_data "../temp/irs_2014_clean.dta",  log(none)      ///
>         key(zipcode) replace
  6.     
.     clean_safmr, instub(`instub_safmr')
  7.     save_data "../temp/safmr_2014_clean.dta",     log(none)      ///
>         key(zipcode) replace 
  8.         
.     use zipcode population_cens2010 urb_pop_cens2010 sh_hhlds_renteroccup_cen
> s2010 ///
>         n_hhlds_cens2010 n_hhlds_urban_cens2010 population_acs2014 ///
>         using "`in_zipcode'/zipcode_cross.dta", clear
  9.     merge 1:1 zipcode using "../temp/irs_2014_clean.dta", ///
>         nogen keep(1 3)
 10.     merge 1:1 zipcode using "../temp/safmr_2014_clean.dta", ///
>         nogen keep(1 3)
 11.     gen s = safmr2br/(wage_per_wage_hhld/12)
 12. 
.     keep zipcode s
 13.     save_data "../output/s_by_zip.dta", key(zipcode) replace
 14. end

. 
. program clean_irs 
  1.     syntax, instub(str)
  2.     
.     use "`instub'/irs_zip.dta", clear
  3. 
.     drop if inlist(zipcode, "0", "00000", "99999")    
  4.     keep if year == 2014
  5.     
.     keep zipcode statefips share_wage_hhlds share_bussiness_hhlds /// 
>          share_farmer_hhlds agi_per_hhld wage_per_wage_hhld       ///
>          wage_per_hhld bussines_rev_per_owner
  6. end

. 
. program clean_safmr 
  1.     syntax, instub(str)
  2.     
.     use "`instub'/safmr_2012_2016_by_zipcode_county_cbsa.dta", clear
  3.     keep zipcode countyfips cbsa year safmr1br safmr2br safmr3br
  4.     keep if year == 2014
  5.     drop year
  6.     collapse (mean) safmr*, by(zipcode)
  7. end

. 
. 
. 
. main
(1,020 observations deleted)
(279,151 observations deleted)
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../temp/irs_2014_clean.dta
Key: zipcode
===============================================================================
  27679:9(21818):2570474605:3696125402

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
   statefips |          0
agi_per_hhld |     27,679    60362.86    46953.68   10026.67    2441296
wage_per_w~d |     27,679    48644.99    26145.38   9513.333   854060.8
wage_per_h~d |     27,679    39706.83    20069.26   7506.667   539549.5
-------------+---------------------------------------------------------
bussines_r~r |     26,380    10904.39    8219.813      -7305     195960
share_wage~s |     27,679    .8196309    .0648014   .2058824          1
share_buss~s |     27,679    .1516093    .0556574          0   .6470588
share_farm~s |     27,679    .0480508    .0754136          0         .7




(note: file ../temp/irs_2014_clean.dta not found)
file ../temp/irs_2014_clean.dta saved
(97,588 observations deleted)
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../temp/safmr_2014_clean.dta
Key: zipcode
===============================================================================
  21808:4(88405):2616875449:1767566053

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
    safmr1br |     21,808    748.5081    260.5008        310       1860
    safmr2br |     21,808    934.0743    314.6265        370       2320
    safmr3br |     21,808    1254.305    425.5054        510       3420




(note: file ../temp/safmr_2014_clean.dta not found)
file ../temp/safmr_2014_clean.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,170
        from master                     4,170  
        from using                          0  

    matched                            27,656  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        13,678
        from master                    13,678  
        from using                          0  

    matched                            18,148  
    -----------------------------------------
(14,888 missing values generated)
(data already sorted by zipcode)
  (0 bytes saved)
===============================================================================
File: ../output/s_by_zip.dta
Key: zipcode
===============================================================================
  31826:2(75225):1913908831:764873303

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
           s |     16,938    .2265644    .0760504   .0212001   .9964962




(note: file ../output/s_by_zip.dta not found)
file ../output/s_by_zip.dta saved

. 
end of do-file

 make.py ended: 2022-05-11 13:18:10
