
 make.py started: 2021-09-30 14:49:54 C:\Users\diegog\Desktop\Diego\min_wage_rent\derived\zipcode_year\code 




Execute:  StataMP-64 /e do "./build.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build.do 

. set more off

. clear all

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. 
. program main
  1.     local in_derived_large "../../../drive/derived_large"
  2.     local in_base_large    "../../../drive/base_large"
  3.     local outstub          "../../../drive/derived_large/zipcode_year"
  4.     local logfile          "../output/data_file_manifest.log"
  5. 
.         define_controls
  6.         local controls "`r(economic_controls)'"
  7.     clean_irs_data, instub(`in_derived_large') controls(`controls')
  8.         
.         get_lodes_shares, instub(`in_base_large')
  9.         
.         use "../temp/workplace_shares.dta" , clear
 10.         merge 1:1 zipcode year using "../temp/residence_shares.dta", nogen
 11.     merge 1:1 zipcode year using "../temp/irs_data.dta", nogen
 12. 
.     save_data "`outstub'/zipcode_year.dta", key(zipcode year) ///
>             log(`logfile') replace
 13. end

. 
. program clean_irs_data
  1.     syntax, instub(str) controls(str)
  2.         
.         use zipcode statefips countyfips cbsa10 year month zcta ln_mw actual_
> mw ///
>             exp_ln_mw ln_med_rent_var acs_pop `controls' using  ///
>                 "`instub'/estimation_samples/all_zipcode_months.dta", clear
  3.         bysort zipcode year: keep if _n == 1
  4.         drop month
  5.     merge 1:1 zipcode statefips year ///
>             using  "../../../base/irs_soi/output/irs_zip.dta", nogen keep(1 3
> )
  6.         
.         gen ln_agi_per_cap            = log(agi_per_cap)
  7.         gen ln_wage_per_cap           = log(wage_per_cap)
  8.         gen ln_wage_per_wage_hhld     = log(wage_per_wage_hhld)
  9.         gen ln_bussines_rev_per_owner = log(bussines_rev_per_owner)
 10.         
.         save "../temp/irs_data.dta", replace
 11. end

. 
. program get_lodes_shares
  1.     syntax, instub(str)
  2. 
.     use "`instub'/lodes_zipcodes/jobs.dta", clear
  3.         preserve
  4.             keep if jobs_by == "residence"
  5.                 
.                 keep zipcode year share_age_* share_earn_* share_naics_* shar
> e_sch_*
  6.             rename share_age_* res_*
  7.             rename share_earn_* res_*
  8.             rename share_naics_* res_*
  9.             rename share_sch_* res_*
 10.                 
.             save "../temp/residence_shares.dta", replace
 11.         restore
 12.         
.         preserve
 13.             keep if jobs_by == "workplace"
 14.                 
.                 keep zipcode year share_age_* share_earn_* share_naics_* shar
> e_sch_*
 15.             rename share_age_* wrkpl_*
 16.             rename share_earn_* wrkpl_*
 17.             rename share_naics_* wrkpl_*
 18.             rename share_sch_* wrkpl_*
 19.                 
.             save "../temp/workplace_shares.dta", replace
 20.         restore
 21. end

. 
. main
(4,453,680 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                       159,612
        from master                   159,612  
        from using                          0  

    matched                           245,268  
    -----------------------------------------
(159,612 missing values generated)
(159,614 missing values generated)
(159,614 missing values generated)
(171,070 missing values generated)
(note: file ../temp/irs_data.dta not found)
file ../temp/irs_data.dta saved
(388,171 observations deleted)
(note: file ../temp/residence_shares.dta not found)
file ../temp/residence_shares.dta saved
(388,172 observations deleted)
(note: file ../temp/workplace_shares.dta not found)
file ../temp/workplace_shares.dta saved

    Result                           # of obs.
    -----------------------------------------
    not matched                         4,133
        from master                     2,066  
        from using                      2,067  

    matched                           386,105  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        99,314
        from master                    42,336  
        from using                     56,978  

    matched                           347,902  
    -----------------------------------------
(data now sorted by zipcode year)
  variable year was long now int
  (894,432 bytes saved)
===============================================================================
File: ../../../drive/derived_large/zipcode_year/zipcode_year.dta
Key: zipcode year
===============================================================================
  447216:74(49398):2212191099:1968583645

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |          0
        year |    447,216    2014.016     3.15055       2009       2019
wrkpl_und~29 |    344,917    .2206504    .0523743          0          1
wrkpl_30to54 |    344,917    .5422413    .0467914          0          1
wrkpl_abo~55 |    344,917    .2371082    .0490956          0          1
-------------+---------------------------------------------------------
wrkpl_u~1250 |    344,917    .2808454    .0874182          0          1
wrkpl_1~3333 |    344,917    .3795673      .08205          0          1
wrkpl_a~3333 |    344,917    .3395873    .1264011          0          1
wrkpl_unde~S |    344,917    .0971594    .0385835          0   .5307692
wrkpl_HS_n~l |    344,917    .2474644    .0529582          0          1
-------------+---------------------------------------------------------
wrkpl_some~l |    344,917    .2515892    .0301841          0          1
wrkpl_Coll~e |    344,917    .1831365     .059672          0          1
 wrkpl_manuf |    344,917    .1070548     .131987          0          1
wrkpl_retail |    344,917     .111139    .0788891          0          1
wrkpl_fina~e |    344,917    .0283058    .0392195          0          1
-------------+---------------------------------------------------------
wrkpl_acco~d |    344,917    .0847469    .0800489          0          1
 res_under29 |    344,624    .2252939    .0365974          0        .75
  res_30to54 |    344,624    .5443693    .0378129          0          1
 res_above55 |    344,624    .2303368    .0448296          0   .6666667
res_und~1250 |    344,624     .260322    .0484557          0          1
-------------+---------------------------------------------------------
res_125~3333 |    344,624    .3691655    .0743584          0          1
res_abo~3333 |    344,624    .3705125     .107387          0   .8846357
 res_underHS |    344,624    .0889716    .0341339          0   .4779973
res_HS_noC~l |    344,624    .2325713    .0434347          0         .6
res_someColl |    344,624    .2534716    .0242805          0          1
-------------+---------------------------------------------------------
 res_College |    344,624    .1996916    .0617274          0         .6
   res_manuf |    344,624    .1056402    .0633836          0   .5715689
  res_retail |    344,624    .1168999    .0218667          0       .375
 res_finance |    344,624    .0365465    .0187062          0   .3274606
res_accomm~d |    344,624    .0868732    .0333893          0   .6644487
-------------+---------------------------------------------------------
  countyfips |          0
      cbsa10 |          0
        zcta |          0
   statefips |          0
   actual_mw |    404,880    7.911584    1.097897       7.25      16.09
-------------+---------------------------------------------------------
   exp_ln_mw |    346,030    2.060865    .1187238   1.981001   2.695033
     acs_pop |    387,561    8108.076    13091.88          0   117602.2
ln_med_ren~r |     15,263    .1098755    .4689393  -2.137656   3.075775
       ln_mw |    404,880    2.060164     .122867   1.981001   2.778198
ln_emp_biz~v |    396,618    8.087138    2.545404   .6931472   13.34476
-------------+---------------------------------------------------------
 ln_emp_info |    367,775     6.43873    2.295629          0   12.30969
  ln_emp_fin |    397,600    7.445727    2.249355   1.098612   12.85575
ln_estcoun~v |    404,559    5.916558    2.195243          0   10.90575
ln_estcoun~o |    401,130    3.659253    1.955471          0   9.445492
ln_estcoun~n |    404,569    5.475535    1.996077          0   10.29272
-------------+---------------------------------------------------------
ln_avgwwag~v |    396,618    6.781681    .4205874   4.867535   10.20196
ln_avgwwag~o |    367,775    6.903264     .481072   4.634729    9.33662
ln_avgwwag~n |    397,600     6.96031    .4592628   5.099866   9.163982
num_hhlds_~s |    245,268    5083.394    6756.117    65.0005      54510
     pop_irs |    245,268    9973.123    13388.05         50     135791
-------------+---------------------------------------------------------
     num_dep |    245,268    3310.949     4872.91          0      76663
adj_gross_~c |    245,268    339625.4    589842.3        886   1.43e+07
num_wage_h~s |    245,268    4247.358    5717.366          0      47770
  total_wage |    245,268    234000.1    375270.6          0    6397154
 num_ret_int |    245,268    1588.707    2264.661          0      40967
-------------+---------------------------------------------------------
   total_int |    245,268    3265.045    12390.28          0     771404
 num_ret_div |    245,268      946.08    1514.871          0      19780
   total_div |    245,268    7499.055    30268.35          0    3301775
num_bus_hh~s |    245,268    822.9968    1215.169          0      17580
     tot_bus |    245,268    11164.45    21016.35     -52896     519010
-------------+---------------------------------------------------------
num_farm_h~s |    245,268    58.07399    82.60997          0       1427
agi_per_hhld |    245,268    30.61708    26.21655   4.853348   2526.183
 agi_per_cap |    245,268    59.40863    45.93926   5.001689   3886.435
wage_per_w~d |    245,266    48.61534    26.06479        6.8   1006.877
wage_per_h~d |    245,268     39.6606    19.98499          0   645.2743
-------------+---------------------------------------------------------
wage_per_cap |    245,268    20.27891    10.89516          0    375.538
bussines_r~r |    235,353     10.8905    8.302307  -49.59998   515.2208
share_wage~s |    245,268    .8195314    .0634088          0   1.007092
share_buss~s |    245,268    .1533955    .0551976          0   .7058824
share_farm~s |    245,268    .0479315    .0749194          0   .7857143
-------------+---------------------------------------------------------
ln_agi_per~p |    245,268    3.975177     .405087   1.609776   8.265247
ln_wage_pe~p |    245,266    2.923852    .3819363   .5477813    5.92836
ln_wage_pe~d |    245,266    3.806917    .3546019   1.916923   6.914609
ln_bussine~r |    233,810    2.194412    .6668872  -13.18063   6.244596




file ../../../drive/derived_large/zipcode_year/zipcode_year.dta saved

. 
end of do-file

 make.py ended: 2021-09-30 14:51:09
