
 make.py started: 2021-11-29 14:09:46 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_stacked\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/stacked_sample"
  2.         local logfile "../output/data_file_manifest.log"
  3. 
.         local cluster "cbsa10"
  4.         
.         use "`instub'/stacked_sample_window6.dta", clear
  5.         *describe d_ln_emp_* d_ln_estcount_* d_ln_avgwwage_*, varlist
.         *local controls = r(varlist)
.         
.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_static_w6) outfolder("../temp")
  6.                 
.     estimate_dyn_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_dyn_w6) outfolder("../temp")
  7.                 
.         use "`instub'/stacked_sample_window3.dta", clear
  8.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_static_w3) outfolder("../temp")
  9.                 
.     estimate_dyn_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") w(3) ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_dyn_w3) outfolder("../temp")
 10.                 
.         use "`instub'/stacked_sample_window9.dta", clear
 11.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_static_w9) outfolder("../temp")
 12.                 
.     estimate_dyn_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") w(9) ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_dyn_w9) outfolder("../temp")
 13.                 
.         use ../temp/estimates_stacked_static_w6.dta, clear
 14.         foreach ff in stacked_static_w3 stacked_static_w9 {
 15.                 append using ../temp/estimates_`ff'.dta
 16.         }
 17.         save_data "../output/estimates_stacked_static.dta", ///
>             key(model var at) log(`logfile') replace
 18.         export delimited "../output/estimates_stacked_static.csv", replace
 19.         
.         use ../temp/estimates_stacked_dyn_w6.dta, clear
 20.         foreach ff in stacked_dyn_w3 stacked_dyn_w9 {
 21.                 append using ../temp/estimates_`ff'.dta
 22.         }
 23.         save_data "../output/estimates_stacked_dyn.dta", ///
>             key(model var at) log(`logfile') replace
 24.         export delimited "../output/estimates_stacked_dyn.csv", replace
 25. end

. 
. main
(dropped 2008 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    106,345
Absorbing 1 HDFE group                            F(   2,     27) =       1.90
Statistics robust to heteroskedasticity           Prob > F        =     0.1686
                                                  R-squared       =     0.0847
                                                  Adj R-squared   =     0.0380
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         28       Root MSE        =     0.0325

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0266966   .0155773    -1.71   0.098    -.0586585    .0052654
 d_exp_ln_mw |   .0735756   .0385937     1.91   0.067     -.005612    .1527633
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      5159           0        5159     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    3.80
            Prob > F =    0.0616
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(108,600 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w6.dta not found)
file ../temp/estimates_stacked_static_w6.dta saved
(note: file ../temp/estimates_stacked_static_w6.csv not found)
file ../temp/estimates_stacked_static_w6.csv saved
(dropped 1873 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    100,157
Absorbing 1 HDFE group                            F(  14,     27) =      43.09
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0868
                                                  Adj R-squared   =     0.0394
                                                  Within R-sq.    =     0.0003
Number of clusters (statefips) =         28       Root MSE        =     0.0321

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
F6_d_exp_l~w |   .0008694   .0229064     0.04   0.970    -.0461307    .0478694
F5_d_exp_l~w |   .0416334   .0221006     1.88   0.070    -.0037132    .0869801
F4_d_exp_l~w |  -.0401971   .0202094    -1.99   0.057    -.0816635    .0012692
F3_d_exp_l~w |  -.0139594   .0259523    -0.54   0.595    -.0672091    .0392904
F2_d_exp_l~w |   .0035798   .0430901     0.08   0.934    -.0848338    .0919934
F1_d_exp_l~w |  -.0076453   .0316692    -0.24   0.811    -.0726251    .0573345
 d_exp_ln_mw |   .0956723   .0511222     1.87   0.072    -.0092219    .2005665
L1_d_exp_l~w |  -.0246571   .0490524    -0.50   0.619    -.1253043    .0759902
L2_d_exp_l~w |  -.0215499   .0277753    -0.78   0.445    -.0785401    .0354402
L3_d_exp_l~w |   .0094474   .0249433     0.38   0.708    -.0417321    .0606268
L4_d_exp_l~w |   .0107435    .042052     0.26   0.800    -.0755402    .0970271
L5_d_exp_l~w |  -.0068275   .0245214    -0.28   0.783    -.0571413    .0434862
L6_d_exp_l~w |  -.0002263   .0221095    -0.01   0.992    -.0455911    .0451386
     d_ln_mw |  -.0475221   .0197837    -2.40   0.023    -.0881149   -.0069294
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      4922           0        4922     |
---------------------------------------------------------------+

 ( 1)  - d_exp_ln_mw + d_ln_mw = 0

       F(  1,    27) =    4.36
            Prob > F =    0.0464

 ( 1)  F1_d_exp_ln_mw = 0
 ( 2)  F2_d_exp_ln_mw = 0
 ( 3)  F3_d_exp_ln_mw = 0
 ( 4)  F4_d_exp_ln_mw = 0
 ( 5)  F5_d_exp_ln_mw = 0
 ( 6)  F6_d_exp_ln_mw = 0

       F(  6,    27) =    4.82
            Prob > F =    0.0018
file ../temp/estimates.dta saved
(108,588 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(14 real changes made)
(1 real change made)
(note: file ../temp/estimates_stacked_dyn_w6.dta not found)
file ../temp/estimates_stacked_dyn_w6.dta saved
(note: file ../temp/estimates_stacked_dyn_w6.csv not found)
file ../temp/estimates_stacked_dyn_w6.csv saved
(dropped 1085 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     65,222
Absorbing 1 HDFE group                            F(   2,     27) =       1.27
Statistics robust to heteroskedasticity           Prob > F        =     0.2972
                                                  R-squared       =     0.0838
                                                  Adj R-squared   =     0.0395
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         28       Root MSE        =     0.0333

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0420677    .026539    -1.59   0.125    -.0965213    .0123858
 d_exp_ln_mw |   .0767107   .0584883     1.31   0.201    -.0432975    .1967188
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      3008           0        3008     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    2.06
            Prob > F =    0.1626
file ../temp/estimates.dta saved
(66,400 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w3.dta not found)
file ../temp/estimates_stacked_static_w3.dta saved
(note: file ../temp/estimates_stacked_static_w3.csv not found)
file ../temp/estimates_stacked_static_w3.csv saved
(dropped 1081 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     63,145
Absorbing 1 HDFE group                            F(   8,     27) =       4.33
Statistics robust to heteroskedasticity           Prob > F        =     0.0019
                                                  R-squared       =     0.0856
                                                  Adj R-squared   =     0.0407
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         28       Root MSE        =     0.0330

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
F3_d_exp_l~w |  -.0253041   .0254265    -1.00   0.328    -.0774749    .0268668
F2_d_exp_l~w |   .0153868   .0265291     0.58   0.567    -.0390465    .0698201
F1_d_exp_l~w |  -.0233801   .0182713    -1.28   0.212    -.0608697    .0141096
 d_exp_ln_mw |   .0824118   .0547093     1.51   0.144    -.0298424    .1946659
L1_d_exp_l~w |   -.035828   .0351282    -1.02   0.317     -.107905    .0362491
L2_d_exp_l~w |   .0264966   .0174796     1.52   0.141    -.0093685    .0623618
L3_d_exp_l~w |  -.0147225   .0266434    -0.55   0.585    -.0693903    .0399452
     d_ln_mw |  -.0430654   .0256684    -1.68   0.105    -.0957328    .0096019
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      2946           0        2946     |
---------------------------------------------------------------+

 ( 1)  - d_exp_ln_mw + d_ln_mw = 0

       F(  1,    27) =    2.59
            Prob > F =    0.1190

 ( 1)  F1_d_exp_ln_mw = 0
 ( 2)  F2_d_exp_ln_mw = 0
 ( 3)  F3_d_exp_ln_mw = 0

       F(  3,    27) =    0.55
            Prob > F =    0.6546
file ../temp/estimates.dta saved
(66,394 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(8 real changes made)
(1 real change made)
(note: file ../temp/estimates_stacked_dyn_w3.dta not found)
file ../temp/estimates_stacked_dyn_w3.dta saved
(note: file ../temp/estimates_stacked_dyn_w3.csv not found)
file ../temp/estimates_stacked_dyn_w3.csv saved
(dropped 2698 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    146,569
Absorbing 1 HDFE group                            F(   2,     27) =       1.28
Statistics robust to heteroskedasticity           Prob > F        =     0.2937
                                                  R-squared       =     0.0858
                                                  Adj R-squared   =     0.0382
                                                  Within R-sq.    =     0.0000
Number of clusters (statefips) =         28       Root MSE        =     0.0322

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0211776   .0165097    -1.28   0.210    -.0550527    .0126975
 d_exp_ln_mw |   .0648585   .0406153     1.60   0.122    -.0184773    .1481943
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      7254           0        7254     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    2.42
            Prob > F =    0.1312
file ../temp/estimates.dta saved
(149,376 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w9.dta not found)
file ../temp/estimates_stacked_static_w9.dta saved
(note: file ../temp/estimates_stacked_static_w9.csv not found)
file ../temp/estimates_stacked_static_w9.csv saved
(dropped 2402 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    124,761
Absorbing 1 HDFE group                            F(  20,     27) =   12352.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0888
                                                  Adj R-squared   =     0.0403
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         28       Root MSE        =     0.0312

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
F9_d_exp_l~w |   .0277182   .0259897     1.07   0.296    -.0256082    .0810445
F8_d_exp_l~w |   .0011359   .0275648     0.04   0.967    -.0554224    .0576941
F7_d_exp_l~w |  -.0374657   .0401754    -0.93   0.359    -.1198988    .0449674
F6_d_exp_l~w |   .0035153   .0228387     0.15   0.879    -.0433458    .0503765
F5_d_exp_l~w |   .0973546   .0283313     3.44   0.002     .0392236    .1554855
F4_d_exp_l~w |  -.0652484    .026426    -2.47   0.020    -.1194701   -.0110268
F3_d_exp_l~w |  -.0167485   .0455198    -0.37   0.716    -.1101475    .0766504
F2_d_exp_l~w |   .0404344   .0502293     0.80   0.428    -.0626275    .1434964
F1_d_exp_l~w |  -.0110536   .0368305    -0.30   0.766    -.0866236    .0645164
 d_exp_ln_mw |   .0728769   .0583005     1.25   0.222    -.0467459    .1924997
L1_d_exp_l~w |  -.0137284   .0394082    -0.35   0.730    -.0945874    .0671305
L2_d_exp_l~w |  -.0169151   .0253157    -0.67   0.510    -.0688586    .0350284
L3_d_exp_l~w |   .0135203   .0389427     0.35   0.731    -.0663835    .0934242
L4_d_exp_l~w |  -.0032906   .0667272    -0.05   0.961    -.1402034    .1336223
L5_d_exp_l~w |   .0136043   .0284181     0.48   0.636    -.0447049    .0719134
L6_d_exp_l~w |   .0040902   .0240969     0.17   0.866    -.0453527     .053533
L7_d_exp_l~w |  -.0609349   .0259644    -2.35   0.027    -.1142095   -.0076603
L8_d_exp_l~w |   .0305325   .0359563     0.85   0.403    -.0432437    .1043087
L9_d_exp_l~w |   .0277602   .0576902     0.48   0.634    -.0906102    .1461306
     d_ln_mw |  -.0312223    .022601    -1.38   0.178    -.0775957     .015151
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      6293           0        6293     |
---------------------------------------------------------------+

 ( 1)  - d_exp_ln_mw + d_ln_mw = 0

       F(  1,    27) =    1.72
            Prob > F =    0.2004

 ( 1)  F1_d_exp_ln_mw = 0
 ( 2)  F2_d_exp_ln_mw = 0
 ( 3)  F3_d_exp_ln_mw = 0
 ( 4)  F4_d_exp_ln_mw = 0
 ( 5)  F5_d_exp_ln_mw = 0
 ( 6)  F6_d_exp_ln_mw = 0
 ( 7)  F7_d_exp_ln_mw = 0
 ( 8)  F8_d_exp_ln_mw = 0
 ( 9)  F9_d_exp_ln_mw = 0

       F(  9,    27) =   15.28
            Prob > F =    0.0000
file ../temp/estimates.dta saved
(149,358 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(20 real changes made)
(1 real change made)
(note: file ../temp/estimates_stacked_dyn_w9.dta not found)
file ../temp/estimates_stacked_dyn_w9.dta saved
(note: file ../temp/estimates_stacked_dyn_w9.csv not found)
file ../temp/estimates_stacked_dyn_w9.csv saved
(data now sorted by model var at)
  (0 bytes saved)
===============================================================================
File: ../output/estimates_stacked_static.dta
Key: model var at
===============================================================================
  6:8(69955):2953630052:3628752615

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       model |          0
         var |          0
          at |          6           0           0          0          0
           b |          6    .0208672    .0562544  -.0420677   .0767107
          se |          6    .0327206    .0164663   .0155773   .0584883
-------------+---------------------------------------------------------
           N |          6    106045.3    36380.22      65222     146569
          r2 |          6    .0847768    .0008937   .0838263   .0858185
  p_equality |          6    .1184615    .0462648   .0615567   .1626275




(note: file ../output/estimates_stacked_static.dta not found)
file ../output/estimates_stacked_static.dta saved
(note: file ../output/estimates_stacked_static.csv not found)
file ../output/estimates_stacked_static.csv saved
(data now sorted by model var at)
  (0 bytes saved)
===============================================================================
File: ../output/estimates_stacked_dyn.dta
Key: model var at
===============================================================================
  42:9(97289):3457950435:1176009028

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       model |          0
         var |          0
          at |         42           0    4.361696         -9          9
           b |         42    .0013641    .0379589  -.0652484   .0973546
          se |         42    .0329636     .012441   .0174796   .0667272
-------------+---------------------------------------------------------
           N |         42    104823.3    23244.05      63145     124761
          r2 |         42    .0875276    .0013391   .0855857   .0888484
  p_equality |         42    .1335654    .0693538   .0464464   .2003701
  p_pretrend |         42    .1252894    .2598507   1.88e-08    .654567




(note: file ../output/estimates_stacked_dyn.dta not found)
file ../output/estimates_stacked_dyn.dta saved
(note: file ../output/estimates_stacked_dyn.csv not found)
file ../output/estimates_stacked_dyn.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> 
> 
> main <- function() {
+   instub  <- "../output/"
+   outstub <- "../output/"
+   
+   est <- read.csv(file.path(instub, "estimates_stacked_static.csv"))
+   
+   txt <- c("<tab:stacked>")
+   txt <- c(txt, 
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$b,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$b, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$b, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$se,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$se, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$se, sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_exp_ln_mw",]$b,
+                  est[est$model == "stacked_static_w6" & est$var == "d_exp_ln_mw",]$b, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_exp_ln_mw",]$b, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_exp_ln_mw",]$se,
+                  est[est$model == "stacked_static_w6" & est$var == "d_exp_ln_mw",]$se, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_exp_ln_mw",]$se, sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$p_equality,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$p_equality,
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$p_equality, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$r2,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$r2,
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$r2, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$N,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$N,
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$N, sep = "\t"))
+   
+   fileConn <- file(file.path(outstub, "stacked.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.25    0.20    0.79 


Execute:  StataMP-64 /e do "./figures.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./figures.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     use "../output/estimates_stacked_dyn.dta", clear
  2.     make_bounds
  3.     
.     local y_label       "-0.16(0.04).2"
  4.     local exp_ln_mw_var "exp_ln_mw_17"
  5.     sum at
  6.     local w = r(max)
  7. 
.     offset_x_axis
  8. 
.     plot_dynamics_both, model(stacked_dyn_w6) dyn_var(d_exp_ln_mw) ///
>         legend_dyn_var(Workplace MW) y_label(`y_label') ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce) ///
>         stat_var(d_ln_mw) legend_stat_var(Residence MW) ///
>         color_stat_var(maroon) symbol_stat_var(square) ///
>         x_label(-6(1)6) name(fd_stacked_w6)
  9.         
.     plot_dynamics_both, model(stacked_dyn_w3) dyn_var(d_exp_ln_mw) ///
>         legend_dyn_var(Workplace MW) y_label(`y_label') ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce) ///
>         stat_var(d_ln_mw) legend_stat_var(Residence MW) ///
>         color_stat_var(maroon) symbol_stat_var(square) ///
>         x_label(-3(1)3)  name(fd_stacked_w3)
 10.                 
.     plot_dynamics_both, model(stacked_dyn_w9) dyn_var(d_exp_ln_mw) ///
>         legend_dyn_var(Workplace MW) y_label(`y_label') ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce) ///
>         stat_var(d_ln_mw) legend_stat_var(Residence MW) ///
>         color_stat_var(maroon) symbol_stat_var(square) ///
>         x_label(-9(1)9) name(fd_stacked_w9)
 11. end

. 
. program make_bounds
  1.     gen b_lb = b - 1.96*se
  2.     gen b_ub = b + 1.96*se
  3. end

. 
. program offset_x_axis
  1.     syntax, [k(real 0.15)]
  2.     cap drop at_r at_l
  3.     gen at_r = at + `k'
  4.     gen at_l = at - `k'
  5. end

. 
. program plot_dynamics_both
  1.     syntax, model(str) dyn_var(str) stat_var(str) y_label(str) ///
>         legend_dyn_var(str) color_dyn_var(str) symbol_dyn_var(str) ///
>         legend_stat_var(str) color_stat_var(str) symbol_stat_var(str) ///
>         x_label(str) name(str)
  2.         
.     preserve
  3.         keep if model == "`model'"
  4.         twoway  (scatter b      at_r if var == "`dyn_var'" & at == 0,     
>       ///
>                      mcol(`color_dyn_var') msymbol(`symbol_dyn_var'))        
>    ///
>                 (scatter b      at   if var == "`dyn_var'" & at != 0,        
>    ///
>                      mcol(`color_dyn_var') msymbol(`symbol_dyn_var'))        
>    ///
>                 (rcap b_lb b_ub at_r if var == "`dyn_var'" & at == 0,        
>    ///
>                     lcol(`color_dyn_var') lw(thin))                          
>    ///
>                 (rcap b_lb b_ub at   if var == "`dyn_var'" & at != 0,        
>    ///
>                     lcol(`color_dyn_var') lw(thin))                          
>    ///
>                 (scatter b      at_l if var == "`stat_var'",                 
>    ///
>                     mcol(`color_stat_var') msymbol(`symbol_stat_var'))       
>    ///
>                 (rcap b_lb b_ub at_l if var == "`stat_var'",                 
>    ///
>                     col(`color_stat_var') lw(thin)),                         
>    ///
>             yline(0, lcol(black))                                            
>    ///
>             xlabel(`x_label', labsize(small)) xtitle("")                     
>       ///
>             ylabel(`y_label', grid labsize(small)) ytitle("Coefficient")     
>    ///
>             legend(order(1 `"`legend_dyn_var'"' 5 `"`legend_stat_var'"' ))   
>    ///
>             graphregion(color(white)) bgcolor(white)
  5.         
.         graph export "../output/`name'.png", replace
  6.         graph export "../output/`name'.eps", replace
  7.     restore
  8. end

. 
. 
. main

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          at |         42           0    4.361696         -9          9
(28 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note: file ../output/fd_stacked_w6.png not found)
(file ../output/fd_stacked_w6.png written in PNG format)
(note: file ../output/fd_stacked_w6.eps not found)
(file ../output/fd_stacked_w6.eps written in EPS format)
(34 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note: file ../output/fd_stacked_w3.png not found)
(file ../output/fd_stacked_w3.png written in PNG format)
(note: file ../output/fd_stacked_w3.eps not found)
(file ../output/fd_stacked_w3.eps written in EPS format)
(22 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note: file ../output/fd_stacked_w9.png not found)
(file ../output/fd_stacked_w9.png written in PNG format)
(note: file ../output/fd_stacked_w9.eps not found)
(file ../output/fd_stacked_w9.eps written in EPS format)

. 
end of do-file

 make.py ended: 2021-11-29 14:10:17
