
 make.py started: 2021-11-05 05:07:40 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_stacked\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/stacked_sample"
  2.         local outstub "../output"
  3. 
.         local cluster "cbsa10"
  4.         
.         ** STATIC
.         use "`instub'/stacked_sample.dta", clear
  5.         
.     reghdfe d_ln_rents d_ln_mw d_exp_ln_mw ///
>             d_ln_emp_* d_ln_estcount_* d_ln_avgwwage_* , ///
>             nocons absorb(year_month#event_id) cluster(statefips)
  6. 
.         /** DYNAMIC
>     reghdfe d_ln_rents d_ln_mw d_exp_ln_mw_17 ///
>             d_ln_emp_* d_ln_estcount_* d_ln_avgwwage_* , ///
>             nocons absorb(year_month#event_id) cluster(cbsa10)*/
. end

. 
. main
(dropped 1922 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    103,311
Absorbing 1 HDFE group                            F(  11,     27) =       5.12
Statistics robust to heteroskedasticity           Prob > F        =     0.0003
                                                  R-squared       =     0.0859
                                                  Adj R-squared   =     0.0383
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         28       Root MSE        =     0.0323

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0304378   .0166616    -1.83   0.079    -.0646247     .003749
 d_exp_ln_mw |    .086045   .0419587     2.05   0.050    -.0000472    .1721371
d_ln_emp_b~v |   .0029009   .0133137     0.22   0.829    -.0244164    .0302183
d_ln_emp_i~o |  -.0069508   .0047483    -1.46   0.155    -.0166935     .002792
d_ln_emp_fin |   .0093067   .0252521     0.37   0.715    -.0425063    .0611197
d_ln_estco~v |  -.1253692   .0649575    -1.93   0.064    -.2586511    .0079127
d_ln_estco~o |   .0046365    .019871     0.23   0.817    -.0361355    .0454086
d_ln_estco~n |   .0340946   .0559942     0.61   0.548    -.0807961    .1489853
d_ln_avgww~v |   -.004702    .004608    -1.02   0.317    -.0141569    .0047529
d_ln_avgww~o |   .0009565   .0030221     0.32   0.754    -.0052443    .0071574
d_ln_avgww~n |  -.0077661   .0028621    -2.71   0.011    -.0136387   -.0018934
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      5105           0        5105     |
---------------------------------------------------------------+

. 
end of do-file

 make.py ended: 2021-11-05 05:07:44
