
 make.py started: 2021-11-08 15:03:04 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_stacked\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/stacked_sample"
  2.         local outstub "../output"
  3. 
.         local cluster "cbsa10"
  4.         
.         use "`instub'/stacked_sample_window6.dta", clear
  5.         describe d_ln_emp_* d_ln_estcount_* d_ln_avgwwage_*, varlist
  6.         local controls = r(varlist)
  7.         
.         ** STATIC
.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(`controls') ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_static_w6) outfolder("../temp")
  8.                 
.         use "`instub'/stacked_sample_window3.dta", clear
  9.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(`controls') ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_static_w3) outfolder("../temp")
 10.                 
.         use "`instub'/stacked_sample_window9.dta", clear
 11.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(`controls') ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_static_w9) outfolder("../temp")
 12.                 
.         use ../temp/estimates_stacked_static_w6.dta, clear
 13.         foreach ff in stacked_static_w3 stacked_static_w9 {
 14.                 append using ../temp/estimates_`ff'.dta
 15.         }
 16.         save             `outstub'/estimates_stacked_static.dta, replace
 17.         export delimited `outstub'/estimates_stacked_static.csv, replace
 18.         
.         /** DYNAMIC
>     reghdfe d_ln_rents d_ln_mw ///
>                 F3_d_exp_ln_mw F2_d_exp_ln_mw F1_d_exp_ln_mw ///
>                 d_exp_ln_mw L1_d_exp_ln_mw L2_d_exp_ln_mw L3_d_exp_ln_mw, ///
>             nocons absorb(year_month#event_id) cluster(statefips)
>                 
>     reghdfe d_ln_rents d_ln_mw ///
>             F6_d_exp_ln_mw F5_d_exp_ln_mw F4_d_exp_ln_mw ///
>                 F3_d_exp_ln_mw F2_d_exp_ln_mw F1_d_exp_ln_mw ///
>                 d_exp_ln_mw L1_d_exp_ln_mw L2_d_exp_ln_mw L3_d_exp_ln_mw ///
>                 L4_d_exp_ln_mw L5_d_exp_ln_mw L6_d_exp_ln_mw, ///
>             nocons absorb(year_month#event_id) cluster(statefips)*/
. 
. end

. 
. main

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
d_ln_emp_bizs~v float   %9.0g                 
d_ln_emp_info   float   %9.0g                 
d_ln_emp_fin    float   %9.0g                 
d_ln_estcount~v float   %9.0g                 
d_ln_estcount~o float   %9.0g                 
d_ln_estcount~n float   %9.0g                 
d_ln_avgwwage~v float   %9.0g                 
d_ln_avgwwage~o float   %9.0g                 
d_ln_avgwwage~n float   %9.0g                 
(dropped 2005 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    106,211
Absorbing 1 HDFE group                            F(  11,     27) =       4.61
Statistics robust to heteroskedasticity           Prob > F        =     0.0006
                                                  R-squared       =     0.0847
                                                  Adj R-squared   =     0.0381
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         28       Root MSE        =     0.0325

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0274036   .0155146    -1.77   0.089     -.059237    .0044298
 d_exp_ln_mw |   .0821922   .0377432     2.18   0.038     .0047495    .1596349
d_ln_emp_b~v |   .0001042   .0137129     0.01   0.994    -.0280324    .0282409
d_ln_emp_i~o |  -.0066242   .0043238    -1.53   0.137     -.015496    .0022475
d_ln_emp_fin |   .0087767   .0231783     0.38   0.708    -.0387812    .0563345
d_ln_estco~v |  -.1218486   .0615819    -1.98   0.058    -.2482042    .0045069
d_ln_estco~o |   .0039513   .0188996     0.21   0.836    -.0348274      .04273
d_ln_estco~n |   .0313959   .0580825     0.54   0.593    -.0877795    .1505713
d_ln_avgww~v |  -.0037072   .0045253    -0.82   0.420    -.0129923    .0055779
d_ln_avgww~o |   .0009415   .0030546     0.31   0.760    -.0053261     .007209
d_ln_avgww~n |  -.0078492   .0027286    -2.88   0.008    -.0134479   -.0022504
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      5129           0        5129     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    4.44
            Prob > F =    0.0446
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(108,600 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w6.dta not found)
file ../temp/estimates_stacked_static_w6.dta saved
(note: file ../temp/estimates_stacked_static_w6.csv not found)
file ../temp/estimates_stacked_static_w6.csv saved
(dropped 1085 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     65,141
Absorbing 1 HDFE group                            F(  11,     27) =       8.22
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0838
                                                  Adj R-squared   =     0.0396
                                                  Within R-sq.    =     0.0004
Number of clusters (statefips) =         28       Root MSE        =     0.0333

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0440844   .0266897    -1.65   0.110    -.0988472    .0106783
 d_exp_ln_mw |   .0874184   .0584994     1.49   0.147    -.0326125    .2074493
d_ln_emp_b~v |   .0162067   .0185687     0.87   0.390    -.0218931    .0543065
d_ln_emp_i~o |   -.003371   .0061311    -0.55   0.587    -.0159509    .0092089
d_ln_emp_fin |   .0267063   .0186576     1.43   0.164    -.0115759    .0649885
d_ln_estco~v |  -.1117119   .0486139    -2.30   0.030    -.2114593   -.0119645
d_ln_estco~o |   .0018539   .0176988     0.10   0.917     -.034461    .0381689
d_ln_estco~n |   .0555006    .062243     0.89   0.380    -.0722114    .1832126
d_ln_avgww~v |  -.0063136   .0061335    -1.03   0.312    -.0188986    .0062714
d_ln_avgww~o |   .0056678   .0041593     1.36   0.184    -.0028663    .0142019
d_ln_avgww~n |  -.0046126   .0020139    -2.29   0.030    -.0087448   -.0004803
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      2990           0        2990     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    2.49
            Prob > F =    0.1263
file ../temp/estimates.dta saved
(66,400 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w3.dta not found)
file ../temp/estimates_stacked_static_w3.dta saved
(note: file ../temp/estimates_stacked_static_w3.csv not found)
file ../temp/estimates_stacked_static_w3.csv saved
(dropped 2694 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    146,395
Absorbing 1 HDFE group                            F(  11,     27) =       5.93
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.0858
                                                  Adj R-squared   =     0.0384
                                                  Within R-sq.    =     0.0004
Number of clusters (statefips) =         28       Root MSE        =     0.0321

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0183303   .0172212    -1.06   0.297    -.0536653    .0170046
 d_exp_ln_mw |   .0688172   .0428797     1.60   0.120    -.0191647    .1567992
d_ln_emp_b~v |  -.0027333   .0184727    -0.15   0.883    -.0406361    .0351696
d_ln_emp_i~o |  -.0011337   .0039588    -0.29   0.777    -.0092566    .0069892
d_ln_emp_fin |   .0037882   .0258506     0.15   0.885    -.0492529    .0568293
d_ln_estco~v |  -.1483686   .0670154    -2.21   0.035    -.2858727   -.0108644
d_ln_estco~o |   .0012763   .0190529     0.07   0.947    -.0378169    .0403696
d_ln_estco~n |    .038598   .0544811     0.71   0.485    -.0731881     .150384
d_ln_avgww~v |  -.0003041   .0049961    -0.06   0.952    -.0105552     .009947
d_ln_avgww~o |   .0006565   .0035488     0.18   0.855    -.0066251    .0079381
d_ln_avgww~n |  -.0069023   .0036952    -1.87   0.073    -.0144842    .0006796
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      7211           0        7211     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    2.14
            Prob > F =    0.1546
file ../temp/estimates.dta saved
(149,376 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w9.dta not found)
file ../temp/estimates_stacked_static_w9.dta saved
(note: file ../temp/estimates_stacked_static_w9.csv not found)
file ../temp/estimates_stacked_static_w9.csv saved
(note: file ../output/estimates_stacked_static.dta not found)
file ../output/estimates_stacked_static.dta saved
(note: file ../output/estimates_stacked_static.csv not found)
file ../output/estimates_stacked_static.csv saved

. 
end of do-file

 make.py ended: 2021-11-08 15:04:27
