
 make.py started: 2021-11-10 14:43:20 C:\Users\diegog\Desktop\Diego\min_wage_rent\analysis\fd_stacked\code 




Execute:  StataMP-64 /e do "./estimates.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./estimates.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.         local instub "../../../drive/derived_large/stacked_sample"
  2.         local logfile "../output/data_file_manifest.log"
  3. 
.         local cluster "cbsa10"
  4.         
.         use "`instub'/stacked_sample_window6.dta", clear
  5.         *describe d_ln_emp_* d_ln_estcount_* d_ln_avgwwage_*, varlist
.         *local controls = r(varlist)
.         
.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_static_w6) outfolder("../temp")
  6.                 
.     estimate_dyn_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_dyn_w6) outfolder("../temp")
  7.                 
.         use "`instub'/stacked_sample_window3.dta", clear
  8.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_static_w3) outfolder("../temp")
  9.                 
.     estimate_dyn_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") w(3) ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_dyn_w3) outfolder("../temp")
 10.                 
.         use "`instub'/stacked_sample_window9.dta", clear
 11.     estimate_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_static_w9) outfolder("../temp")
 12.                 
.     estimate_dyn_stacked_model, depvar(d_ln_rents) res_mw_var(d_ln_mw) ///
>             wkp_mw_var(d_exp_ln_mw) controls(" ") w(9) ///
>             absorb(year_month#event_id) cluster(statefips) ///
>                 model_name(stacked_dyn_w9) outfolder("../temp")
 13.                 
.         use ../temp/estimates_stacked_static_w6.dta, clear
 14.         foreach ff in stacked_static_w3 stacked_static_w9 {
 15.                 append using ../temp/estimates_`ff'.dta
 16.         }
 17.         save_data "../output/estimates_stacked_static.dta", ///
>             key(model var at) log(`logfile') replace
 18.         export delimited "../output/estimates_stacked_static.csv", replace
 19.         
.         use ../temp/estimates_stacked_dyn_w6.dta, clear
 20.         foreach ff in stacked_dyn_w3 stacked_dyn_w9 {
 21.                 append using ../temp/estimates_`ff'.dta
 22.         }
 23.         save_data "../output/estimates_stacked_dyn.dta", ///
>             key(model var at) log(`logfile') replace
 24.         export delimited "../output/estimates_stacked_dyn.csv", replace
 25. end

. 
. main
(dropped 1982 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     79,120
Absorbing 1 HDFE group                            F(   2,     27) =       2.68
Statistics robust to heteroskedasticity           Prob > F        =     0.0865
                                                  R-squared       =     0.0991
                                                  Adj R-squared   =     0.0448
                                                  Within R-sq.    =     0.0000
Number of clusters (statefips) =         28       Root MSE        =     0.0313

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0612092    .035988    -1.70   0.100    -.1350504     .012632
 d_exp_ln_mw |   .0759418   .0665698     1.14   0.264    -.0606482    .2125318
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      4496           0        4496     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    1.83
            Prob > F =    0.1876
(note: file ../temp/estimates.dta not found)
file ../temp/estimates.dta saved
(81,248 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w6.dta not found)
file ../temp/estimates_stacked_static_w6.dta saved
(note: file ../temp/estimates_stacked_static_w6.csv not found)
file ../temp/estimates_stacked_static_w6.csv saved
(dropped 1851 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     74,801
Absorbing 1 HDFE group                            F(  14,     27) =      10.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1015
                                                  Adj R-squared   =     0.0469
                                                  Within R-sq.    =     0.0004
Number of clusters (statefips) =         28       Root MSE        =     0.0309

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
F6_d_exp_l~w |   -.040172   .0243633    -1.65   0.111    -.0901614    .0098174
F5_d_exp_l~w |   .0789418   .0238655     3.31   0.003     .0299739    .1279097
F4_d_exp_l~w |  -.0388382   .0265019    -1.47   0.154    -.0932157    .0155393
F3_d_exp_l~w |  -.0311064   .0264578    -1.18   0.250    -.0853932    .0231805
F2_d_exp_l~w |  -.0000596   .0432657    -0.00   0.999    -.0888336    .0887143
F1_d_exp_l~w |  -.0148581   .0280337    -0.53   0.600    -.0723785    .0426623
 d_exp_ln_mw |   .0744775   .0810007     0.92   0.366    -.0917222    .2406773
L1_d_exp_l~w |  -.0328914   .0626907    -0.52   0.604    -.1615221    .0957392
L2_d_exp_l~w |   .0292399   .0304328     0.96   0.345     -.033203    .0916828
L3_d_exp_l~w |  -.0190613   .0218236    -0.87   0.390    -.0638396     .025717
L4_d_exp_l~w |   .0023082   .0513206     0.04   0.964     -.102993    .1076094
L5_d_exp_l~w |  -.0314246   .0315005    -1.00   0.327    -.0960583    .0332091
L6_d_exp_l~w |  -.0191934   .0532784    -0.36   0.721    -.1285116    .0901248
     d_ln_mw |  -.0648458   .0429101    -1.51   0.142    -.1528901    .0231985
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      4271           0        4271     |
---------------------------------------------------------------+

 ( 1)  - d_exp_ln_mw + d_ln_mw = 0

       F(  1,    27) =    1.29
            Prob > F =    0.2651

 ( 1)  F1_d_exp_ln_mw = 0
 ( 2)  F2_d_exp_ln_mw = 0
 ( 3)  F3_d_exp_ln_mw = 0
 ( 4)  F4_d_exp_ln_mw = 0
 ( 5)  F5_d_exp_ln_mw = 0
 ( 6)  F6_d_exp_ln_mw = 0

       F(  6,    27) =    4.46
            Prob > F =    0.0029
file ../temp/estimates.dta saved
(81,236 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(14 real changes made)
(1 real change made)
(note: file ../temp/estimates_stacked_dyn_w6.dta not found)
file ../temp/estimates_stacked_dyn_w6.dta saved
(note: file ../temp/estimates_stacked_dyn_w6.csv not found)
file ../temp/estimates_stacked_dyn_w6.csv saved
(dropped 1085 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     60,703
Absorbing 1 HDFE group                            F(   2,     27) =       0.82
Statistics robust to heteroskedasticity           Prob > F        =     0.4496
                                                  R-squared       =     0.0867
                                                  Adj R-squared   =     0.0404
                                                  Within R-sq.    =     0.0001
Number of clusters (statefips) =         28       Root MSE        =     0.0334

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0400827   .0328434    -1.22   0.233    -.1074718    .0273063
 d_exp_ln_mw |   .0833011   .0656767     1.27   0.216    -.0514563    .2180585
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      2931           0        2931     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    1.65
            Prob > F =    0.2103
file ../temp/estimates.dta saved
(61,864 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w3.dta not found)
file ../temp/estimates_stacked_static_w3.dta saved
(note: file ../temp/estimates_stacked_static_w3.csv not found)
file ../temp/estimates_stacked_static_w3.csv saved
(dropped 1081 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     58,708
Absorbing 1 HDFE group                            F(   8,     27) =       6.99
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.0885
                                                  Adj R-squared   =     0.0416
                                                  Within R-sq.    =     0.0002
Number of clusters (statefips) =         28       Root MSE        =     0.0331

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
F3_d_exp_l~w |  -.0198193   .0252932    -0.78   0.440    -.0717166     .032078
F2_d_exp_l~w |   .0052244   .0226509     0.23   0.819    -.0412513    .0517001
F1_d_exp_l~w |  -.0071179   .0144628    -0.49   0.627     -.036793    .0225573
 d_exp_ln_mw |   .0838446   .0645356     1.30   0.205    -.0485716    .2162608
L1_d_exp_l~w |  -.0208843   .0225111    -0.93   0.362    -.0670733    .0253047
L2_d_exp_l~w |   .0418972   .0135625     3.09   0.005     .0140691    .0697252
L3_d_exp_l~w |  -.0141066   .0343993    -0.41   0.685    -.0846882    .0564749
     d_ln_mw |  -.0393137   .0321633    -1.22   0.232    -.1053074      .02668
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      2869           0        2869     |
---------------------------------------------------------------+

 ( 1)  - d_exp_ln_mw + d_ln_mw = 0

       F(  1,    27) =    1.71
            Prob > F =    0.2026

 ( 1)  F1_d_exp_ln_mw = 0
 ( 2)  F2_d_exp_ln_mw = 0
 ( 3)  F3_d_exp_ln_mw = 0

       F(  3,    27) =    0.21
            Prob > F =    0.8868
file ../temp/estimates.dta saved
(61,858 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(8 real changes made)
(1 real change made)
(note: file ../temp/estimates_stacked_dyn_w3.dta not found)
file ../temp/estimates_stacked_dyn_w3.dta saved
(note: file ../temp/estimates_stacked_dyn_w3.csv not found)
file ../temp/estimates_stacked_dyn_w3.csv saved
(dropped 2603 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    100,451
Absorbing 1 HDFE group                            F(   2,     27) =       1.06
Statistics robust to heteroskedasticity           Prob > F        =     0.3589
                                                  R-squared       =     0.1037
                                                  Adj R-squared   =     0.0469
                                                  Within R-sq.    =     0.0000
Number of clusters (statefips) =         28       Root MSE        =     0.0312

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     d_ln_mw |  -.0515972   .0359112    -1.44   0.162     -.125281    .0220865
 d_exp_ln_mw |   .0828426   .0639306     1.30   0.206    -.0483323    .2140174
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      5982           0        5982     |
---------------------------------------------------------------+

 ( 1)  d_ln_mw - d_exp_ln_mw = 0

       F(  1,    27) =    1.85
            Prob > F =    0.1848
file ../temp/estimates.dta saved
(103,111 observations deleted)
(0 observations deleted)
(1 missing value generated)
variable var was str7 now str11
(1 real change made)
(2 real changes made)
(note: file ../temp/estimates_stacked_static_w9.dta not found)
file ../temp/estimates_stacked_static_w9.dta saved
(note: file ../temp/estimates_stacked_static_w9.csv not found)
file ../temp/estimates_stacked_static_w9.csv saved
(dropped 2318 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     85,882
Absorbing 1 HDFE group                            F(  20,     27) =     942.77
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1067
                                                  Adj R-squared   =     0.0495
                                                  Within R-sq.    =     0.0005
Number of clusters (statefips) =         28       Root MSE        =     0.0301

                             (Std. Err. adjusted for 28 clusters in statefips)
------------------------------------------------------------------------------
             |               Robust
  d_ln_rents |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
F9_d_exp_l~w |   .0364745   .0307364     1.19   0.246    -.0265914    .0995404
F8_d_exp_l~w |  -.0460848    .036884    -1.25   0.222    -.1217646    .0295949
F7_d_exp_l~w |  -.0088259   .0532714    -0.17   0.870    -.1181297     .100478
F6_d_exp_l~w |    -.01118   .0318911    -0.35   0.729    -.0766151    .0542551
F5_d_exp_l~w |   .1283843   .0415589     3.09   0.005     .0431125    .2136561
F4_d_exp_l~w |   -.045637   .0338735    -1.35   0.189    -.1151398    .0238657
F3_d_exp_l~w |  -.0702925   .0240799    -2.92   0.007    -.1197005   -.0208846
F2_d_exp_l~w |   .0513929   .0461294     1.11   0.275    -.0432568    .1460426
F1_d_exp_l~w |  -.0387227   .0487093    -0.79   0.434    -.1386659    .0612205
 d_exp_ln_mw |   .0918108   .0841412     1.09   0.285    -.0808326    .2644542
L1_d_exp_l~w |  -.0199952   .0766259    -0.26   0.796    -.1772185     .137228
L2_d_exp_l~w |   .0132698   .0297842     0.45   0.659    -.0478423    .0743818
L3_d_exp_l~w |  -.0360148   .0555621    -0.65   0.522    -.1500189    .0779892
L4_d_exp_l~w |   .0162628    .090517     0.18   0.859    -.1694628    .2019883
L5_d_exp_l~w |  -.0095996   .0209246    -0.46   0.650    -.0525334    .0333342
L6_d_exp_l~w |   -.014148   .0640569    -0.22   0.827    -.1455819    .1172858
L7_d_exp_l~w |  -.0411349   .0331425    -1.24   0.225    -.1091378     .026868
L8_d_exp_l~w |  -.0132932   .0778428    -0.17   0.866    -.1730135    .1464271
L9_d_exp_l~w |   .0720078   .0254626     2.83   0.009     .0197629    .1242527
     d_ln_mw |  -.0653768   .0419109    -1.56   0.130    -.1513708    .0206172
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
           Absorbed FE | Categories  - Redundant  = Num. Coefs |
-----------------------+---------------------------------------|
   year_month#event_id |      5145           0        5145     |
---------------------------------------------------------------+

 ( 1)  - d_exp_ln_mw + d_ln_mw = 0

       F(  1,    27) =    1.62
            Prob > F =    0.2140

 ( 1)  F1_d_exp_ln_mw = 0
 ( 2)  F2_d_exp_ln_mw = 0
 ( 3)  F3_d_exp_ln_mw = 0
 ( 4)  F4_d_exp_ln_mw = 0
 ( 5)  F5_d_exp_ln_mw = 0
 ( 6)  F6_d_exp_ln_mw = 0
 ( 7)  F7_d_exp_ln_mw = 0
 ( 8)  F8_d_exp_ln_mw = 0
 ( 9)  F9_d_exp_ln_mw = 0

       F(  9,    27) =   34.87
            Prob > F =    0.0000
file ../temp/estimates.dta saved
(103,093 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 real change made)
(20 real changes made)
(1 real change made)
(note: file ../temp/estimates_stacked_dyn_w9.dta not found)
file ../temp/estimates_stacked_dyn_w9.dta saved
(note: file ../temp/estimates_stacked_dyn_w9.csv not found)
file ../temp/estimates_stacked_dyn_w9.csv saved
(data now sorted by model var at)
  (0 bytes saved)
===============================================================================
File: ../output/estimates_stacked_static.dta
Key: model var at
===============================================================================
  6:8(69955):1927693966:3793025897

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       model |          0
         var |          0
          at |          6           0           0          0          0
           b |          6     .014866    .0724688  -.0612092   .0833011
          se |          6    .0501533    .0167536   .0328434   .0665698
-------------+---------------------------------------------------------
           N |          6    80091.33    17791.76      60703     100451
          r2 |          6    .0965096     .007854    .086716   .1036804
  p_equality |          6    .1942247    .0124937   .1848147   .2102746




(note: file ../output/estimates_stacked_static.dta not found)
file ../output/estimates_stacked_static.dta saved
(note: file ../output/estimates_stacked_static.csv not found)
file ../output/estimates_stacked_static.csv saved
(data now sorted by model var at)
  (0 bytes saved)
===============================================================================
File: ../output/estimates_stacked_dyn.dta
Key: model var at
===============================================================================
  42:9(97289):4099960725:973251532

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       model |          0
         var |          0
          at |         42           0    4.361696         -9          9
           b |         42   -.0021062    .0465118  -.0702925   .1283843
          se |         42    .0410507    .0200118   .0135625    .090517
-------------+---------------------------------------------------------
           N |         42    77012.33    10267.48      58708      85882
          r2 |         42    .1014975    .0067911   .0885046   .1066954
  p_equality |         42    .2288619    .0263173   .2025693   .2651497
  p_pretrend |         42     .169897    .3519704   1.38e-12   .8868074




(note: file ../output/estimates_stacked_dyn.dta not found)
file ../output/estimates_stacked_dyn.dta saved
(note: file ../output/estimates_stacked_dyn.csv not found)
file ../output/estimates_stacked_dyn.csv saved

. 
end of do-file


Execute:  R CMD BATCH --no-save "./tables.R" tables.Rout

R version 4.1.1 (2021-08-10) -- "Kick Things"
Copyright (C) 2021 The R Foundation for Statistical Computing
Platform: x86_64-w64-mingw32/x64 (64-bit)

R is free software and comes with ABSOLUTELY NO WARRANTY.
You are welcome to redistribute it under certain conditions.
Type 'license()' or 'licence()' for distribution details.

  Natural language support but running in an English locale

R is a collaborative project with many contributors.
Type 'contributors()' for more information and
'citation()' on how to cite R or R packages in publications.

Type 'demo()' for some demos, 'help()' for on-line help, or
'help.start()' for an HTML browser interface to help.
Type 'q()' to quit R.

> remove(list = ls())
> 
> 
> main <- function() {
+   instub  <- "../output/"
+   outstub <- "../output/"
+   
+   est <- read.csv(file.path(instub, "estimates_stacked_static.csv"))
+   
+   txt <- c("<tab:stacked>")
+   txt <- c(txt, 
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$b,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$b, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$b, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$se,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$se, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$se, sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_exp_ln_mw",]$b,
+                  est[est$model == "stacked_static_w6" & est$var == "d_exp_ln_mw",]$b, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_exp_ln_mw",]$b, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_exp_ln_mw",]$se,
+                  est[est$model == "stacked_static_w6" & est$var == "d_exp_ln_mw",]$se, 
+                  est[est$model == "stacked_static_w9" & est$var == "d_exp_ln_mw",]$se, sep = "\t"))
+   
+   txt <- c(txt, 
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$p_equality,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$p_equality,
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$p_equality, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$r2,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$r2,
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$r2, sep = "\t"),
+            paste(est[est$model == "stacked_static_w3" & est$var == "d_ln_mw",]$N,
+                  est[est$model == "stacked_static_w6" & est$var == "d_ln_mw",]$N,
+                  est[est$model == "stacked_static_w9" & est$var == "d_ln_mw",]$N, sep = "\t"))
+   
+   fileConn <- file(file.path(outstub, "stacked.txt"))
+   writeLines(txt, fileConn)
+   close(fileConn)
+ }
> 
> main()
> 
> proc.time()
   user  system elapsed 
   0.26    0.17    0.65 


Execute:  StataMP-64 /e do "./figures.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./figures.do 

. clear all

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/min_wage/ado
  [1]  (BASE)      "C:\Program Files\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/min_wage/ado"

. set maxvar 32000 


. 
. program main
  1.     use "../output/estimates_stacked_dyn.dta", clear
  2.     make_bounds
  3.     
.     local y_label       "-0.16(0.04).2"
  4.     local exp_ln_mw_var "exp_ln_mw_17"
  5.     sum at
  6.     local w = r(max)
  7. 
.     offset_x_axis
  8. 
.     plot_dynamics_both, model(stacked_dyn_w6) dyn_var(d_exp_ln_mw) ///
>         legend_dyn_var(Workplace MW) y_label(`y_label') ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce) ///
>         stat_var(d_ln_mw) legend_stat_var(Residence MW) ///
>         color_stat_var(maroon) symbol_stat_var(square) ///
>         x_label(-6(1)6) name(fd_stacked_w6)
  9.         
.     plot_dynamics_both, model(stacked_dyn_w3) dyn_var(d_exp_ln_mw) ///
>         legend_dyn_var(Workplace MW) y_label(`y_label') ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce) ///
>         stat_var(d_ln_mw) legend_stat_var(Residence MW) ///
>         color_stat_var(maroon) symbol_stat_var(square) ///
>         x_label(-3(1)3)  name(fd_stacked_w3)
 10.                 
.     plot_dynamics_both, model(stacked_dyn_w9) dyn_var(d_exp_ln_mw) ///
>         legend_dyn_var(Workplace MW) y_label(`y_label') ///
>         color_dyn_var(navy) symbol_dyn_var(cirlce) ///
>         stat_var(d_ln_mw) legend_stat_var(Residence MW) ///
>         color_stat_var(maroon) symbol_stat_var(square) ///
>         x_label(-9(1)9) name(fd_stacked_w9)
 11. end

. 
. program make_bounds
  1.     gen b_lb = b - 1.96*se
  2.     gen b_ub = b + 1.96*se
  3. end

. 
. program offset_x_axis
  1.     syntax, [k(real 0.15)]
  2.     cap drop at_r at_l
  3.     gen at_r = at + `k'
  4.     gen at_l = at - `k'
  5. end

. 
. program plot_dynamics_both
  1.     syntax, model(str) dyn_var(str) stat_var(str) y_label(str) ///
>         legend_dyn_var(str) color_dyn_var(str) symbol_dyn_var(str) ///
>         legend_stat_var(str) color_stat_var(str) symbol_stat_var(str) ///
>         x_label(str) name(str)
  2.         
.     preserve
  3.         keep if model == "`model'"
  4.         twoway  (scatter b      at_r if var == "`dyn_var'" & at == 0,     
>       ///
>                      mcol(`color_dyn_var') msymbol(`symbol_dyn_var'))        
>    ///
>                 (scatter b      at   if var == "`dyn_var'" & at != 0,        
>    ///
>                      mcol(`color_dyn_var') msymbol(`symbol_dyn_var'))        
>    ///
>                 (rcap b_lb b_ub at_r if var == "`dyn_var'" & at == 0,        
>    ///
>                     lcol(`color_dyn_var') lw(thin))                          
>    ///
>                 (rcap b_lb b_ub at   if var == "`dyn_var'" & at != 0,        
>    ///
>                     lcol(`color_dyn_var') lw(thin))                          
>    ///
>                 (scatter b      at_l if var == "`stat_var'",                 
>    ///
>                     mcol(`color_stat_var') msymbol(`symbol_stat_var'))       
>    ///
>                 (rcap b_lb b_ub at_l if var == "`stat_var'",                 
>    ///
>                     col(`color_stat_var') lw(thin)),                         
>    ///
>             yline(0, lcol(black))                                            
>    ///
>             xlabel(`x_label', labsize(small)) xtitle("")                     
>       ///
>             ylabel(`y_label', grid labsize(small)) ytitle("Coefficient")     
>    ///
>             legend(order(1 `"`legend_dyn_var'"' 5 `"`legend_stat_var'"' ))   
>    ///
>             graphregion(color(white)) bgcolor(white)
  5.         
.         graph export "../output/`name'.png", replace
  6.         graph export "../output/`name'.eps", replace
  7.     restore
  8. end

. 
. 
. main

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          at |         42           0    4.361696         -9          9
(28 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note: file ../output/fd_stacked_w6.png not found)
(file ../output/fd_stacked_w6.png written in PNG format)
(note: file ../output/fd_stacked_w6.eps not found)
(file ../output/fd_stacked_w6.eps written in EPS format)
(34 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note: file ../output/fd_stacked_w3.png not found)
(file ../output/fd_stacked_w3.png written in PNG format)
(note: file ../output/fd_stacked_w3.eps not found)
(file ../output/fd_stacked_w3.eps written in EPS format)
(22 observations deleted)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note:  named style cirlce not found in class symbol, default attributes
    used)
(note: file ../output/fd_stacked_w9.png not found)
(file ../output/fd_stacked_w9.png written in PNG format)
(note: file ../output/fd_stacked_w9.eps not found)
(file ../output/fd_stacked_w9.eps written in EPS format)

. 
end of do-file

 make.py ended: 2021-11-10 14:43:44
